[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the pharmacologic class labeled as \"Phosphodiesterase 5 Inhibitors\" in the database?", "output": "MATCH (n:PharmacologicClass { name: \"Phosphodiesterase 5 Inhibitors\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the diseases with the license labeled as \"CC BY 3.0\".", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the biological process that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_1902966\"?", "output": "MATCH (n:BiologicalProcess { url: \"http://purl.obolibrary.org/obo/GO_1902966\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the node labeled as 'SideEffect' that has the specific URL \"http://identifiers.org/umls/C0016508\"?", "output": "MATCH (n:SideEffect { url: \"http://identifiers.org/umls/C0016508\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve information about pathways that are available under a CC0 1.0 license?", "output": "MATCH (n:Pathway { license: \"CC0 1.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the CellularComponent nodes provided by the Gene Ontology source?", "output": "MATCH (n:CellularComponent { source: \"Gene Ontology\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the properties and data associated with the gene identified as \"VN1R5\"?", "output": "MATCH (n:Gene { name: \"VN1R5\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the SideEffect node associated with the URL \"http://identifiers.org/umls/C0019917\"?", "output": "MATCH (n:SideEffect { url: \"http://identifiers.org/umls/C0019917\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all nodes representing MolecularFunction with the source set to \"Gene Ontology.\"", "output": "MATCH (n:MolecularFunction { source: \"Gene Ontology\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we fetch all properties of the Gene node that has an identifier of 9703 from the database?", "output": "MATCH (n:Gene { identifier: 9703 }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the node labeled \"SideEffect\" with the property URL set to \"http://identifiers.org/umls/C0162323\"?", "output": "MATCH (n:SideEffect { url: \"http://identifiers.org/umls/C0162323\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can be retrieved about the cellular component known as the \"RNA polymerase I transcription factor complex\"?", "output": "MATCH (n:CellularComponent { name: \"RNA polymerase I transcription factor complex\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you fetch the anatomical node where the name property is 'sternoclavicular joint'?", "output": "MATCH (n:Anatomy { name: \"sternoclavicular joint\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can we retrieve about the compound with the identifier \"DB04948\" from the database?", "output": "MATCH (n:Compound { identifier: \"DB04948\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the details of the compound that has the InChIKey \"RMUCZJUITONUFY-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=RMUCZJUITONUFY-UHFFFAOYSA-N\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available about the molecular function named \"fatty-acyl-CoA synthase activity\" in the database?", "output": "MATCH (n:MolecularFunction { name: \"fatty-acyl-CoA synthase activity\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have a license labeled \"CC BY-NC 4.0\" in their properties?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can be retrieved about the cellular component associated with the URL \"http://purl.obolibrary.org/obo/GO_1903095\"?", "output": "MATCH (n:CellularComponent { url: \"http://purl.obolibrary.org/obo/GO_1903095\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entity corresponds to the mesh ID \"D000302\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D000302\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular components have been sourced from the Gene Ontology according to the database?", "output": "MATCH (n:CellularComponent { source: \"Gene Ontology\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entry corresponds to the identifier \"UBERON:0002165\"?", "output": "MATCH (n:Anatomy { identifier: \"UBERON:0002165\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can you retrieve about the gene named \"VPS13D\" from the database?", "output": "MATCH (n:Gene { name: \"VPS13D\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy items are associated with the CC BY 3.0 license?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic classes are available in the database that have been sourced from the FDA through DrugCentral?", "output": "MATCH (n:PharmacologicClass { source: \"FDA via DrugCentral\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can be retrieved about the gene with the identifier 80740?", "output": "MATCH (n:Gene { identifier: 80740 }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve gene nodes where the license is specified as CC0 1.0?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function is associated with the identifier \"GO:0015277\" in the data?", "output": "MATCH (n:MolecularFunction { identifier: \"GO:0015277\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the node labeled as 'Compound' that has the InChI property set to a specific value of \"InChI=1S/C39H43N3O11S/c1-16-9-20-10-22-37(46)42-23-13-50-38(47)39(21-12-25(48-5)24(44)11-19(21)7-8-40-39)14-54-36(30(42)29(41(22)4)26(20)31(45)32(16)49-6)28-27(23)35-34(51-15-52-35)17(2)33(28)53-18(3)43/h9,11-12,22-23,29-30,36-37,40,44-46H,7-8,10,13-15H2,1-6H3/t22-,23-,29+,30+,36+,37-,39+/m0/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C39H43N3O11S/c1-16-9-20-10-22-37(46)42-23-13-50-38(47)39(21-12-25(48-5)24(44)11-19(21)7-8-40-39)14-54-36(30(42)29(41(22)4)26(20)31(45)32(16)49-6)28-27(23)35-34(51-15-52-35)17(2)33(28)53-18(3)43/h9,11-12,22-23,29-30,36-37,40,44-46H,7-8,10,13-15H2,1-6H3/t22-,23-,29+,30+,36+,37-,39+/m0/s1\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the disease with the identifier \"DOID:90\" in the database?", "output": "MATCH (n:Disease { identifier: \"DOID:90\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the Compound node that contains the URL \"http://www.drugbank.ca/drugs/DB01181\".", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB01181\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Please show me the data associated with the biological process called \"ESCRT III complex disassembly\".", "output": "MATCH (n:BiologicalProcess { name: \"ESCRT III complex disassembly\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the disease entity associated with \"DOID:418\"?", "output": "MATCH (n:Disease { identifier: \"DOID:418\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the gene with the name \"PRAC1\" in the database?", "output": "MATCH (n:Gene { name: \"PRAC1\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which properties are associated with the gene node that has an identifier of 3276?", "output": "MATCH (n:Gene { identifier: 3276 }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene is selected and returned from the database when its identifier equals 94137?", "output": "MATCH (n:Gene { identifier: 94137 }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you find the cellular component labeled with \"GO:0000110\"?", "output": "MATCH (n:CellularComponent { identifier: \"GO:0000110\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the node labeled as \"BiologicalProcess\" that has the URL property with the value \"http://purl.obolibrary.org/obo/GO_0007020\"?", "output": "MATCH (n:BiologicalProcess { url: \"http://purl.obolibrary.org/obo/GO_0007020\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the molecular function with the URL \"http://purl.obolibrary.org/obo/GO_0004992\"?", "output": "MATCH (n:MolecularFunction { url: \"http://purl.obolibrary.org/obo/GO_0004992\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have their chromosome attribute set to \"14\"?", "output": "MATCH (n:Gene { chromosome: \"14\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can you retrieve about the biological process labeled with the identifier \"GO:0006554\"?", "output": "MATCH (n:BiologicalProcess { identifier: \"GO:0006554\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the molecular function associated with the identifier \"GO:0008374\"?", "output": "MATCH (n:MolecularFunction { identifier: \"GO:0008374\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the characteristics and properties of the gene \"CNTN6\" in the database?", "output": "MATCH (n:Gene { name: \"CNTN6\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the cellular component associated with \"GO:0071144\"?", "output": "MATCH (n:CellularComponent { identifier: \"GO:0071144\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find symptoms with identifiers that commence with \"D02\"?", "output": "MATCH (n:Symptom) WHERE n.identifier STARTS WITH \"D02\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways have an identifier starting with \"PC7\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC7\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all symptoms with identifiers that commence with \"D01\".", "output": "MATCH (n:Symptom) WHERE n.identifier STARTS WITH \"D01\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the anatomy entities whose identifiers start with \"UBE\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier STARTS WITH \"UBE\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the pharmacologic classes where the identifier begins with \"N00\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier STARTS WITH \"N00\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List any symptoms whose identifier starts with \"D00\"?", "output": "MATCH (n:Symptom) WHERE n.identifier STARTS WITH \"D00\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find MolecularFunction entries whose identifiers start with \"GO:\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What CellularComponent entries exist whose identifier values begin with the string \"GO:\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find biological processes whose identifiers commence with \"GO:\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the pathways whose identifiers begin with \"WP1\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"WP1\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways have identifiers that start with the string \"WP2\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"WP2\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find compound entries with identifiers that initiate with \"DB0\"?", "output": "MATCH (n:Compound) WHERE n.identifier STARTS WITH \"DB0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all symptoms whose identifiers begin with \"D05\".", "output": "MATCH (n:Symptom) WHERE n.identifier STARTS WITH \"D05\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the cellular components that possess an identifier beginning with 'GO:'?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the pharmacologic classes whose identifier strings commence with \"N00\". What do these classes represent?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier STARTS WITH \"N00\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find biological process entities where their identifiers begin with 'GO:'?", "output": "MATCH (n:BiologicalProcess) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the SideEffect nodes for which the identifier field starts with \"C01\".", "output": "MATCH (n:SideEffect) WHERE n.identifier STARTS WITH \"C01\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological processes have identifiers starting with the prefix \"GO:\" and how can I list them?", "output": "MATCH (n:BiologicalProcess) WHERE n.identifier STARTS WITH \"GO:\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all instances of BiologicalProcess where the license property ends in \"4.0\".", "output": "MATCH (n:BiologicalProcess) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all pharmacologic classes that have licenses ending in \"4.0\".", "output": "MATCH (n:PharmacologicClass) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all cellular components that possess a license string finishing with '4.0'.", "output": "MATCH (n:CellularComponent) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all MolecularFunction entities with a license suffix of \"4.0\".", "output": "MATCH (n:MolecularFunction) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all pathways with licenses that have the suffix \"4.0\".", "output": "MATCH (n:Pathway) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve every SideEffect node where the license field concludes with the characters \"4.0\".", "output": "MATCH (n:SideEffect) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all symptom entries with license numbers that finish with \"1.0\".", "output": "MATCH (n:Symptom) WHERE n.license ENDS WITH \"1.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find genes where the license field terminates with \"1.0\"?", "output": "MATCH (n:Gene) WHERE n.license ENDS WITH \"1.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve biological processes whose license strings finish with '4.0'?", "output": "MATCH (n:BiologicalProcess) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find diseases that possess a license number ending in \"3.0\"?", "output": "MATCH (n:Disease) WHERE n.license ENDS WITH \"3.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all compounds with licenses that end in '4.0'?", "output": "MATCH (n:Compound) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the pathway nodes where the license attribute concludes with '4.0'?", "output": "MATCH (n:Pathway) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all anatomy entities where the license concludes with \"3.0\"?", "output": "MATCH (n:Anatomy) WHERE n.license ENDS WITH \"3.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you fetch all the pathways whose license field concludes with the version \"1.0\"?", "output": "MATCH (n:Pathway) WHERE n.license ENDS WITH \"1.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve all Compound entities where the license string is suffixed by '4.0'?", "output": "MATCH (n:Compound) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all pathways whose license strings finish with \"3.0\".", "output": "MATCH (n:Pathway) WHERE n.license ENDS WITH \"3.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I want to find molecular functions whose license terms end in '4.0'; can you help?", "output": "MATCH (n:MolecularFunction) WHERE n.license ENDS WITH \"4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease entries have a \"3.0\"-ending in their license information?", "output": "MATCH (n:Disease) WHERE n.license ENDS WITH \"3.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all gene entities whose license numbers start with \"CC\" and end in \"1.0\".", "output": "MATCH (n:Gene) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"1.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of molecular functions with licenses that start with \"CC\" and end with \"4.0.\"", "output": "MATCH (n:MolecularFunction) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the query to retrieve names of anatomy objects whose license starts with \"CC\" and ends with \"3.0\"?", "output": "MATCH (n:Anatomy) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"3.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the names of pharmacologic classes where the license starts with \"CC\" and ends with \"4.0\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all symptoms that possess licenses starting with \"CC\" and ending with \"1.0\".", "output": "MATCH (n:Symptom) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"1.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of compounds that possess licenses beginning with \"CC\" and terminating with \"4.0\"?", "output": "MATCH (n:Compound) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the names of pathways whose licenses both start with \"CC\" and end with \"3.0\"?", "output": "MATCH (n:Pathway) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"3.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I list the names of pathways whose identifiers begin with \"PC\" and end with \"81\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"81\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of cellular components whose license codes begin with \"CC\" and end in \"4.0\"?", "output": "MATCH (n:CellularComponent) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathway names are returned when searching for identifiers that have \"WP\" at the beginning and \"31\" at the end?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"WP\" AND n.identifier ENDS WITH \"31\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pharmacologic class names where the identifier starts with \"N0\" and finishes with \"23\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier STARTS WITH \"N0\" AND n.identifier ENDS WITH \"23\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of pathways with identifiers that begin with \"PC\" and end with the digits \"40\".", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"40\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic class entities where their identifiers start with \"N0\" and end in \"34\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier STARTS WITH \"N0\" AND n.identifier ENDS WITH \"34\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of cellular components with identifiers starting with \"GO\" and ending with \"34\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"34\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all symptoms where the identifier begins with \"D0\" and concludes with \"69.\"", "output": "MATCH (n:Symptom) WHERE n.identifier STARTS WITH \"D0\" AND n.identifier ENDS WITH \"69\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the pathway names that hold licenses beginning with \"CC\" and finishing with \"4.0\"?", "output": "MATCH (n:Pathway) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names can be found where their identifier strings start with \"UB\" and end with \"86\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier STARTS WITH \"UB\" AND n.identifier ENDS WITH \"86\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of biological processes licensed with codes starting with \"CC\" and ending in \"4.0\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pathway names where the identifier starts with \"PC\" and finishes with \"74\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"74\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of anatomical structures whose identifiers both start with \"UB\" and end with \"05\".", "output": "MATCH (n:Anatomy) WHERE n.identifier STARTS WITH \"UB\" AND n.identifier ENDS WITH \"05\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway names have identifiers that start with \"PC\" and end with \"32\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"32\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the cellular components that have licenses beginning with \"CC\" and terminating with \"4.0\"? What are their names?", "output": "MATCH (n:CellularComponent) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the anatomy items whose licenses start with 'CC' and end with '3.0'?", "output": "MATCH (n:Anatomy) WHERE n.license STARTS WITH \"CC\" AND n.license ENDS WITH \"3.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the molecular function names where the identifier begins with \"GO\" and concludes with \"31\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"31\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular component names correspond to identifiers prefixed with \"GO\" and suffixed with \"98\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"98\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names correspond to identifiers that start with \"DO\" and end with \"21\"?", "output": "MATCH (n:Disease) WHERE n.identifier STARTS WITH \"DO\" AND n.identifier ENDS WITH \"21\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I need the names of cellular component entities that have identifiers commencing with \"GO\" and concluding with \"86\".", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"86\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names correspond to identifiers that begin with \"GO\" and end with \"42\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"42\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pathway names where the identifier starts with \"PC\" and concludes with \"11\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"11\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function names correspond to identifiers that start with \"GO\" and conclude with \"27\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"27\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the cellular component names that have an identifier starting with \"GO\" and ending with \"27\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"27\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names correspond to identifiers that begin with \"GO\" and finish with \"84\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"84\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway names correspond to identifiers that both begin with \"PC\" and finish with \"75\"?", "output": "MATCH (n:Pathway) WHERE n.identifier STARTS WITH \"PC\" AND n.identifier ENDS WITH \"75\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names correspond to identifiers that commence with \"GO\" and close with \"85\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier STARTS WITH \"GO\" AND n.identifier ENDS WITH \"85\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the names of anatomy nodes with identifiers that start with \"UB\" and end in \"44\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier STARTS WITH \"UB\" AND n.identifier ENDS WITH \"44\" RETURN n.name"}]