[{"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique disease URLs linked to any symptoms through the \"PRESENTS_DpS\" relationship?", "output": "MATCH (g:Disease)-[r:PRESENTS_DpS]->(m:Symptom) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct URLs for genes that regulate other genes through the REGULATES_GrG relationship?", "output": "MATCH (g:Gene)-[r:REGULATES_GrG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct licenses associated with compound pairs connected by the RESEMBLES_CrC relationship?", "output": "MATCH (g:Compound)-[r:RESEMBLES_CrC]->(m:Compound) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene licenses exist within the set of genes participating in 'COVARIES_GcG' relationships?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique gene descriptions found among genes associated with a COVARIES_GcG relationship to another gene?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.description)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct diseases that have a 'RESEMBLES_DrD' association with another disease?", "output": "MATCH (g:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique gene names that are connected to biological processes using the PARTICIPATES_GpBP relationship?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct URLs for Gene nodes that are involved in a COVARIES_GcG relationship with another Gene node?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique associations exist between diseases and genes through the \"ASSOCIATES_DaG\" relationship when considering only distinct disease names?", "output": "MATCH (g:Disease)-[r:ASSOCIATES_DaG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene names can be identified as participating in molecular functions through the PARTICIPATES_GpMF relationship?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distinct count of URLs for compounds that have a 'BINDS_CbG' relationship with genes?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct sources for compounds associated with genes through the BINDS_CbG relationship?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the unique anatomy nodes, identified by `bto_id`, that have an UPREGULATES_AuG relationship with any gene?", "output": "MATCH (g:Anatomy)-[r:UPREGULATES_AuG]->(m:Gene) RETURN COUNT(DISTINCT g.bto_id)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct Anatomy node identifiers that are linked by the 'EXPRESSES_AeG' relationship to any Gene node?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique gene identifiers that are involved in 'COVARIES_GcG' relationships?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique disease entries, identified by their URLs, are associated with anatomical structures through the \"LOCALIZES_DlA\" relationship?", "output": "MATCH (g:Disease)-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene descriptions are associated with any biological process through the PARTICIPATES_GpBP relationship in the database?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN COUNT(DISTINCT g.description)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct genes that are associated with any molecular function through the PARTICIPATES_GpMF relationship?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct names of compounds that have a 'RESEMBLES_CrC' type of relationship with another compound?", "output": "MATCH (g:Compound)-[r:RESEMBLES_CrC]->(m:Compound) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene sources have genes that are connected by a 'COVARIES_GcG' relationship to another gene?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene names are involved in cellular components according to the PARTICIPATES_GpCC relationship?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you determine the number of unique compound URLs that have connections labeled as DOWNREGULATES_CdG to genes?", "output": "MATCH (g:Compound)-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many different licenses are there for genes that are connected through a 'REGULATES_GrG' relationship to other genes?", "output": "MATCH (g:Gene)-[r:REGULATES_GrG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene descriptions are involved in 'REGULATES_GrG' relationships with other genes?", "output": "MATCH (g:Gene)-[r:REGULATES_GrG]->(m:Gene) RETURN COUNT(DISTINCT g.description)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique compounds are there that have a relationship labeled 'DOWNREGULATES_CdG' to any gene?", "output": "MATCH (g:Compound)-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of unique disease sources that have connections marked as downregulating with genes?", "output": "MATCH (g:Disease)-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the number of unique genes that participate in interactions with other genes via the INTERACTS_GiG connection?", "output": "MATCH (g:Gene)-[r:INTERACTS_GiG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct sources linked to Anatomy nodes that are involved in the UPREGULATES_AuG relationship with Gene nodes?", "output": "MATCH (g:Anatomy)-[r:UPREGULATES_AuG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique anatomical structures, each identified by a distinct mesh_id, express any gene via the EXPRESSES_AeG relationship?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.mesh_id)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique URLs for diseases that play a role in upregulating genes?", "output": "MATCH (g:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct URLs exist for diseases that have a \"resembles\" relationship with other diseases in the database?", "output": "MATCH (g:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique disease URLs linked to the downregulation of genes?", "output": "MATCH (g:Disease)-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the different diseases that upregulate any gene using the UPREGULATES_DuG relationship?", "output": "MATCH (g:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct source attributes for compounds linked by the RESEMBLES_CrC relationship?", "output": "MATCH (g:Compound)-[r:RESEMBLES_CrC]->(m:Compound) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct licenses held by diseases that have a relationship with gene downregulation?", "output": "MATCH (g:Disease)-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct sources for compounds linked to the palliation of diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct compounds with associated URLs are recorded as palliating diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene names that appear as the source in 'INTERACTS_GiG' relationships?", "output": "MATCH (g:Gene)-[r:INTERACTS_GiG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many different compounds, identified by unique InChI codes, are connected to genes through the BINDS_CbG relationship?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.inchi)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct identifiers for anatomy entities that are involved in downregulating any gene?", "output": "MATCH (g:Anatomy)-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique licenses from diseases involved in the upregulation of genes?", "output": "MATCH (g:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compound identifiers that are linked with palliating diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct licenses associated with diseases that have a similarity relationship with other diseases?", "output": "MATCH (g:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct disease identifiers that are associated with downregulating genes?", "output": "MATCH (g:Disease)-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compounds that are known to palliate diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct disease names that play a role in upregulating at least one gene?", "output": "MATCH (g:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct licenses from anatomy nodes that are involved in the upregulation of genes?", "output": "MATCH (g:Anatomy)-[r:UPREGULATES_AuG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct anatomy nodes, identified by mesh_id, that have a downregulation relationship with genes?", "output": "MATCH (g:Anatomy)-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN COUNT(DISTINCT g.mesh_id)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the number of different disease licenses linked with their localizations to anatomy nodes?  ", "output": "MATCH (g:Disease)-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique anatomy licenses are associated with anatomy entities that downregulate genes?", "output": "MATCH (g:Anatomy)-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct licenses found for compounds that help in palliating diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique Anatomy nodes, identified by BTO IDs, are there that have an \"EXPRESSES_AeG\" relationship with any Gene node?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.bto_id)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compound URLs found in the database that indicate a treatment for diseases?", "output": "MATCH (g:Compound)-[r:TREATS_CtD]->(m:Disease) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of unique licenses for anatomy instances that have an expression relationship with genes?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct URLs belonging to genes that exhibit interactions with other genes via Gene Interaction links?", "output": "MATCH (g:Gene)-[r:INTERACTS_GiG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique disease sources involved in upregulating genes?", "output": "MATCH (g:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct anatomy entities can be found that have a 'DOWNREGULATES_AdG' relationship with any gene?", "output": "MATCH (g:Anatomy)-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find out the number of distinct `inchikeys` for `Compounds` that participate in the `UPREGULATES_CuG` relationship type with `Gene` nodes?", "output": "MATCH (g:Compound)-[r:UPREGULATES_CuG]->(m:Gene) RETURN COUNT(DISTINCT g.inchikey)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compound InChIKeys that have a binding relationship with a gene?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.inchikey)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene licenses are counted that are associated with participation in a pathway?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct licenses from diseases that have associations with genes?", "output": "MATCH (g:Disease)-[r:ASSOCIATES_DaG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique anatomical elements identified by mesh IDs that participate in the upregulation of genes?", "output": "MATCH (g:Anatomy)-[r:UPREGULATES_AuG]->(m:Gene) RETURN COUNT(DISTINCT g.mesh_id)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the number of different sources for diseases that have a resemblance to another disease?", "output": "MATCH (g:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique URLs of anatomy nodes exist that express any gene?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct gene names linked to pathway participation?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct anatomy names involved in expressing genes?", "output": "MATCH (g:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct diseases that are linked to genes through a downregulation relationship?", "output": "MATCH (g:Disease)-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique compound entities exist that have a BINDS_CbG relationship with genes within the database?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique gene licenses that are involved with a cellular component activity?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique license identifiers for compounds that downregulate any gene?", "output": "MATCH (g:Compound)-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compound licenses for compounds that interact with genes?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct 'Compound' nodes exist that have a 'TREATS_CtD' relationship with any 'Disease' node?", "output": "MATCH (g:Compound)-[r:TREATS_CtD]->(m:Disease) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct InChIKeys for Compound nodes that resemble other Compound nodes according to the \"RESEMBLES_CrC\" relationship?", "output": "MATCH (g:Compound)-[r:RESEMBLES_CrC]->(m:Compound) RETURN COUNT(DISTINCT g.inchikey)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene descriptions associated with the cellular components they participate in?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN COUNT(DISTINCT g.description)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct compound sources linked to the upregulation of genes?", "output": "MATCH (g:Compound)-[r:UPREGULATES_CuG]->(m:Gene) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct chromosomes represented by genes that covary with other genes?", "output": "MATCH (g:Gene)-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g.chromosome)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct licenses for diseases that present with symptoms?", "output": "MATCH (g:Disease)-[r:PRESENTS_DpS]->(m:Symptom) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct chromosomes among genes that have interactions with other genes?", "output": "MATCH (g:Gene)-[r:INTERACTS_GiG]->(m:Gene) RETURN COUNT(DISTINCT g.chromosome)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of different compound names that bind to any gene?", "output": "MATCH (g:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you tell me how many different diseases are linked to genes through the 'ASSOCIATES_DaG' relationship?", "output": "MATCH (g:Disease)-[r:ASSOCIATES_DaG]->(m:Gene) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique chromosomes associated with genes that take part in pathways?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN COUNT(DISTINCT g.chromosome)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct InChI identifiers for compounds that have a palliative effect on diseases?", "output": "MATCH (g:Compound)-[r:PALLIATES_CpD]->(m:Disease) RETURN COUNT(DISTINCT g.inchi)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene chromosomes that have participation in cellular components?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN COUNT(DISTINCT g.chromosome)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique licenses for compounds that upregulate any gene?", "output": "MATCH (g:Compound)-[r:UPREGULATES_CuG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of unique anatomy entities that have a downregulation effect on genes?", "output": "MATCH (g:Anatomy)-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct sources for diseases that have anatomical localization according to the given data?", "output": "MATCH (g:Disease)-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g.source)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of different gene descriptions associated with genes that participate in pathways?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN COUNT(DISTINCT g.description)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct genes that participate in pathways, according to their URLs?", "output": "MATCH (g:Gene)-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN COUNT(DISTINCT g.url)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the count of distinct licenses linked to genes connected through interactions?", "output": "MATCH (g:Gene)-[r:INTERACTS_GiG]->(m:Gene) RETURN COUNT(DISTINCT g.license)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct disease identifiers that have been found in specific anatomical structures?", "output": "MATCH (g:Disease)-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g.identifier)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique disease names are associated with any symptoms in the database?", "output": "MATCH (g:Disease)-[r:PRESENTS_DpS]->(m:Symptom) RETURN COUNT(DISTINCT g.name)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many pharmacologic classes, cited from DrugCentral, have an associated compound via the INCLUDES_PCiC relationship?", "output": "MATCH (g:PharmacologicClass { source: \"DrugCentral\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct \"measured\" genes that have a regulatory linkage with other genes labeled via the \"REGULATES_GrG\" relationship?", "output": "MATCH (g:Gene { method: \"measured\" })-[r:REGULATES_GrG]->(m:Gene) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the number of different diseases identified in the \"MEDLINE cooccurrence\" source that localize to any anatomy through a \"LOCALIZES_DlA\" connection?", "output": "MATCH (g:Disease { source: \"MEDLINE cooccurrence\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique diseases that are linked to other diseases through a \"RESEMBLES_DrD\" relationship, originating from the \"MEDLINE cooccurrence\" source?", "output": "MATCH (g:Disease { source: \"MEDLINE cooccurrence\" })-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct compounds from PharmacotherapyDB that have a \"TREATS_CtD\" connection to any diseases in the dataset?", "output": "MATCH (g:Compound { source: \"PharmacotherapyDB\" })-[r:TREATS_CtD]->(m:Disease) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique genes that have a connection labeled \"COVARIES_GcG\" originating from genes in the \"ERC\" source?", "output": "MATCH (g:Gene { source: \"ERC\" })-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique disease entries from \"MEDLINE cooccurrence\" that are linked to anatomical structures via the LOCALIZES_DlA relationship?", "output": "MATCH (g:Disease { source: \"MEDLINE cooccurrence\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct compounds with the property 'method' set to \"measured\" that have a relationship marked as DOWNREGULATES_CdG with any gene?", "output": "MATCH (g:Compound { method: \"measured\" })-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct 'measured' gene nodes that have outgoing 'REGULATES_GrG' relationships to other gene nodes?", "output": "MATCH (g:Gene { method: \"measured\" })-[r:REGULATES_GrG]->(m:Gene) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct pharmacologic classes with a \"CC BY 4.0\" license that are associated with any compound via the INCLUDES_PCiC relationship?", "output": "MATCH (g:PharmacologicClass { license: \"CC BY 4.0\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you tell me the number of unique diseases from \"MEDLINE cooccurrence\" that have a 'RESEMBLES_DrD' connection to another disease?", "output": "MATCH (g:Disease { source: \"MEDLINE cooccurrence\" })-[r:RESEMBLES_DrD]->(m:Disease) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique disease entries with a \"CC0 1.0\" license that are localized to anatomy nodes via the LOCALIZES_DlA relationship?", "output": "MATCH (g:Disease { license: \"CC0 1.0\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of unique Disease nodes with a \"MEDLINE cooccurrence\" source that have a \"LOCALIZES_DlA\" relationship with any Anatomy node?", "output": "MATCH (g:Disease { source: \"MEDLINE cooccurrence\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique genes sourced from 'ERC' that have at least one 'COVARIES_GcG' relationship to another gene in the database?", "output": "MATCH (g:Gene { source: \"ERC\" })-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g)"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct genes with a source of \"ERC\" that have a relationship labeled COVARIES_GcG to another gene?", "output": "MATCH (g:Gene { source: \"ERC\" })-[r:COVARIES_GcG]->(m:Gene) RETURN COUNT(DISTINCT g)"}]