[{"instruction": "Convert the following natural language into Cypher query.", "input": "How can we obtain identifiers for a maximum of four symptoms with a \"CC0 1.0\" license?", "output": "MATCH (n:Symptom) WHERE n.license = \"CC0 1.0\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological process identifiers are we retrieving that have a \"CC BY 4.0\" license, limited to four results?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the first two identifiers for the compound with the URL \"http://www.drugbank.ca/drugs/DB00563\" in the database?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00563\" RETURN n.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of symptoms having the identifier URL \"http://identifiers.org/mesh/D001836\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D001836\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which three compounds from DrugBank have their identifiers retrieved in this query?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and return the names of five pathways that have \"Reactome via Pathway Commons\" as their source.", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of molecular functions with the URL \"http://purl.obolibrary.org/obo/GO_0032029\", limiting the results to six.", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032029\" RETURN n.name LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the pharmacologic class associated with the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000187063\"? Please give me up to seven results.", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000187063\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pathway names that hold a \"CC BY 4.0\" license, with a maximum of four results?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function identifiers with a \"CC BY 4.0\" license, listing up to nine of them.", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which two cellular component identifiers are retrieved from nodes with the source 'Gene Ontology'?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the gene names for the node that has the URL \"http://identifiers.org/ncbigene/152518\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/152518\" RETURN n.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is a selection of nine pathway names provided by the source \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound has the name associated with the InChI formula \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\" RETURN n.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the first four cellular components sourced from the Gene Ontology database?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of the first five symptoms labeled as \"Syncope\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Syncope\" RETURN n.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for a biological process node with the specific URL \"http://purl.obolibrary.org/obo/GO_0086065\", limiting the results to three.", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0086065\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways have the identifier \"PC7_2523,\" and what are their names, limited to eight entries?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_2523\" RETURN n.name LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds with the InChIKey \"InChIKey=LZCDAPDGXCYOEH-UHFFFAOYSA-N\" in the database?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=LZCDAPDGXCYOEH-UHFFFAOYSA-N\" RETURN n.name LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifiers of the initial nine DrugBank compounds recorded in the database?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each compound with the \"CC BY-NC 4.0\" license, up to four entries?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN n.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic class names are associated with the identifier \"N0000190482,\" showing at most seven entries?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier = \"N0000190482\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of the first seven pharmacologic classes from the source \"FDA via DrugCentral\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of symptoms that share the identifier \"D020069\", showing only a maximum of ten entries?", "output": "MATCH (n:Symptom) WHERE n.identifier = \"D020069\" RETURN n.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the first seven symptom names where the source is indicated as MeSH in the records.", "output": "MATCH (n:Symptom) WHERE n.source = \"MeSH\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the name of the compound that matches the InChIKey \"UVSMNLNDYGZFPF-UHFFFAOYNA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=UVSMNLNDYGZFPF-UHFFFAOYNA-N\" RETURN n.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and display the identifiers of three cellular components that use the \"CC BY 4.0\" license?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers for the first nine symptoms labeled as \"Chronic Pain\" in the database?", "output": "MATCH (n:Symptom) WHERE n.name = \"Chronic Pain\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of up to three pathways sourced from \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n.name LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of ten pharmacologic classes that hold the \"CC BY 4.0\" license.", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN n.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers correspond to the symptom named \"Psychomotor Agitation\", with a maximum of four results?", "output": "MATCH (n:Symptom) WHERE n.name = \"Psychomotor Agitation\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list up to nine names of anatomy entities that have the identifier \"UBERON:0003129\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier = \"UBERON:0003129\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifiers are returned for compounds when their InChIKey is \"InChIKey=HNDVDQJCIGZPNO-YFKPBYRVSA-N\", limiting the results to three?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=HNDVDQJCIGZPNO-YFKPBYRVSA-N\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list up to two identifiers of compounds that match the InChI representation \"InChI=1S/C16H14O3/c1-11(16(18)19)13-8-5-9-14(10-13)15(17)12-6-3-2-4-7-12/h2-11H,1H3,(H,18,19)\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C16H14O3/c1-11(16(18)19)13-8-5-9-14(10-13)15(17)12-6-3-2-4-7-12/h2-11H,1H3,(H,18,19)\" RETURN n.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic classes, specifically those with a class type of \"Mechanism of Action,\" have their first three identifiers returned?", "output": "MATCH (n:PharmacologicClass) WHERE n.class_type = \"Mechanism of Action\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases correspond to the identifier \"DOID:175\" in the database?", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:175\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifiers of the first seven pathway nodes that are licensed with \"CC BY 4.0\"?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the first two identifiers of cellular components with a \"CC BY 4.0\" license?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are some gene names that have the source specified as \"Entrez Gene,\" and show up to four of them?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" RETURN n.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How does the query extract and display nine anatomical names linked to Uberon from the dataset?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list up to six identifiers for biological processes where the license is \"CC BY 4.0\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list two pathways whose license is \"CC BY 4.0\" by their names?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.name LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are associated with chromosome 3, limited to three results?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"3\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list up to nine pharmacologic class names sourced from the FDA via DrugCentral?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names can be found on chromosome 5, limited to the first five results?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"5\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifier can be returned for an anatomy node with the \"Uberon\" source?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the names of three symptoms that originate from the MeSH source?", "output": "MATCH (n:Symptom) WHERE n.source = \"MeSH\" RETURN n.name LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of genes, with a maximum of ten, whose license type is \"CC0 1.0\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of symptoms does the query retrieve with the URL \"http://identifiers.org/mesh/D019080\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D019080\" RETURN n.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names are returned from anatomy nodes with a license type of \"CC BY 3.0\", limiting the output to six results?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN n.name LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each pathway with a \"CC BY 3.0\" license, with a maximum of five names being returned?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 3.0\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the Gene Ontology source, what is a molecular function name that can be retrieved?", "output": "MATCH (n:MolecularFunction) WHERE n.source = \"Gene Ontology\" RETURN n.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve up to four identifiers of anatomical nodes associated with the MeSH ID \"D017536\"?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D017536\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers does the query retrieve for MolecularFunction nodes that have a \"CC BY 4.0\" license, with a cap of eight entries?", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we obtain the distinct InChIKey for a compound whose InChI is given as \"InChI=1S/C16H38N2/c1-17(2,3)15-13-11-9-7-8-10-12-14-16-18(4,5)6/h7-16H2,1-6H3/q+2\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C16H38N2/c1-17(2,3)15-13-11-9-7-8-10-12-14-16-18(4,5)6/h7-16H2,1-6H3/q+2\" RETURN DISTINCT n.inchikey"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the molecular function that has the name \"peptide-methionine (R)-S-oxide reductase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"peptide-methionine (R)-S-oxide reductase activity\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct identifier for the gene that has the description \"1-acylglycerol-3-phosphate O-acyltransferase 2\".", "output": "MATCH (n:Gene) WHERE n.description = \"1-acylglycerol-3-phosphate O-acyltransferase 2\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the distinct URL for the compound identified by \"DB04890\"?", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB04890\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of genes that have the description \"sodium channel, voltage gated, type X alpha subunit\"?", "output": "MATCH (n:Gene) WHERE n.description = \"sodium channel, voltage gated, type X alpha subunit\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the collection of licenses for the \"Dihydrofolate Reductase Inhibitors\" pharmacologic class?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Dihydrofolate Reductase Inhibitors\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct sources associated with the molecular function named \"fatty-acyl-CoA synthase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"fatty-acyl-CoA synthase activity\" RETURN DISTINCT n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct identifier for the \"Hypoxia-mediated EMT and Stemness\" pathway node.", "output": "MATCH (n:Pathway) WHERE n.name = \"Hypoxia-mediated EMT and Stemness\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique licenses correspond to the compound with the name \"Carbinoxamine\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Carbinoxamine\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the unique identifier for the Pathway named \"Signaling by FGFR in disease\"?", "output": "MATCH (n:Pathway) WHERE n.name = \"Signaling by FGFR in disease\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct URLs for all compounds where the license is \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct URL associated with the compound \"Estradiol valerate/Dienogest\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Estradiol valerate/Dienogest\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the specific identifier for the pathway that has the name \"Signaling by Activin.\"", "output": "MATCH (n:Pathway) WHERE n.name = \"Signaling by Activin\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct URL of the Pathway node that has \"PC7_7767\" as its identifier.", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_7767\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique gene identifiers correspond to the description \"outer dense fiber of sperm tails 4\"?", "output": "MATCH (n:Gene) WHERE n.description = \"outer dense fiber of sperm tails 4\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct licenses can be found for pathways originating from the source \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique licenses of the gene described as \"interphotoreceptor matrix proteoglycan 1\"?", "output": "MATCH (n:Gene) WHERE n.description = \"interphotoreceptor matrix proteoglycan 1\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve a list of unique identifiers for pathways with the source specified as \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique chromosome is associated with the gene described as \"oviductal glycoprotein 1, 120kDa\"?", "output": "MATCH (n:Gene) WHERE n.description = \"oviductal glycoprotein 1, 120kDa\" RETURN DISTINCT n.chromosome"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the unique ID of the gene that is labeled as \"OAF\"?", "output": "MATCH (n:Gene) WHERE n.name = \"OAF\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the license details of the compound whose URL is \"http://www.drugbank.ca/drugs/DB08820\".", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB08820\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you return the distinct license of the gene with a URL specified as \"http://identifiers.org/ncbigene/26301\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/26301\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distinct identifier associated with the molecular function called \"transcription factor activity, RNA polymerase II basal transcription factor binding\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"transcription factor activity, RNA polymerase II basal transcription factor binding\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique URLs of cellular components sourced from the Gene Ontology database?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the InChIKey \"InChIKey=AIXAANGOTKPUOY-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=AIXAANGOTKPUOY-UHFFFAOYSA-N\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct ID of the gene with the name \"SDC4\"?", "output": "MATCH (n:Gene) WHERE n.name = \"SDC4\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the different URLs associated with pathways possessing a \"CC BY 4.0\" license.", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the unique name of the pharmacologic class associated with the identifier \"N0000175982\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier = \"N0000175982\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distinct name of the compound with the specified InChI string \"InChI=1S/C20H23NO4/c22-13-4-3-12-9-15-20(24)6-5-14(23)18-19(20,16(12)17(13)25-18)7-8-21(15)10-11-1-2-11/h3-4,11,15,18,22,24H,1-2,5-10H2/t15-,18+,19+,20-/m1/s1\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C20H23NO4/c22-13-4-3-12-9-15-20(24)6-5-14(23)18-19(20,16(12)17(13)25-18)7-8-21(15)10-11-1-2-11/h3-4,11,15,18,22,24H,1-2,5-10H2/t15-,18+,19+,20-/m1/s1\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify pharmacologic class names with the \"CC BY 4.0\" license without repeating any names.", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct name of the molecular function that has the identifier \"GO:0008374\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0008374\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the unique license associated with the pathway that has the identifier \"PC7_3326\"?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_3326\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct URL connected to the identifier \"GO:0070061\" within the `MolecularFunction` nodes.", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0070061\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique licenses are returned for genes with a description of \"UBA domain containing 1\"?", "output": "MATCH (n:Gene) WHERE n.description = \"UBA domain containing 1\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the unique identifier for a cellular component linked to the URL \"http://purl.obolibrary.org/obo/GO_0032045\"?", "output": "MATCH (n:CellularComponent) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032045\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct URLs can be retrieved for biological processes whose source is specified as \"Gene Ontology\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distinct license associated with the pharmacologic class named \"Ketolides\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Ketolides\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the different licenses that apply to the disease entity with the name \"azoospermia\"?", "output": "MATCH (n:Disease) WHERE n.name = \"azoospermia\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct cellular component names, as identified by the Gene Ontology, can be retrieved?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct licenses associated with the molecular function that has the identifier \"GO:0015277\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0015277\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique licenses associated with the symptom named \"Tremor\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Tremor\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct InChI value for the compound with the name \"Propylthiouracil\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Propylthiouracil\" RETURN DISTINCT n.inchi"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the exclusive list of compound names associated with the \"CC BY-NC 4.0\" license.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the exclusive identifier for the symptom \"Infantile Apparent Life-Threatening Event\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Infantile Apparent Life-Threatening Event\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct source entries related to the pharmacologic class whose URL is \"http://purl.bioontology.org/ontology/NDFRT/N0000009916\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000009916\" RETURN DISTINCT n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can one find the unique license of a symptom node given its URL \"http://identifiers.org/mesh/D054058\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D054058\" RETURN DISTINCT n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the distinct URL associated with the compound labeled with identifier \"DB01013\"?", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB01013\" RETURN DISTINCT n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the unique identifier associated with the \"CBM complex\" cellular component?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"CBM complex\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique anatomy names exist that are shared with a CC BY 3.0 license?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN DISTINCT n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the list of distinct identifiers for pharmacologic classes that are shared under the \"CC BY 4.0\" license.", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN DISTINCT n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the corresponding InChIKey for a compound whose InChI is \"InChI=1S/C31H36N2O11/c1-14(2)7-8-16-13-17(9-11-19(16)34)27(37)33-21-22(35)18-10-12-20(15(3)24(18)42-28(21)38)41-29-23(36)25(43-30(32)39)26(40-6)31(4,5)44-29/h7,9-13,23,25-26,29,34-36H,8H2,1-6H3,(H2,32,39)(H,33,37)/t23-,25+,26-,29-/m1/s1\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C31H36N2O11/c1-14(2)7-8-16-13-17(9-11-19(16)34)27(37)33-21-22(35)18-10-12-20(15(3)24(18)42-28(21)38)41-29-23(36)25(43-30(32)39)26(40-6)31(4,5)44-29/h7,9-13,23,25-26,29,34-36H,8H2,1-6H3,(H2,32,39)(H,33,37)/t23-,25+,26-,29-/m1/s1\" RETURN DISTINCT n.inchikey"}]