[{"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of pharmacologic classes, alongside the count of compounds they contain, sorted starting with the class that includes the most compounds?", "output": "MATCH (d:PharmacologicClass)-[r:INCLUDES_PCiC]->(s:Compound) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of genes downregulated by different anatomical parts, sorted by the count in descending order?", "output": "MATCH (d:Anatomy)-[r:DOWNREGULATES_AdG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs of anatomical parts that downregulate the largest number of genes?", "output": "MATCH (d:Anatomy)-[r:DOWNREGULATES_AdG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the licenses for anatomy entities along with the count of genes they express, with the results ordered by the highest expression count?", "output": "MATCH (d:Anatomy)-[r:EXPRESSES_AeG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of disease sources with the count of genes they upregulate, ordered from the most to the least number of upregulated genes?", "output": "MATCH (d:Disease)-[r:UPREGULATES_DuG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we rank compounds by their license according to the number of genes they upregulate, showing the highest counts first?", "output": "MATCH (d:Compound)-[r:UPREGULATES_CuG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound licenses with the corresponding count of diseases palliated by them, arranged from the highest to the lowest count?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of symptoms associated with each disease license, and how are these diseases ordered by the number of symptoms present in descending order?", "output": "MATCH (d:Disease)-[r:PRESENTS_DpS]->(s:Symptom) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the InChI identifiers of compounds and count the number of diseases each compound is known to palliate, sorted from most to least diseases?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.inchi, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of interacting genes for each gene source, sorted by the highest number of interactions?", "output": "MATCH (d:Gene)-[r:INTERACTS_GiG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of genes downregulated by diseases, grouped by their source, and which diseases have the highest counts?", "output": "MATCH (d:Disease)-[r:DOWNREGULATES_DdG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene URL, how many associated molecular functions can be identified, and how are these counts ranked from largest to smallest?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpMF]->(s:MolecularFunction) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes and the count of cellular components they are associated with, sorted by the number of associations in descending order?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many genes are downregulated by each anatomical element, and what is the license type of these elements, when sorted in descending order by gene count?", "output": "MATCH (d:Anatomy)-[r:DOWNREGULATES_AdG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the license of each source gene and determine how many target genes are linked to it through the 'COVARIES_GcG' relationship, displaying the results from the most to the least linked?", "output": "MATCH (d:Gene)-[r:COVARIES_GcG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease licenses are linked to the most genes through upregulation in descending order?", "output": "MATCH (d:Disease)-[r:UPREGULATES_DuG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of cellular components associated with genes from each chromosome, ordered by the number of components a chromosome's genes are involved in?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have associated URLs, and how many diseases does each of these compounds help to palliate, ordered by the number of diseases from highest to lowest?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of diseases sorted by how many symptoms they present, along with each disease's unique identifier?", "output": "MATCH (d:Disease)-[r:PRESENTS_DpS]->(s:Symptom) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the sources of compounds that pally with diseases and count the diseases for each source, displaying them in order from the highest to lowest count.", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of chromosomes and show how many genes they interact with, sorted by interaction count from highest to lowest?", "output": "MATCH (d:Gene)-[r:INTERACTS_GiG]->(s:Gene) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide a ranking of disease names based on how many times they are resembled by other diseases?", "output": "MATCH (d:Disease)-[r:RESEMBLES_DrD]->(s:Disease) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many diseases can each compound treat according to the record, ordered by the number of diseases they treat in descending order?", "output": "MATCH (d:Compound)-[r:TREATS_CtD]->(s:Disease) RETURN d.inchikey, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many genes does each regulating gene control, and can I have a list of these regulating genes' URLs sorted by their regulatory influence?", "output": "MATCH (d:Gene)-[r:REGULATES_GrG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many genes are associated with each disease license, and in what order do they appear from the highest gene count to the lowest?", "output": "MATCH (d:Disease)-[r:ASSOCIATES_DaG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the ranking of compound URLs by how many compounds each resembles, starting from the highest count?", "output": "MATCH (d:Compound)-[r:RESEMBLES_CrC]->(s:Compound) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the descriptions of genes along with the count of other genes they regulate, sorted by the count in decreasing order?", "output": "MATCH (d:Gene)-[r:REGULATES_GrG]->(s:Gene) RETURN d.description, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene identified by its source, how many biological processes does it participate in, and can you provide this list sorted by the highest to lowest count?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpBP]->(s:BiologicalProcess) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distribution of genes across chromosomes in terms of their involvement in molecular functions, sorted by the highest number of functions participated in for each chromosome?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpMF]->(s:MolecularFunction) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list each compound along with how many genes it upregulates, sorted so that the compound upregulating the most genes appears first?", "output": "MATCH (d:Compound)-[r:UPREGULATES_CuG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the licenses of the genes that have regulatory roles over other genes, sorted by how many genes they regulate in descending order?", "output": "MATCH (d:Gene)-[r:REGULATES_GrG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the number of genes that each anatomy acts upon through upregulation and sort the anatomies based on this gene count?", "output": "MATCH (d:Anatomy)-[r:UPREGULATES_AuG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the URLs of compounds and the count of side effects they are linked to, sorted by the highest number of side effects first?", "output": "MATCH (d:Compound)-[r:CAUSES_CcSE]->(s:SideEffect) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of diseases alleviated by each compound, sorted from those with the most palliated diseases to those with the least, based on their InChIKey identifier?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.inchikey, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many diseases resemble each specific disease and what are their identifiers, sorted by the number of resemblances in descending order?", "output": "MATCH (d:Disease)-[r:RESEMBLES_DrD]->(s:Disease) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene license, how many biological processes are they involved in and can you sort these counts from highest to lowest?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpBP]->(s:BiologicalProcess) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases downregulate genes, and how many genes does each one downregulate, sorted by the number of genes from highest to lowest?", "output": "MATCH (d:Disease)-[r:DOWNREGULATES_DdG]->(s:Gene) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds and how many diseases does each compound palliatively treat, sorted by the number of diseases they affect in descending order?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene, how many distinct pathways do they participate in, ordered from the most to the least pathways?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the order of compounds by their license that downregulate genes, sorted by the quantity of affected genes in descending order?", "output": "MATCH (d:Compound)-[r:DOWNREGULATES_CdG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the chromosomes alongside the number of biological processes their genes participate in, sorted in descending order by the number of processes?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpBP]->(s:BiologicalProcess) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct cellular components associated with each gene source, and how are these counts ordered from highest to lowest?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of pharmacologic classes along with the count of compounds they contain, arranged in descending order by this count?", "output": "MATCH (d:PharmacologicClass)-[r:INCLUDES_PCiC]->(s:Compound) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many diseases is each compound, identified by its InChI, linked to as a treatment, and can you sort this information from the highest to the lowest count?", "output": "MATCH (d:Compound)-[r:TREATS_CtD]->(s:Disease) RETURN d.inchi, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entities have BTO IDs, and how many genes does each entity downregulate, in descending order of the gene count?", "output": "MATCH (d:Anatomy)-[r:DOWNREGULATES_AdG]->(s:Gene) RETURN d.bto_id, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a ranking of source Compounds based on the number of Compounds they resemble with a Resembles_CrC relationship?", "output": "MATCH (d:Compound)-[r:RESEMBLES_CrC]->(s:Compound) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy entities along with the number of genes they express, sorted by the number of expressed genes in descending order?", "output": "MATCH (d:Anatomy)-[r:EXPRESSES_AeG]->(s:Gene) RETURN d.bto_id, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide a ranking of genes based on how many other genes they interact with, using the 'INTERACTS_GiG' relationship?", "output": "MATCH (d:Gene)-[r:INTERACTS_GiG]->(s:Gene) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the gene descriptions and count how many times each gene is covaried with other genes, in descending order of these counts?", "output": "MATCH (d:Gene)-[r:COVARIES_GcG]->(s:Gene) RETURN d.description, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list compound identifiers along with the count of side effects they cause, sorted by the highest to lowest count?", "output": "MATCH (d:Compound)-[r:CAUSES_CcSE]->(s:SideEffect) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I list compounds by their unique InChIKeys along with the count of side effects they are associated with, ranked by the number of side effects in descending order?", "output": "MATCH (d:Compound)-[r:CAUSES_CcSE]->(s:SideEffect) RETURN d.inchikey, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of genes linked to each disease identifier, and how do these diseases rank by the number of gene associations they have?", "output": "MATCH (d:Disease)-[r:ASSOCIATES_DaG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique compound URLs are associated with palliating diseases, and how are they sorted if listed from highest to lowest?", "output": "MATCH (c:Compound)-[r:PALLIATES_CpD]->(g:Disease) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find distinct URLs of diseases that have resemblance relationships with other diseases, and ensure these are sorted in reverse alphabetical order?", "output": "MATCH (c:Disease)-[r:RESEMBLES_DrD]->(g:Disease) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct disease identifiers are associated with the RESEMBLES_DrD relationship and how are they sorted in decreasing order?", "output": "MATCH (c:Disease)-[r:RESEMBLES_DrD]->(g:Disease) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve an ordered list of unique anatomy identifiers that are linked to genes through an upregulation relationship, starting with the highest?", "output": "MATCH (c:Anatomy)-[r:UPREGULATES_AuG]->(g:Gene) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which chromosomes are uniquely associated with genes that have a 'COVARIES_GcG' relationship with other genes, with their identifiers ordered in descending order?", "output": "MATCH (c:Gene)-[r:COVARIES_GcG]->(g:Gene) RETURN DISTINCT c.chromosome ORDER BY c.chromosome DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve and order by descending sequence the distinct mesh IDs of anatomy nodes that downregulate genes?", "output": "MATCH (c:Anatomy)-[r:DOWNREGULATES_AdG]->(g:Gene) RETURN DISTINCT c.mesh_id ORDER BY c.mesh_id DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the unique URLs of diseases sorted in descending order that have symptoms indicated by the relationship PRESENTS_DpS.", "output": "MATCH (c:Disease)-[r:PRESENTS_DpS]->(g:Symptom) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct identifier labels for genes at the start of \"COVARIES_GcG\" relationships, sorted in descending order?", "output": "MATCH (c:Gene)-[r:COVARIES_GcG]->(g:Gene) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of distinct compound URLs where each compound downregulates a gene, sorted from highest to lowest?", "output": "MATCH (c:Compound)-[r:DOWNREGULATES_CdG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique URLs of anatomy entities that have an upregulating effect on genes, sorted in descending order?", "output": "MATCH (c:Anatomy)-[r:UPREGULATES_AuG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list the unique identifiers for diseases that have associations with genes, sorted in decreasing order?", "output": "MATCH (c:Disease)-[r:ASSOCIATES_DaG]->(g:Gene) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the unique licenses of diseases, associated with symptoms, sorted in descending order when retrieved?", "output": "MATCH (c:Disease)-[r:PRESENTS_DpS]->(g:Symptom) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the sorted list of unique URLs associated with anatomical structures that express genes, arranged from Z to A?", "output": "MATCH (c:Anatomy)-[r:EXPRESSES_AeG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the unique gene names that are connected to other genes via the 'COVARIES_GcG' relationship, sorted in reverse alphabetical order?", "output": "MATCH (c:Gene)-[r:COVARIES_GcG]->(g:Gene) RETURN DISTINCT c.name ORDER BY c.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique anatomical BTO IDs are returned for anatomical structures expressing genes, with the results sorted by descending order?", "output": "MATCH (c:Anatomy)-[r:EXPRESSES_AeG]->(g:Gene) RETURN DISTINCT c.bto_id ORDER BY c.bto_id DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct disease URLs can be found that correspond to diseases with a downregulating relationship to genes, sorted by URL in descending order?", "output": "MATCH (c:Disease)-[r:DOWNREGULATES_DdG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the different license types for diseases that are connected to other diseases via the \"RESEMBLES_DrD\" relationship, sorted from high to low?", "output": "MATCH (c:Disease)-[r:RESEMBLES_DrD]->(g:Disease) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the ordered list of compound URLs, without duplicates, that are connected to genes through a binding relationship, sorted in decreasing order?", "output": "MATCH (c:Compound)-[r:BINDS_CbG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct URLs of genes that have regulatory effects on other genes, sorted in reverse order.", "output": "MATCH (c:Gene)-[r:REGULATES_GrG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct disease URLs are linked to genes via the \"ASSOCIATES_DaG\" relationship, sorted from Z to A?", "output": "MATCH (c:Disease)-[r:ASSOCIATES_DaG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique licenses pertain to diseases known to upregulate genes, when sorted in decreasing order?", "output": "MATCH (c:Disease)-[r:UPREGULATES_DuG]->(g:Gene) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene URLs participate in cellular components, and how would they be sorted in descending order without duplicates?", "output": "MATCH (c:Gene)-[r:PARTICIPATES_GpCC]->(g:CellularComponent) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers for diseases that are connected to anatomical structures via a 'LOCALIZES_DlA' relationship, ordered from highest to lowest?", "output": "MATCH (c:Disease)-[r:LOCALIZES_DlA]->(g:Anatomy) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide a list of unique disease URLs where the diseases are known to upregulate genes, with the list sorted from highest to lowest URL value?", "output": "MATCH (c:Disease)-[r:UPREGULATES_DuG]->(g:Gene) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique names of genes associated with cellular components are returned when sorted descendingly by name?", "output": "MATCH (c:Gene)-[r:PARTICIPATES_GpCC]->(g:CellularComponent) RETURN DISTINCT c.name ORDER BY c.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique pharmacologic class identifiers associated with compounds can be retrieved and sorted from highest to lowest?", "output": "MATCH (c:PharmacologicClass)-[r:INCLUDES_PCiC]->(g:Compound) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a descending, unique list of disease identifiers linked to symptoms?", "output": "MATCH (c:Disease)-[r:PRESENTS_DpS]->(g:Symptom) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct licenses are held by genes that have a \"REGULATES_GrG\" relationship with other genes, listed in decreasing order?", "output": "MATCH (c:Gene)-[r:REGULATES_GrG]->(g:Gene) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of compounds that have a 'RESEMBLES_CrC' relationship with another compound, sorted in descending order?", "output": "MATCH (c:Compound)-[r:RESEMBLES_CrC]->(g:Compound) RETURN DISTINCT c.name ORDER BY c.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve a list of unique InChI identifiers for compounds that have an upregulatory effect on genes, sorted in reverse order?", "output": "MATCH (c:Compound)-[r:UPREGULATES_CuG]->(g:Gene) RETURN DISTINCT c.inchi ORDER BY c.inchi DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the distinct URLs of genes that participate in pathways, sorted from highest to lowest?", "output": "MATCH (c:Gene)-[r:PARTICIPATES_GpPW]->(g:Pathway) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class licenses are connected to compounds, and how are these licenses sorted in reverse order?", "output": "MATCH (c:PharmacologicClass)-[r:INCLUDES_PCiC]->(g:Compound) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct BTO ID values of anatomy nodes that have relationships indicating they upregulate genes, sorted in decreasing order?", "output": "MATCH (c:Anatomy)-[r:UPREGULATES_AuG]->(g:Gene) RETURN DISTINCT c.bto_id ORDER BY c.bto_id DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique licenses associated with genes that are involved in pathways, sorted in descending order?", "output": "MATCH (c:Gene)-[r:PARTICIPATES_GpPW]->(g:Pathway) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique licenses are assigned to diseases that localize in anatomical structures, sorted in reverse order?", "output": "MATCH (c:Disease)-[r:LOCALIZES_DlA]->(g:Anatomy) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique compound licenses are associated with compounds that have a downregulating effect on genes, sorted in reverse order?", "output": "MATCH (c:Compound)-[r:DOWNREGULATES_CdG]->(g:Gene) RETURN DISTINCT c.license ORDER BY c.license DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all unique disease names linked to the downregulation of genes, and how are these names ordered in the output?", "output": "MATCH (c:Disease)-[r:DOWNREGULATES_DdG]->(g:Gene) RETURN DISTINCT c.name ORDER BY c.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the identifiers for compounds that uniquely bind to genes, and list them starting from the largest identifier?", "output": "MATCH (c:Compound)-[r:BINDS_CbG]->(g:Gene) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of unique gene identifiers involved in pathways, sorted from highest to lowest?", "output": "MATCH (c:Gene)-[r:PARTICIPATES_GpPW]->(g:Pathway) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct URLs correspond to pharmacologic classes containing compounds, and how are they sorted from highest to lowest?", "output": "MATCH (c:PharmacologicClass)-[r:INCLUDES_PCiC]->(g:Compound) RETURN DISTINCT c.url ORDER BY c.url DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique anatomical part identifiers that express genes are included when sorted from highest to lowest?", "output": "MATCH (c:Anatomy)-[r:EXPRESSES_AeG]->(g:Gene) RETURN DISTINCT c.identifier ORDER BY c.identifier DESC"}]