[{"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URLs linked to each disease within the graph?", "output": "MATCH (n:Disease) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve and show me the names of every pharmacologic class.", "output": "MATCH (n:PharmacologicClass) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we obtain the identifiers of all \"BiologicalProcess\" nodes within the dataset?", "output": "MATCH (n:BiologicalProcess) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the 'source' attribute from each 'Pathway' node?", "output": "MATCH (n:Pathway) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the license information for each pathway in the dataset?", "output": "MATCH (n:Pathway) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get the URLs related to all the biological processes?", "output": "MATCH (n:BiologicalProcess) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the method to extract the identifiers of all MolecularFunction nodes from the dataset?", "output": "MATCH (n:MolecularFunction) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the different sources from where the pharmacologic class information is retrieved?", "output": "MATCH (n:PharmacologicClass) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the unique identifiers for each disease node within the dataset.", "output": "MATCH (n:Disease) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs linked to pharmacologic class nodes in this dataset?", "output": "MATCH (n:PharmacologicClass) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the unique identifiers of nodes that belong to the 'Anatomy' category?", "output": "MATCH (n:Anatomy) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which licenses are recorded for molecular function entities?", "output": "MATCH (n:MolecularFunction) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the BTO IDs of all nodes labeled as \"Anatomy\" in the database?", "output": "MATCH (n:Anatomy) RETURN n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What mesh_id values are present for nodes labeled as Anatomy?", "output": "MATCH (n:Anatomy) RETURN n.mesh_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the source attributes of nodes labeled 'Anatomy'?", "output": "MATCH (n:Anatomy) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the description details for every node labeled 'Gene'?", "output": "MATCH (n:Gene) RETURN n.description"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the URL links for all symptoms stored in our system?", "output": "MATCH (n:Symptom) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the web links for every node labeled SideEffect. What are they?", "output": "MATCH (n:SideEffect) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs for all entities labeled \"Anatomy\"?", "output": "MATCH (n:Anatomy) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all diseases recorded in the database?", "output": "MATCH (n:Disease) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the unique identifiers of every compound recorded in the graph?", "output": "MATCH (n:Compound) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From where has the information for each disease been collected?", "output": "MATCH (n:Disease) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the identifier for every node with the label 'Gene'?", "output": "MATCH (n:Gene) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all Pathway nodes in the database?", "output": "MATCH (n:Pathway) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you extract the source attribute for every node labeled 'Compound'?", "output": "MATCH (n:Compound) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list all identifiers found under the SideEffect label?", "output": "MATCH (n:SideEffect) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of all gene entities in the system?", "output": "MATCH (n:Gene) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names have been assigned to each symptom in our database collection?", "output": "MATCH (n:Symptom) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs associated with each Gene node in the database?", "output": "MATCH (n:Gene) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the URLs for each node labeled as \"CellularComponent\"?", "output": "MATCH (n:CellularComponent) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which URLs correspond to the entities categorized under the 'MolecularFunction' label?", "output": "MATCH (n:MolecularFunction) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the values of the 'source' property for all nodes classified as CellularComponent?", "output": "MATCH (n:CellularComponent) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical names are retrieved from the 'Anatomy' nodes in the data?", "output": "MATCH (n:Anatomy) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the originating sources for all symptoms recorded in the database?", "output": "MATCH (n:Symptom) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all cellular components listed in the database?", "output": "MATCH (n:CellularComponent) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the URLs of every compound in the database?", "output": "MATCH (n:Compound) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the InChI codes of every compound stored in the graph?", "output": "MATCH (n:Compound) RETURN n.inchi"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of names returned from nodes under the MolecularFunction label?", "output": "MATCH (n:MolecularFunction) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of all nodes labeled as 'SideEffect'?", "output": "MATCH (n:SideEffect) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of up to seven genes that are linked to compounds with a \"CC BY-NC 4.0\" license through the BINDS_CbG relationship?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.license = \"CC BY-NC 4.0\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and return the identifiers of genes expressed by anatomical structures sourced from Uberon, limiting the output to nine items?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.source = \"Uberon\" RETURN m.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes that have a 'COVARIES_GcG' relationship with the gene having the URL \"http://identifiers.org/ncbigene/84254\", with a maximum of ten results?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/84254\" RETURN m.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of the genes, to a maximum of seven, expressed by the anatomy feature known as \"UBERON:0002367\".", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.identifier = \"UBERON:0002367\" RETURN m.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve up to seven gene identifiers that are influenced by the gene described as \"autophagy related 16-like 1 (S. cerevisiae)\".", "output": "MATCH (n:Gene)-[r1:REGULATES_GrG]->(m:Gene) WHERE n.description = \"autophagy related 16-like 1 (S. cerevisiae)\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify up to six genes associated with interleukin 26 through a COVARIES_GcG relationship and provide their identifiers.", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.description = \"interleukin 26\" RETURN m.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for up to six genes that are associated with anatomical entities whose source is classified as \"Uberon\".", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.source = \"Uberon\" RETURN m.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are expressed in the anatomy node identified by the URL \"http://purl.obolibrary.org/obo/UBERON_0001003\" and are limited to six results?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0001003\" RETURN m.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes, limited to 10, that have a COVARIES_GcG relationship with the gene having the URL \"http://identifiers.org/ncbigene/7746\"?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/7746\" RETURN m.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve one gene identifier that is directly influenced by an anatomy node having the license \"CC BY 3.0\" through downregulation.", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.license = \"CC BY 3.0\" RETURN m.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that share a 'COVARIES_GcG' relationship with any gene whose license is marked as \"CC0 1.0\", with a maximum of nine gene names.", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.license = \"CC0 1.0\" RETURN m.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What single pathway identifier is connected to a gene, given that the gene's license is CC0 1.0, via a PARTICIPATES_GpPW relationship?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.license = \"CC0 1.0\" RETURN m.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene identifiers connected via the COVARIES_GcG relationship to genes that are under an open CC0 1.0 license, restricted to five entries?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.license = \"CC0 1.0\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify up to eight pathway identifiers that are associated with \"HIST1H3B\" via the PARTICIPATES_GpPW relationship.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.name = \"HIST1H3B\" RETURN m.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of up to five genes that have a \"COVARIES_GcG\" relationship with the gene identified by the URL \"http://identifiers.org/ncbigene/6632\"?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/6632\" RETURN m.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the initial ten gene identifiers associated with age-related macular degeneration via the ASSOCIATES_DaG relationship?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) WHERE n.name = \"age related macular degeneration\" RETURN m.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease identifiers are related to \"DOID:5875\" by the \"RESEMBLES_DrD\" relationship, limited to the first three?", "output": "MATCH (n:Disease)-[r1:RESEMBLES_DrD]->(m:Disease) WHERE n.identifier = \"DOID:5875\" RETURN m.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease identifiers are retrieved for treatments involving compounds with a \"CC BY-NC 4.0\" license, limited to three occurrences?", "output": "MATCH (n:Compound)-[r1:TREATS_CtD]->(m:Disease) WHERE n.license = \"CC BY-NC 4.0\" RETURN m.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which three pathway identifiers is the \"CRK\" gene involved with according to the `PARTICIPATES_GpPW` relationship?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.name = \"CRK\" RETURN m.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify six gene names that are linked to the compound having the identifier \"DB00246\" via a BINDS_CbG bond.", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.identifier = \"DB00246\" RETURN m.name LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify two symptoms that are connected through a \"PRESENTS_DpS\" relationship to diseases that specify a \"CC BY 3.0\" license.", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.license = \"CC BY 3.0\" RETURN m.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of diseases that have a palliating relationship with the compound named Acetophenazine, with a maximum of ten entries.", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.name = \"Acetophenazine\" RETURN m.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes expressed in anatomical structures from the \"Uberon\" database, with a limit of seven results?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.source = \"Uberon\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for five compounds included in the pharmacologic class linked with the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000185607\".", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000185607\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the URL \"http://purl.obolibrary.org/obo/DOID_1793\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_1793\" RETURN m.name LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of genes that are linked through a \"COVARIES_GcG\" relationship to genes with the license type \"CC0 1.0\", limiting the results to nine genes?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.license = \"CC0 1.0\" RETURN m.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that have a COVARIES_GcG connection originating from genes on chromosome number 7, limited to ten results?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.chromosome = \"7\" RETURN m.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are upregulated by the anatomy labeled \"UBERON:0002367,\" limited to three results?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.identifier = \"UBERON:0002367\" RETURN m.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease identifiers are associated with treatments by the compound given the URL \"http://www.drugbank.ca/drugs/DB00700\", considering only the first ten matches?", "output": "MATCH (n:Compound)-[r1:TREATS_CtD]->(m:Disease) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00700\" RETURN m.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene's name is returned when a compound with a \"CC BY-NC 4.0\" license is matched in a binding relationship?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.license = \"CC BY-NC 4.0\" RETURN m.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathway identifiers involve the gene with the description \"adenylate cyclase activating polypeptide 1 (pituitary)\" according to this query?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.description = \"adenylate cyclase activating polypeptide 1 (pituitary)\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are associated with being downregulated by the anatomy specified by the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0002367\" RETURN m.name LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene that is upregulated by the compound with the specified DrugBank URL, \"http://www.drugbank.ca/drugs/DB00305\".", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00305\" RETURN m.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of each cellular component associated with the gene \"heat shock 70kDa protein 1-like\" through participation?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.description = \"heat shock 70kDa protein 1-like\" RETURN m.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of up to nine genes that are upregulated by the anatomy entity with the BTO ID \"BTO:0001129\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.bto_id = \"BTO:0001129\" RETURN m.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the first seven gene identifiers that are subject to downregulation by pancreatic cancer according to the database.", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name = \"pancreatic cancer\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are connected to \"golgi brefeldin A resistant guanine nucleotide exchange factor 1\" through an INTERACTS_GiG relationship?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.description = \"golgi brefeldin A resistant guanine nucleotide exchange factor 1\" RETURN m.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the identifiers of genes that the compound with identifier \"DB00432\" downregulates, with a maximum of eight results.", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) WHERE n.identifier = \"DB00432\" RETURN m.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of gene identifiers that have an upregulation relationship with the anatomy item having the BTO ID \"BTO:0001129\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.bto_id = \"BTO:0001129\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifiers of genes that pancreatic cancer causes to be downregulated, limited to ten results?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name = \"pancreatic cancer\" RETURN m.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the database, what is the name of a compound connected by a 'RESEMBLES_CrC' relationship to the compound with the InChIKey \"VRQVVMDWGGWHTJ-CQSZACIVSA-N\"?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.inchikey = \"InChIKey=VRQVVMDWGGWHTJ-CQSZACIVSA-N\" RETURN m.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that the compound with the InChI identifier \"InChI=1S/C15H18N4O5/c1-5-9(16)12(21)8-6(4-24-14(17)22)15(23-2)13-7(18-13)3-19(15)10(8)11(5)20/h6-7,13,18H,3-4,16H2,1-2H3,(H2,17,22)/t6-,7+,13+,15-/m1/s1\" is known to downregulate?", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) WHERE n.inchi = \"InChI=1S/C15H18N4O5/c1-5-9(16)12(21)8-6(4-24-14(17)22)15(23-2)13-7(18-13)3-19(15)10(8)11(5)20/h6-7,13,18H,3-4,16H2,1-2H3,(H2,17,22)/t6-,7+,13+,15-/m1/s1\" RETURN m.name LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of ten compounds that are connected to a DrugBank compound via the RESEMBLES_CrC relationship.", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.source = \"DrugBank\" RETURN m.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which five gene identifiers are regulated by the anatomy node having the BTO ID \"BTO:0001129\" through the relationship type UPREGULATES_AuG?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.bto_id = \"BTO:0001129\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the identifiers of up to two biological processes that the gene \"RIPK3\" is related to through the PARTICIPATES_GpBP relationship.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) WHERE n.name = \"RIPK3\" RETURN m.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names appear in the query result when finding the first two genes upregulated by the compound whose InChIKey is \"GGXKWVWZWMLJEH-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.inchikey = \"InChIKey=GGXKWVWZWMLJEH-UHFFFAOYSA-N\" RETURN m.name LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which four gene identifiers are returned that are influenced by anatomy nodes from the Uberon source through upregulation?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.source = \"Uberon\" RETURN m.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify up to four gene names that are affected by diseases through downregulation relationships, with the data source being Disease Ontology?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.source = \"Disease Ontology\" RETURN m.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list up to six identifiers for anatomy nodes connected to Disease Ontology diseases through localization relationships?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.source = \"Disease Ontology\" RETURN m.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of two genes that are downregulated by the anatomy entity with BTO ID \"BTO:0001129\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.bto_id = \"BTO:0001129\" RETURN m.name LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are upregulated by DrugBank-sourced compounds, and return their identifiers with a limit of two?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.source = \"DrugBank\" RETURN m.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the gene identifiers that are enhanced by the prostate gland through the UPREGULATES_AuG relationship?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.name = \"prostate gland\" RETURN m.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers of cellular components where the gene identified by the description \"zinc finger, FYVE domain containing 27\" takes part.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.description = \"zinc finger, FYVE domain containing 27\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have an upregulation relationship with the anatomy node identified by \"UBERON:0002367,\" with a cap of seven results.", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.identifier = \"UBERON:0002367\" RETURN m.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find three compound identifiers that belong to the pharmacologic class identified by the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\"?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\" RETURN m.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of up to four genes that experience downregulation by an anatomy node labeled with Mesh ID \"D011467\" through AdG.", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.mesh_id = \"D011467\" RETURN m.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the identifiers of the first five compounds that resemble any compound having a \"CC BY-NC 4.0\" licensing?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the names of up to nine biological processes associated with the gene identified by the URL \"http://identifiers.org/ncbigene/2217\"?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) WHERE n.url = \"http://identifiers.org/ncbigene/2217\" RETURN m.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical locations where the disease with the identifier \"http://purl.obolibrary.org/obo/DOID_9970\" localizes, according to the database?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_9970\" RETURN m.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are retrieved from associations with multiple sclerosis, with a maximum of ten results?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) WHERE n.name = \"multiple sclerosis\" RETURN m.name LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers for compounds from pharmacologic classes that include them under a \"CC BY 4.0\" license, limiting the results to five?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.license = \"CC BY 4.0\" RETURN m.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are expressed by the anatomy node corresponding to BTO ID \"BTO:0000122\"?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.bto_id = \"BTO:0000122\" RETURN m.identifier LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list six gene identifiers that are connected to \"Entrez Gene\" source genes through the INTERACTS_GiG relationship?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.source = \"Entrez Gene\" RETURN m.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes, limited to six, that are upregulated by the disease defined by the identifier \"DOID:11612\".", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.identifier = \"DOID:11612\" RETURN m.name LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify up to four gene identifiers that are targets of upregulation by an anatomical structure with a mesh ID of \"D011467\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.mesh_id = \"D011467\" RETURN m.identifier LIMIT 4"}]