[{"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes that possess a \"CC0 1.0\" license and have regulatory connections to other genes, and provide their identifiers.", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes whose license is CC0 1.0 and that are known to interact with other genes. What are their identifiers?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:INTERACTS_GiG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify the compound with the URL \"http://www.drugbank.ca/drugs/DB00878\" that is associated with a downregulating effect on genes?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00878\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifier for the gene named \"BMF\" that participates in at least one biological process?", "output": "MATCH (n:Gene) WHERE n.name = \"BMF\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes identified by \"Entrez Gene\" are connected through a 'COVARIES_GcG' relationship to other genes, and what are their identifiers?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do you identify the gene called \"23053\" that controls another gene, specifically looking for its name?", "output": "MATCH (n:Gene) WHERE n.identifier = \"23053\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compound with the identifier \"DB06717\" that acts as a palliative for some disease.", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB06717\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound from DrugBank with the URL \"http://www.drugbank.ca/drugs/DB00227\" that upregulates any gene?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00227\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you tell me the name of the gene corresponding to the URL \"http://identifiers.org/ncbigene/91392\" if it partakes in a biological process?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/91392\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes that have a CC0 1.0 license and regulate other genes?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the gene names of those on chromosome 15 that have regulatory connections with any other genes.", "output": "MATCH (n:Gene) WHERE n.chromosome = \"15\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes, identified by their unique codes, are situated on chromosome 3 and have a connection of type \"COVARIES_GcG\" to any other gene?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"3\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy named with BTO ID \"BTO:0004368\" has a connection to reducing gene expression?", "output": "MATCH (n:Anatomy) WHERE n.bto_id = \"BTO:0004368\" AND EXISTS((n)-[:DOWNREGULATES_AdG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for compounds labeled as palliating diseases, specifically those sourced from DrugBank.", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases listed in the Disease Ontology that have localization relationships to parts of the anatomy?", "output": "MATCH (n:Disease) WHERE n.source = \"Disease Ontology\" AND EXISTS((n)-[:LOCALIZES_DlA]->(:Anatomy)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the InChIKey \"MJFJKKXQDNNUJF-UHFFFAOYSA-N\" that upregulates at least one gene?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=MJFJKKXQDNNUJF-UHFFFAOYSA-N\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that hold a \"CC0 1.0\" license and are associated with a cellular component?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the gene that has the URL \"http://identifiers.org/ncbigene/64005\" and is known to participate in a biological process?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/64005\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifier of the \"MTFR1\" gene involved in any biological process?", "output": "MATCH (n:Gene) WHERE n.name = \"MTFR1\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are labeled with \"chromosome 6 open reading frame 141\" and have connections to cellular components.", "output": "MATCH (n:Gene) WHERE n.description = \"chromosome 6 open reading frame 141\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can the \"sodium channel inhibitor activity\" molecular function be connected to the \"JNK signaling in the CD4+ TCR pathway\" via the shortest path?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"sodium channel inhibitor activity\" AND n2.name = \"JNK signaling in the CD4+ TCR pathway\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the direct sequence of connections between \"arginase activity\" and \"Opioid Signalling\" in terms of the shortest path?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"arginase activity\" AND n2.name = \"Opioid Signalling\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is \"axon guidance receptor activity\" directly or indirectly linked to \"Bile salt and organic anion SLC transporters,\" and what is the shortest route?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"axon guidance receptor activity\" AND n2.name = \"Bile salt and organic anion SLC transporters\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is \"histone deacetylase regulator activity\" related to the \"Oxidative Stress\" pathway through the shortest path connecting them?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"histone deacetylase regulator activity\" AND n2.name = \"Oxidative Stress\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the briefest link or path possible between the inositol monophosphate 4-phosphatase activity molecular function and the actin folding pathway by CCT/TriC?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"inositol monophosphate 4-phosphatase activity\" AND n2.name = \"Folding of actin by CCT/TriC\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the shortest connection or path available between \"anaphase-promoting complex binding\" as a molecular function and \"Free fatty acid receptors\" as a pathway within the dataset?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"anaphase-promoting complex binding\" AND n2.name = \"Free fatty acid receptors\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I determine the shortest path that links \"glycogenin glucosyltransferase activity\" with \"eyelash\" in terms of molecular function and anatomy?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Anatomy)) WHERE n1.name = \"glycogenin glucosyltransferase activity\" AND n2.name = \"eyelash\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are \"hydroxymethylglutaryl-CoA synthase activity\" and the \"Molybdenum cofactor biosynthesis\" pathway linked through the shortest possible route?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"hydroxymethylglutaryl-CoA synthase activity\" AND n2.name = \"Molybdenum cofactor biosynthesis\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the most direct connection, in terms of relationships, between \"taste receptor activity\" and the \"Calcium signaling in the CD4+ TCR pathway\" within the network?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"taste receptor activity\" AND n2.name = \"Calcium signaling in the CD4+ TCR pathway\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is the \"dopamine neurotransmitter receptor activity, coupled via Gs\" function related to the \"Bile acid and bile salt metabolism\" pathway by the shortest possible path?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"dopamine neurotransmitter receptor activity, coupled via Gs\" AND n2.name = \"Bile acid and bile salt metabolism\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the pathway titled \"Oxygen-dependent proline hydroxylation of Hypoxia-inducible Factor Alpha\" and the \"middle cerebral artery\" anatomically connected, and what is the shortest path between them?", "output": "MATCH p = shortestPath((n1:Pathway)-[*]-(n2:Anatomy)) WHERE n1.name = \"Oxygen-dependent proline hydroxylation of Hypoxia-inducible Factor Alpha\" AND n2.name = \"middle cerebral artery\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the shortest connection path between the \"BMP receptor signaling\" pathway and the \"tibial nerve\" anatomy within the network?", "output": "MATCH p = shortestPath((n1:Pathway)-[*]-(n2:Anatomy)) WHERE n1.name = \"BMP receptor signaling\" AND n2.name = \"tibial nerve\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can the \"N-terminal protein N-methyltransferase activity\" molecular function be linked to the \"Inflammatory Response Pathway\", using the shortest path?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"N-terminal protein N-methyltransferase activity\" AND n2.name = \"Inflammatory Response Pathway\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which is the shortest route linking \"G-protein coupled neurotransmitter receptor activity\" within molecular functions to \"fovea centralis\" among anatomical entities?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Anatomy)) WHERE n1.name = \"G-protein coupled neurotransmitter receptor activity\" AND n2.name = \"fovea centralis\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is the molecular function \"carbonyl reductase (NADPH) activity\" connected to the pathway \"Activation of the phototransduction cascade\" in the shortest number of steps?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"carbonyl reductase (NADPH) activity\" AND n2.name = \"Activation of the phototransduction cascade\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is the molecular function \"single thymine insertion binding\" connected to the pathway \"Osteoblast Signaling\" through the shortest route?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"single thymine insertion binding\" AND n2.name = \"Osteoblast Signaling\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the minimal connection path between the nodes representing \"clathrin light chain binding\" as a Molecular Function and \"Transport of the SLBP independent Mature mRNA\" as a Pathway in the network?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"clathrin light chain binding\" AND n2.name = \"Transport of the SLBP independent Mature mRNA\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How is the \"very-long-chain-(S)-2-hydroxy-acid oxidase activity\" function connected to the \"Activation of RAS in B cells\" pathway in the shortest possible way?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"very-long-chain-(S)-2-hydroxy-acid oxidase activity\" AND n2.name = \"Activation of RAS in B cells\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we determine the shortest route connecting the entities \"beta-galactosidase activity\" and \"WNT5A-dependent internalization of FZD4\" based on their roles as MolecularFunction and Pathway, respectively?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"beta-galactosidase activity\" AND n2.name = \"WNT5A-dependent internalization of FZD4\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the shortest route between the \"Vitamin D Metabolism\" pathway and the \"aortic valve\" anatomical structure?", "output": "MATCH p = shortestPath((n1:Pathway)-[*]-(n2:Anatomy)) WHERE n1.name = \"Vitamin D Metabolism\" AND n2.name = \"aortic valve\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the \"cell adhesion molecule binding\" function and the \"EGFR interacts with phospholipase C-gamma\" pathway linked via the shortest route in the network?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"cell adhesion molecule binding\" AND n2.name = \"EGFR interacts with phospholipase C-gamma\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the shortest path between the molecular function 'taste receptor activity' and the pathway labeled as 'Disease'?", "output": "MATCH p = shortestPath((n1:MolecularFunction)-[*]-(n2:Pathway)) WHERE n1.name = \"taste receptor activity\" AND n2.name = \"Disease\" RETURN p"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all nodes and paths connected to a 'SideEffect' node that holds a \"CC BY-NC-SA 4.0\" license?", "output": "MATCH path=(:SideEffect {license:\"CC BY-NC-SA 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I identify every node that has a direct relationship from the pathway with identifier \"PC7_6877\"?", "output": "MATCH path=(:Pathway {identifier:\"PC7_6877\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all the immediate neighbors of the 'Hypoxia-mediated EMT and Stemness' pathway node along with their connecting relationships?", "output": "MATCH path=(:Pathway {name:\"Hypoxia-mediated EMT and Stemness\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the connected nodes for the gene described as \"glutamic pyruvate transaminase (alanine aminotransferase) 2\"?", "output": "MATCH path=(:Gene {description:\"glutamic pyruvate transaminase (alanine aminotransferase) 2\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return all paths starting from nodes labeled 'SideEffect' with a specific source of 'UMLS via SIDER 4.1' to any connected nodes?", "output": "MATCH path=(:SideEffect {source:\"UMLS via SIDER 4.1\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find every node and relationship associated with the pharmacologic class called \"Phosphodiesterase 5 Inhibitors\"?", "output": "MATCH path=(:PharmacologicClass {name:\"Phosphodiesterase 5 Inhibitors\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly associated with the gene named \"neurotrophic tyrosine kinase, receptor, type 3\"?", "output": "MATCH path=(:Gene {description:\"neurotrophic tyrosine kinase, receptor, type 3\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify all subsequent nodes connected to a symptom node that has the \"CC0 1.0\" license?", "output": "MATCH path=(:Symptom {license:\"CC0 1.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve all direct connections of the node representing the \"Na+-dependent glucose transporters\" pathway?", "output": "MATCH path=(:Pathway {name:\"Na+-dependent glucose transporters\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the network of nodes directly connected to a gene that is associated with the \"CC0 1.0\" license?", "output": "MATCH path=(:Gene {license:\"CC0 1.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all nodes directly linked to the cellular component node with the URL \"http://purl.obolibrary.org/obo/GO_0045281\" and display these connections?", "output": "MATCH path=(:CellularComponent {url:\"http://purl.obolibrary.org/obo/GO_0045281\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly connected to the pathway identified as 'PC7_7767'?", "output": "MATCH path=(:Pathway {identifier:\"PC7_7767\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all connections stemming from a pathway node identified by the source \"Reactome via Pathway Commons\"?", "output": "MATCH path=(:Pathway {source:\"Reactome via Pathway Commons\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all nodes that are directly connected to the CellularComponent represented by the URL \"http://purl.obolibrary.org/obo/GO_0032593\".", "output": "MATCH path=(:CellularComponent {url:\"http://purl.obolibrary.org/obo/GO_0032593\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes have a direct relationship with the node representing the \"interleukin-27 receptor binding\" molecular function?", "output": "MATCH path=(:MolecularFunction {name:\"interleukin-27 receptor binding\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all the relationships involving a 'Compound' node that has the 'CC BY-NC 4.0' license?", "output": "MATCH path=(:Compound {license:\"CC BY-NC 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes and their connecting relationships are adjacent to the pathway node \"PC7_1543\"?", "output": "MATCH path=(:Pathway {identifier:\"PC7_1543\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find paths branching out from any node labeled as a Pathway with the \"CC BY 4.0\" license?", "output": "MATCH path=(:Pathway {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes can be found directly connected from the gene node with the name \"VPS13D\"?", "output": "MATCH path=(:Gene {name:\"VPS13D\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve all nodes that are directly linked to the symptom represented by the URL \"http://identifiers.org/mesh/D007040\"?", "output": "MATCH path=(:Symptom {url:\"http://identifiers.org/mesh/D007040\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly connected to the gene node with the identifier 94137?", "output": "MATCH path=(:Gene {identifier:\"94137\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist from the node representing the pathway \"Signaling by Activin\" to its adjacent nodes?", "output": "MATCH path=(:Pathway {name:\"Signaling by Activin\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all relationships originating from a Pathway node with \"WikiPathways\" as the source?", "output": "MATCH path=(:Pathway {source:\"WikiPathways\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are nodes connected to the node with the name \"peptide-methionine (R)-S-oxide reductase activity\" for molecular functions?", "output": "MATCH path=(:MolecularFunction {name:\"peptide-methionine (R)-S-oxide reductase activity\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify the paths linked to 'SideEffect' nodes that are under the 'CC BY-NC-SA 4.0' license?", "output": "MATCH path=(:SideEffect {license:\"CC BY-NC-SA 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all connections starting from a CellularComponent node that has been licensed under \"CC BY 4.0\"?", "output": "MATCH path=(:CellularComponent {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show all the nodes directly connected to the pathway with the identifier \"PC7_3060\"?", "output": "MATCH path=(:Pathway {identifier:\"PC7_3060\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all direct paths from nodes labeled 'BiologicalProcess' with the attribute license set to \"CC BY 4.0\".", "output": "MATCH path=(:BiologicalProcess {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve all direct relationships starting from \"Gene Ontology\" sourced \"BiologicalProcess\" nodes?", "output": "MATCH path=(:BiologicalProcess {source:\"Gene Ontology\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return all paths starting from the node with the molecular function named \"fatty-acyl-CoA synthase activity\"?", "output": "MATCH path=(:MolecularFunction {name:\"fatty-acyl-CoA synthase activity\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve all connected nodes and relationships starting from a biological process identified by the URL \"http://purl.obolibrary.org/obo/GO_0002793\"?", "output": "MATCH path=(:BiologicalProcess {url:\"http://purl.obolibrary.org/obo/GO_0002793\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly connected to the gene with the name \"OVCA2\"?", "output": "MATCH path=(:Gene {name:\"OVCA2\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return all paths starting from the symptom with the URL \"http://identifiers.org/mesh/D065635\" and identify the related nodes?", "output": "MATCH path=(:Symptom {url:\"http://identifiers.org/mesh/D065635\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all nodes directly linked to the \"Signaling by FGFR in disease\" pathway?", "output": "MATCH path=(:Pathway {name:\"Signaling by FGFR in disease\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve all paths from the node labeled \"BiologicalProcess\" with identifier \"GO:0072126\" to its neighboring nodes?", "output": "MATCH path=(:BiologicalProcess {identifier:\"GO:0072126\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I see the entire path of nodes attached to pharmacologic classes from the FDA database provided through DrugCentral?", "output": "MATCH path=(:PharmacologicClass {source:\"FDA via DrugCentral\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the paths leading from any biological process node that holds the \"CC BY 4.0\" license to their adjacent nodes?", "output": "MATCH path=(:BiologicalProcess {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find paths that begin at 'MolecularFunction' nodes with the 'Gene Ontology' source and connect to other nodes?", "output": "MATCH path=(:MolecularFunction {source:\"Gene Ontology\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the outgoing relationships from the compound node with the InChI description \"InChI=1S/C21H20Cl2O3/c1-21(2)17(12-18(22)23)19(21)20(24)25-13-14-7-6-10-16(11-14)26-15-8-4-3-5-9-15/h3-12,17,19H,13H2,1-2H3\"?", "output": "MATCH path=(:Compound {inchi:\"InChI=1S/C21H20Cl2O3/c1-21(2)17(12-18(22)23)19(21)20(24)25-13-14-7-6-10-16(11-14)26-15-8-4-3-5-9-15/h3-12,17,19H,13H2,1-2H3\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the nodes and relationships connected to the node with the molecular function identifier \"GO:0015277\"?", "output": "MATCH path=(:MolecularFunction {identifier:\"GO:0015277\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you determine the paths originating from the compound with the InChI key \"InChI=1S/C39H43N3O11S/c1-16-9-20-10-22-37(46)42-23-13-50-38(47)39(21-12-25(48-5)24(44)11-19(21)7-8-40-39)14-54-36(30(42)29(41(22)4)26(20)31(45)32(16)49-6)28-27(23)35-34(51-15-52-35)17(2)33(28)53-18(3)43/h9,11-12,22-23,29-30,36-37,40,44-46H,7-8,10,13-15H2,1-6H3/t22-,23-,29+,30+,36+,37-,39+/m0/s1\" to any other nodes?", "output": "MATCH path=(:Compound {inchi:\"InChI=1S/C39H43N3O11S/c1-16-9-20-10-22-37(46)42-23-13-50-38(47)39(21-12-25(48-5)24(44)11-19(21)7-8-40-39)14-54-36(30(42)29(41(22)4)26(20)31(45)32(16)49-6)28-27(23)35-34(51-15-52-35)17(2)33(28)53-18(3)43/h9,11-12,22-23,29-30,36-37,40,44-46H,7-8,10,13-15H2,1-6H3/t22-,23-,29+,30+,36+,37-,39+/m0/s1\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist from nodes labeled as CellularComponent with source \"Gene Ontology\" to any other connected nodes?", "output": "MATCH path=(:CellularComponent {source:\"Gene Ontology\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes and connecting relationships are linked to the molecular function node with the name \"malonyltransferase activity\"?", "output": "MATCH path=(:MolecularFunction {name:\"malonyltransferase activity\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all the paths starting from any disease node labeled with the \"CC BY 3.0\" license to other related nodes?", "output": "MATCH path=(:Disease {license:\"CC BY 3.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I explore the immediate connections of the gene with the designation \"ring finger protein 41, E3 ubiquitin protein ligase\"?", "output": "MATCH path=(:Gene {description:\"ring finger protein 41, E3 ubiquitin protein ligase\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the direct relationships extending from the node with the molecular function \"transcription factor activity, RNA polymerase II basal transcription factor binding\"?", "output": "MATCH path=(:MolecularFunction {name:\"transcription factor activity, RNA polymerase II basal transcription factor binding\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find paths that connect nodes labeled 'Anatomy' with a license 'CC BY 3.0' to any adjacent nodes?", "output": "MATCH path=(:Anatomy {license:\"CC BY 3.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all direct relationships starting from the anatomy node that has a Mesh ID of \"D000302\"?", "output": "MATCH path=(:Anatomy {mesh_id:\"D000302\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes and relationships are directly connected to the compound having the identifier \"DB04948\"?", "output": "MATCH path=(:Compound {identifier:\"DB04948\"})-->() RETURN path"}]