[{"instruction": "Convert the following natural language into Cypher query.", "input": "What is the description of each gene and the total number of times it is associated with other entities through the \"ASSOCIATES_DaG\" relationship?", "output": "MATCH (n:Gene) RETURN n.description, size((n)<-[:ASSOCIATES_DaG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list each compound's license and the total number of connections directed towards it via the INCLUDES_PCiC relationship?", "output": "MATCH (n:Compound) RETURN n.license, size((n)<-[:INCLUDES_PCiC]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifier for each gene and count how many times it is upregulated by other nodes?", "output": "MATCH (n:Gene) RETURN n.identifier, size((n)<-[:UPREGULATES_DuG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each cellular component, what is the license, and how many items participate in it according to the PARTICIPATES_GpCC relationship?", "output": "MATCH (n:CellularComponent) RETURN n.license, size((n)<-[:PARTICIPATES_GpCC]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which chromosomes do the genes belong to, and what is the interaction count for each gene based on incoming INTERACTS_GiG connections?", "output": "MATCH (n:Gene) RETURN n.chromosome, size((n)<-[:INTERACTS_GiG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For every compound, what is its source and how many incoming INCLUDES_PCiC relationships does it have?", "output": "MATCH (n:Compound) RETURN n.source, size((n)<-[:INCLUDES_PCiC]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene, what is the source, and how many incoming \"UPREGULATES_DuG\" relationships does it have?", "output": "MATCH (n:Gene) RETURN n.source, size((n)<-[:UPREGULATES_DuG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each cellular component, what is its source and how many entities participate via the PARTICIPATES_GpCC relationship?", "output": "MATCH (n:CellularComponent) RETURN n.source, size((n)<-[:PARTICIPATES_GpCC]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each disease, what is the corresponding license and how many other nodes are linked to it through a palliative relationship?", "output": "MATCH (n:Disease) RETURN n.license, size((n)<-[:PALLIATES_CpD]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For every disease node, what is the source and how many nodes have a palliating connection to it?", "output": "MATCH (n:Disease) RETURN n.source, size((n)<-[:PALLIATES_CpD]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of genes along with the total number of incoming \"BINDS_CbG\" relationships for each?", "output": "MATCH (n:Gene) RETURN n.identifier, size((n)<-[:BINDS_CbG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve each gene's URL along with the count of things downregulating it?", "output": "MATCH (n:Gene) RETURN n.url, size((n)<-[:DOWNREGULATES_CdG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What license does each gene have, and how many nodes are linked to it through the \"upregulates\" relationship type?", "output": "MATCH (n:Gene) RETURN n.license, size((n)<-[:UPREGULATES_DuG]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each disease, what is its name and how many entities are linked to it by the \"PALLIATES_CpD\" relationship?", "output": "MATCH (n:Disease) RETURN n.name, size((n)<-[:PALLIATES_CpD]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the URLs of all compounds along with the count of 'INCLUDES_PCiC' relationships pointing to each one?", "output": "MATCH (n:Compound) RETURN n.url, size((n)<-[:INCLUDES_PCiC]-()) AS count"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What data can be returned for a Pathway whose name matches \"Na+-dependent glucose transporters\"?", "output": "MATCH (n:Pathway) WHERE n.name = \"Na+-dependent glucose transporters\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the compound with the property URL set to \"http://www.drugbank.ca/drugs/DB01181\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB01181\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the information for the pathway called \"Hypoxia-mediated EMT and Stemness.\"", "output": "MATCH (n:Pathway) WHERE n.name = \"Hypoxia-mediated EMT and Stemness\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the gene that has a description of \"glutamic pyruvate transaminase (alanine aminotransferase) 2\".", "output": "MATCH (n:Gene) WHERE n.description = \"glutamic pyruvate transaminase (alanine aminotransferase) 2\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all pathways where the license is specified as \"CC BY 4.0\".", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find pharmacologic class entities with the source specified as \"FDA via DrugCentral\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the details of the pathway named \"ATF4 activates genes\" using this query?", "output": "MATCH (n:Pathway) WHERE n.name = \"ATF4 activates genes\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve pathways that are specifically linked to Reactome as their source through Pathway Commons?", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all cellular components that have \"CC BY 4.0\" as their license.", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the information related to the pharmacologic class called \"Phosphodiesterase 5 Inhibitors\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Phosphodiesterase 5 Inhibitors\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you find the molecular function node with the name \"peptide-methionine (R)-S-oxide reductase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"peptide-methionine (R)-S-oxide reductase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve information on all PharmacologicClass entities with a license of \"CC BY 4.0\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the biological process labeled as \"ESCRT III complex disassembly\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name = \"ESCRT III complex disassembly\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the information for the gene linked to the URL \"http://identifiers.org/ncbigene/152518\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/152518\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the molecular function entity associated with the name \"transcription factor activity, RNA polymerase II basal transcription factor binding\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"transcription factor activity, RNA polymerase II basal transcription factor binding\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the pathway node that is identified by \"PC7_3060\".", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_3060\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all biological processes that possess the \"CC BY 4.0\" licensing.", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available about the pathway named \"Signaling by Activin\"?", "output": "MATCH (n:Pathway) WHERE n.name = \"Signaling by Activin\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can we retrieve about the molecular function associated with the name \"fatty-acyl-CoA synthase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"fatty-acyl-CoA synthase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the pathway labeled node that is named \"Signaling by FGFR in disease\".", "output": "MATCH (n:Pathway) WHERE n.name = \"Signaling by FGFR in disease\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the SideEffect node associated with the URL \"http://identifiers.org/umls/C0019917\"?", "output": "MATCH (n:SideEffect) WHERE n.url = \"http://identifiers.org/umls/C0019917\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all compounds that have the license type \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the CellularComponent with the identifier \"GO:0009295\" and return its information.", "output": "MATCH (n:CellularComponent) WHERE n.identifier = \"GO:0009295\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the gene that has the identifier set to 9703?", "output": "MATCH (n:Gene) WHERE n.identifier = 9703 RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the symptom that has the URL \"http://identifiers.org/mesh/D065635\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D065635\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all gene entities with the description \"ring finger protein 41, E3 ubiquitin protein ligase\"?", "output": "MATCH (n:Gene) WHERE n.description = \"ring finger protein 41, E3 ubiquitin protein ligase\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all gene entries that have the \"CC0 1.0\" license?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the anatomy elements that have been marked with the \"CC BY 3.0\" license.", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the Gene that is described as \"neurotrophic tyrosine kinase, receptor, type 3\"?", "output": "MATCH (n:Gene) WHERE n.description = \"neurotrophic tyrosine kinase, receptor, type 3\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we fetch details regarding the compound with the name \"Anileridine\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Anileridine\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the details of the SideEffect node that has the URL \"http://identifiers.org/umls/C1096185\".", "output": "MATCH (n:SideEffect) WHERE n.url = \"http://identifiers.org/umls/C1096185\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which specific Pathway node has an identifier of \"PC7_1543\"?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_1543\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the symptom entity that matches the URL \"http://identifiers.org/mesh/D007040\".", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D007040\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the details of the compound that has the name \"Benazepril\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Benazepril\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can be retrieved about the Pathway with the identifier \"PC7_3326\" from the database?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_3326\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the SideEffect entity with the specific URL \"http://identifiers.org/umls/C1859270\"?", "output": "MATCH (n:SideEffect) WHERE n.url = \"http://identifiers.org/umls/C1859270\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the query to retrieve the gene with the specific identifier URL \"http://identifiers.org/ncbigene/5634\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/5634\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all pathway nodes that have their source specified as \"WikiPathways\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"WikiPathways\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all the biological process entities whose source is specified as the Gene Ontology.", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway corresponds to the identifier \"PC7_6877\" in the system?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_6877\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all gene information where the source attribute is \"Entrez Gene.\"", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all side effect records where the licensing is specified as \"CC BY-NC-SA 4.0\".", "output": "MATCH (n:SideEffect) WHERE n.license = \"CC BY-NC-SA 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the BiologicalProcess that has \"GO:0071108\" as its identifier?", "output": "MATCH (n:BiologicalProcess) WHERE n.identifier = \"GO:0071108\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the cellular component whose URL matches \"http://purl.obolibrary.org/obo/GO_0005915\" and return its details.", "output": "MATCH (n:CellularComponent) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0005915\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can one find the genes that are categorized under the \"CC0 1.0\" license in the database?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you fetch the details of the disease that has the identifier \"DOID:90\"?", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:90\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify the SideEffect node linked to the URL \"http://identifiers.org/umls/C2364111\"?", "output": "MATCH (n:SideEffect) WHERE n.url = \"http://identifiers.org/umls/C2364111\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the information associated with the biological pathway identified as \"PC7_7767\"?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_7767\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the biological processes whose license attribute is set to CC BY 4.0?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the 'MolecularFunction' entity that is labeled as \"polyprenyltransferase activity.\"", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"polyprenyltransferase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can we retrieve about the gene with the identifier 80740?", "output": "MATCH (n:Gene) WHERE n.identifier = 80740 RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the biological process that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_1902966\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_1902966\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the properties associated with the gene named \"PRAC1\"?", "output": "MATCH (n:Gene) WHERE n.name = \"PRAC1\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the biological process known as \"bacterial-type flagellum-dependent cell motility\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name = \"bacterial-type flagellum-dependent cell motility\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which attributes or properties are available for the anatomy node labeled as 'sacro-iliac joint'?", "output": "MATCH (n:Anatomy) WHERE n.name = \"sacro-iliac joint\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available for the anatomy structure known as the \"sternoclavicular joint\" in the database?", "output": "MATCH (n:Anatomy) WHERE n.name = \"sternoclavicular joint\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available for the biological process associated with the URL \"http://purl.obolibrary.org/obo/GO_0048387\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0048387\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the cellular component that corresponds to the identifier \"GO:0000110.\"", "output": "MATCH (n:CellularComponent) WHERE n.identifier = \"GO:0000110\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the Gene node that has \"OVCA2\" as its name?", "output": "MATCH (n:Gene) WHERE n.name = \"OVCA2\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can you match and return the data associated with the gene whose name is \"CNTN6\"?", "output": "MATCH (n:Gene) WHERE n.name = \"CNTN6\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve information about the gene with an identifier value of 3276.", "output": "MATCH (n:Gene) WHERE n.identifier = 3276 RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all cellular components that are associated with the data source labeled \"Gene Ontology.\"", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you show me the properties of the molecular function with the ID \"GO:0070061\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0070061\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can be retrieved about the disease with the identifier \"DOID:14268\"?", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:14268\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the cellular component node that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_0045281\".", "output": "MATCH (n:CellularComponent) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0045281\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the attributes of the gene identified by the name \"CDC42EP4\"?", "output": "MATCH (n:Gene) WHERE n.name = \"CDC42EP4\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the disease with the identifier \"DOID:418\" in the database?", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:418\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component is identified by the URL \"http://purl.obolibrary.org/obo/GO_0032593\"?", "output": "MATCH (n:CellularComponent) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032593\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the anatomy node that has a mesh ID of \"D000302.\"", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D000302\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the node labeled as MolecularFunction that has the name \"malonyltransferase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"malonyltransferase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the properties of the compound identified as \"DB04948\"?", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB04948\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the information stored about the anatomy having the identifier \"UBERON:0002165\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier = \"UBERON:0002165\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function corresponds to the identifier \"GO:0008374\"?", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0008374\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have the attribute indicating they are from DrugBank?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the compound information for the InChIKey \"InChIKey=BFYIZQONLCFLEV-DAELLWKTSA-N\".", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=BFYIZQONLCFLEV-DAELLWKTSA-N\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene is represented by the URL \"http://identifiers.org/ncbigene/388951\" in the graph database?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/388951\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the node labeled `MolecularFunction` that is associated with the specific name \"interleukin-27 receptor binding\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name = \"interleukin-27 receptor binding\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which specific anatomy entry corresponds to the BTO ID \"BTO:0001499\"?", "output": "MATCH (n:Anatomy) WHERE n.bto_id = \"BTO:0001499\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomical structures are categorized under the source \"Uberon\" in the data?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the gene labeled as VPS13D in the database?", "output": "MATCH (n:Gene) WHERE n.name = \"VPS13D\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the details of the cellular component that has the identifier \"GO:1902495\"?", "output": "MATCH (n:CellularComponent) WHERE n.identifier = \"GO:1902495\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all side effect entries that are documented as coming from \"UMLS via SIDER 4.1\".", "output": "MATCH (n:SideEffect) WHERE n.source = \"UMLS via SIDER 4.1\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of a compound that corresponds to the InChI \"InChI=1S/Mg.H2O4S/c;1-5(2,3)4/h;(H2,1,2,3,4)/q+2;/p-2\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/Mg.H2O4S/c;1-5(2,3)4/h;(H2,1,2,3,4)/q+2;/p-2\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the gene that is described as \"neuroblastoma breakpoint family, member 19-like\".", "output": "MATCH (n:Gene) WHERE n.description = \"neuroblastoma breakpoint family, member 19-like\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the gene associated with Treacher Collins-Franceschetti syndrome 1?", "output": "MATCH (n:Gene) WHERE n.description = \"Treacher Collins-Franceschetti syndrome 1\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the gene with the description \"RAB24, member RAS oncogene family\"?", "output": "MATCH (n:Gene) WHERE n.description = \"RAB24, member RAS oncogene family\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of the symptom associated with the identifier \"D020069\"?", "output": "MATCH (n:Symptom) WHERE n.identifier = \"D020069\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I need to know the name of the disease that corresponds to the identifier \"DOID:175\". What is it?", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:175\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the pharmacologic class known as \"Increased Hematopoietic Stem Cell Mobilization\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Increased Hematopoietic Stem Cell Mobilization\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the name of the compound with the specified InChI code \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the pathway with the identifier \"PC7_2523\"?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_2523\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifier for a gene described as \"family with sequence similarity 227, member A\"?", "output": "MATCH (n:Gene) WHERE n.description = \"family with sequence similarity 227, member A\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get the identifier for the compound with the specific URL \"http://www.drugbank.ca/drugs/DB00563\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00563\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier for the compound with the inchi attribute set to \"InChI=1S/C16H14O3/c1-11(16(18)19)13-8-5-9-14(10-13)15(17)12-6-3-2-4-7-12/h2-11H,1H3,(H,18,19)\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C16H14O3/c1-11(16(18)19)13-8-5-9-14(10-13)15(17)12-6-3-2-4-7-12/h2-11H,1H3,(H,18,19)\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the gene that matches the given URL \"http://identifiers.org/ncbigene/23568\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/23568\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the compound whose InChI is defined as \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\".", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name corresponding to the compound with the InChI \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\" in the database?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the compound that has the name \"Metixene.\"", "output": "MATCH (n:Compound) WHERE n.name = \"Metixene\" RETURN n.identifier"}]