[{"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all compounds that are part of the pharmacologic class designated as \"N0000000236\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000000236\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that belong to the pharmacologic class of HCV NS3/4A Protease Inhibitors?", "output": "MATCH (:PharmacologicClass{name: \"HCV NS3/4A Protease Inhibitors\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of compounds that are associated with the pharmacologic class coded as \"N0000187058\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000187058\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names that belong to the pharmacologic class with the name \"Decreased Cell Wall Integrity\"?", "output": "MATCH (:PharmacologicClass{name: \"Decreased Cell Wall Integrity\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that belong to the Pharmacologic Class \"Nonsteroidal Anti-inflammatory Compounds\"?", "output": "MATCH (:PharmacologicClass{name: \"Nonsteroidal Anti-inflammatory Compounds\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds included under the pharmacologic class of P2Y12 Receptor Antagonists?", "output": "MATCH (:PharmacologicClass{name: \"P2Y12 Receptor Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the pharmacologic class Nitroimidazoles, which compound names are retrieved?", "output": "MATCH (:PharmacologicClass{name: \"Nitroimidazoles\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds classified under the pharmacologic class \"Gonadotropin Releasing Hormone Receptor Antagonists\"?", "output": "MATCH (:PharmacologicClass{name: \"Gonadotropin Releasing Hormone Receptor Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds that are part of the pharmacologic class labeled \"N0000009010\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000009010\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that are part of the Calcium Channel Antagonists pharmacologic class.", "output": "MATCH (:PharmacologicClass{name: \"Calcium Channel Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of pharmacologic classes associated with the compound having the identifier \"DB01072\".  ", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01072\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of pharmacologic classes that include a compound with the identifier \"DB08873\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB08873\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of pharmacologic classes containing the compound identified as \"DB00202\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00202\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of pharmacologic classes to which the compound with identifier \"DB00218\" belongs.", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00218\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of pharmacologic classes that contain the compound with the identifier \"DB01115\".", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01115\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of pharmacologic classes that the compound \"DB01004\" is part of.", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01004\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class names are associated with the compound having the identifier \"DB00551\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00551\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the names of pharmacologic classes that have the compound with the identifier \"DB00035\" among their included compounds.", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00035\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pharmacologic class names that include the compound known by the identifier \"DB00707\".", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00707\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the name of each pharmacologic class that contains the compound with the identifier \"DB01016\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01016\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pharmacologic classes that include the compound with the identifier \"DB01114\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01114\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which names of pharmacologic classes are related to the compound with the identifier \"DB01012\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01012\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out which pharmacologic class names are associated with the compound \"DB00963\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00963\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pharmacologic classes that include the compound with the identifier \"DB00565\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00565\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class names are associated with the compound having the identifier \"DB00593\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00593\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic class names belong to classes that incorporate the compound with the identifier \"DB00273\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00273\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the pharmacologic class names that the compound with identifier code \"DB00577\" belongs to?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00577\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each pharmacologic class that the compound with identifier \"DB01241\" belongs to?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01241\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pharmacologic classes that include the compound with the identifier \"DB00624\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00624\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class names belong to those that include the specified compound, \"DB08912\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB08912\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pharmacologic classes by name that include the compound with the ID \"DB00232\".", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00232\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic classes that include the compound with the identifier \"DB00460\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00460\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic class names are associated with the compound having the identifier \"DB00547\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00547\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic classes that include the compound with the identifier \"DB01167\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB01167\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each pharmacologic class that contains the compound known by the identifier \"DB00773\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00773\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic class names are associated with the compound having the identifier \"DB00929\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00929\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of the pharmacologic classes that have the compound with the identifier \"DB00987\" as one of their components.", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00987\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic classes that include the compound with the identifier \"DB00753\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00753\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic classes that include the compound with the identifier \"DB00231\"?", "output": "MATCH (pc:PharmacologicClass)-[:INCLUDES_PCiC]->(:Compound{identifier: \"DB00231\"}) RETURN pc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the molecular function names that involve the gene \"IFNA5\"?", "output": "MATCH (:Gene{name: \"IFNA5\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of molecular functions that genes on chromosome 11 are involved in?", "output": "MATCH (:Gene{chromosome: \"11\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of molecular functions linked to the participation of the SLCO5A1 gene.", "output": "MATCH (:Gene{name: \"SLCO5A1\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of molecular functions that have a relationship with the gene \"IFNA8\".", "output": "MATCH (:Gene{name: \"IFNA8\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function names are associated with genes from chromosome 11 through their participation?", "output": "MATCH (:Gene{chromosome: \"11\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of molecular functions involving genes that belong to chromosome 9.", "output": "MATCH (:Gene{chromosome: \"9\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function names are genes on chromosome 9 participating in?", "output": "MATCH (:Gene{chromosome: \"9\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are associated with genes from chromosome 4?", "output": "MATCH (:Gene{chromosome: \"4\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are related to genes found on the X chromosome through their participation?", "output": "MATCH (:Gene{chromosome: \"X\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names that are linked to the gene \"USP17L1.\"", "output": "MATCH (:Gene{name: \"USP17L1\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names connected to genes that are on chromosome 19.", "output": "MATCH (:Gene{chromosome: \"19\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which names of molecular functions are connected to the \"TRAF3\" gene as participants?", "output": "MATCH (:Gene{name: \"TRAF3\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are associated with genes that are part of chromosome 4?", "output": "MATCH (:Gene{chromosome: \"4\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular functions that involve the gene \"PRKRIP1,\" as per the function names.", "output": "MATCH (:Gene{name: \"PRKRIP1\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are related to genes that participate from chromosome 3?", "output": "MATCH (:Gene{chromosome: \"3\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the molecular functions that have a relationship with the gene \"HTN1\"?", "output": "MATCH (:Gene{name: \"HTN1\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of molecular functions that the \"NGF\" gene is involved with?", "output": "MATCH (:Gene{name: \"NGF\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names related to genes situated on chromosome 7.", "output": "MATCH (:Gene{chromosome: \"7\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the molecular function names associated with the gene IFNA10 through its participation?", "output": "MATCH (:Gene{name: \"IFNA10\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are related to genes found on chromosome 10?", "output": "MATCH (:Gene{chromosome: \"10\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the names of molecular functions involving genes from chromosome 11?", "output": "MATCH (:Gene{chromosome: \"11\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function names are associated with the participation of genes on chromosome 11?", "output": "MATCH (:Gene{chromosome: \"11\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names that have a participation relationship with genes on chromosome 5.", "output": "MATCH (:Gene{chromosome: \"5\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names linked to the gene \"NR2F6\".", "output": "MATCH (:Gene{name: \"NR2F6\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the names of molecular functions that involve genes on chromosome 9?", "output": "MATCH (:Gene{chromosome: \"9\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular function names linked to the gene \"CREBBP\".", "output": "MATCH (:Gene{name: \"CREBBP\"})-[:PARTICIPATES_GpMF]->(mf:MolecularFunction) RETURN mf.name"}]