[{"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of the symptom linked to the specific URL \"http://identifiers.org/mesh/D019080\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D019080\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of the pathway identified by \"PC7_4207\" in the database?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_4207\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the gene with a description of \"mitochondrial ribosomal protein L44\"?", "output": "MATCH (n:Gene) WHERE n.description = \"mitochondrial ribosomal protein L44\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the name of the pharmacologic class with the specific URL \"http://purl.bioontology.org/ontology/NDFRT/N0000187063\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000187063\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of pharmacologic classes whose license type is \"CC BY 4.0\".", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the unique identifier of the symptom labeled as \"Syncope\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Syncope\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all pathways whose source is identified as \"Reactome via Pathway Commons.\"", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all cellular components whose license is \"CC BY 4.0\".", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class has the identifier \"N0000190482\" and what is its name?", "output": "MATCH (n:PharmacologicClass) WHERE n.identifier = \"N0000190482\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the name of the gene that uses \"http://identifiers.org/ncbigene/84914\" as its URL identifier?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/84914\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the gene whose URL is \"http://identifiers.org/ncbigene/84287\".", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/84287\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifier is returned for a cellular component whose name is \"eukaryotic translation initiation factor 2B complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"eukaryotic translation initiation factor 2B complex\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the name of the compound whose InChIKey is \"LZCDAPDGXCYOEH-UHFFFAOYSA-N\".", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=LZCDAPDGXCYOEH-UHFFFAOYSA-N\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the unique identifier associated with the symptom \"Psychomotor Agitation\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Psychomotor Agitation\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the unique identifier for a CellularComponent called \"BLOC-3 complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"BLOC-3 complex\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathways whose license is \"CC BY 4.0\" and return their unique identifiers.", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I need to know the gene name associated with the URL \"http://identifiers.org/ncbigene/152518\". What is it?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/152518\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound with the InChIKey \"InChIKey=HNDVDQJCIGZPNO-YFKPBYRVSA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=HNDVDQJCIGZPNO-YFKPBYRVSA-N\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers for pharmacologic classes that come from the \"FDA via DrugCentral\" source?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we retrieve the identifier of a compound that matches the InChIKey \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers of molecular functions that possess the \"CC BY 4.0\" license.", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the name of the compound whose URL corresponds to \"http://www.drugbank.ca/drugs/DB00464\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00464\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers of cellular components that possess the license type \"CC BY 4.0\".", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do I retrieve the identifier for the biological process that is labeled as \"pore complex assembly\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name = \"pore complex assembly\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound that has the URL \"http://www.drugbank.ca/drugs/DB00348\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00348\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of genes that have the \"CC0 1.0\" licensing?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of a cellular component named \"cell tip\"?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"cell tip\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the gene whose name is \"SMPD1\".", "output": "MATCH (n:Gene) WHERE n.name = \"SMPD1\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathway names are associated with the source labeled \"PID via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"PID via Pathway Commons\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the cellular component whose name is \"elongin complex\".", "output": "MATCH (n:CellularComponent) WHERE n.name = \"elongin complex\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers of all symptoms whose license is categorized as \"CC0 1.0\".", "output": "MATCH (n:Symptom) WHERE n.license = \"CC0 1.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier for the compound located at the DrugBank URL \"http://www.drugbank.ca/drugs/DB00936\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00936\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the symptom that has the URL \"http://identifiers.org/mesh/D001836\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D001836\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all compounds with a \"CC BY-NC 4.0\" license.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound's identifier corresponds to the given InChI string \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of names for pharmacologic class entities with a source of \"FDA via DrugCentral\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of all biological processes that come with a \"CC BY 4.0\" license?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the name of the BiologicalProcess that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_0060973\".", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0060973\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifier corresponds to the symptom with the name \"Chronic Pain\"?", "output": "MATCH (n:Symptom) WHERE n.name = \"Chronic Pain\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of cellular components that originate from the Gene Ontology source.", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do you get the identifiers of compounds that have DrugBank mentioned as their source?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound that has the InChIKey \"UVSMNLNDYGZFPF-UHFFFAOYNA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=UVSMNLNDYGZFPF-UHFFFAOYNA-N\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the gene named \"LECT1\"?", "output": "MATCH (n:Gene) WHERE n.name = \"LECT1\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifier is associated with the compound that goes by the name \"Fenoterol\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Fenoterol\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the pathway named \"DNA Replication\"?", "output": "MATCH (n:Pathway) WHERE n.name = \"DNA Replication\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the gene with the identifier 92283?", "output": "MATCH (n:Gene) WHERE n.identifier = 92283 RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the cellular components whose license is \"CC BY 4.0\" and provide their names?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the identifier for the molecular function whose URL is \"http://purl.obolibrary.org/obo/GO_0032934\"?", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032934\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the names of pathways whose license is specified as \"CC BY 4.0\"?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of the anatomy node that has an identifier of \"UBERON:0003129\"?", "output": "MATCH (n:Anatomy) WHERE n.identifier = \"UBERON:0003129\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all gene names associated with a CC0 1.0 license?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are associated with the source called Entrez Gene?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers for anatomy nodes that come from the \"Uberon\" source?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of pharmacologic classes where the class type is specified as \"Mechanism of Action\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.class_type = \"Mechanism of Action\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entries are associated with a license of \"CC BY 3.0\"?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the MolecularFunction node that matches the URL \"http://purl.obolibrary.org/obo/GO_0010997\".", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0010997\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of pathways whose license is \"CC0 1.0\"?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC0 1.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound identifiers are associated with DrugBank as their source?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of compounds that originate from DrugBank?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of biological processes that originate from the Gene Ontology source.", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the anatomy entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0001003\"?", "output": "MATCH (n:Anatomy) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0001003\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the biological process with the URL \"http://purl.obolibrary.org/obo/GO_0086065\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0086065\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the name of the cellular component with the given identifier \"GO:0042825\".", "output": "MATCH (n:CellularComponent) WHERE n.identifier = \"GO:0042825\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the name of the SideEffect node that has the URL \"http://identifiers.org/umls/C0750151\"?", "output": "MATCH (n:SideEffect) WHERE n.url = \"http://identifiers.org/umls/C0750151\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for pathways licensed under \"CC BY 3.0\".", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 3.0\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers for pharmacologic classes where the class type is specified as \"Chemical/Ingredient\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.class_type = \"Chemical/Ingredient\" RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways carry the \"CC BY 4.0\" license, and what are their corresponding names?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve up to eight identifiers of genes whose description is \"RAB24, member RAS oncogene family.\"", "output": "MATCH (n:Gene) WHERE n.description = \"RAB24, member RAS oncogene family\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which two genes, if any, have the description \"neuroblastoma breakpoint family, member 19-like\" and what are their identifiers?", "output": "MATCH (n:Gene) WHERE n.description = \"neuroblastoma breakpoint family, member 19-like\" RETURN n.identifier LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve identifiers for no more than eight genes that hold the \"CC0 1.0\" license?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of the gene nodes that have the URL \"http://identifiers.org/ncbigene/84287\".", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/84287\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that match the InChI value \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\", listing only up to five of them?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the names of the first eight compounds that match the URL \"http://www.drugbank.ca/drugs/DB00464\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00464\" RETURN n.name LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of up to four anatomy nodes that have the URL set to \"http://purl.obolibrary.org/obo/UBERON_0001003\".", "output": "MATCH (n:Anatomy) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0001003\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers are returned for the pharmacologic class titled \"Increased Hematopoietic Stem Cell Mobilization\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Increased Hematopoietic Stem Cell Mobilization\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of cellular components that have the identifier \"GO:0042825,\" showing just four results.", "output": "MATCH (n:CellularComponent) WHERE n.identifier = \"GO:0042825\" RETURN n.name LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of the nine molecular functions that are licensed under \"CC BY 4.0.\"", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the gene identifiers for \"LECT1\", limited to nine results?", "output": "MATCH (n:Gene) WHERE n.name = \"LECT1\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find up to eight identifiers for the compound with the URL \"http://www.drugbank.ca/drugs/DB00936\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00936\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can one obtain the identifiers of the cellular component with the name \"elongin complex,\" limiting the results to four?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"elongin complex\" RETURN n.identifier LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of no more than six genes with the URL \"http://identifiers.org/ncbigene/84914\".", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/84914\" RETURN n.name LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the identifiers for cellular components with the name \"eukaryotic translation initiation factor 2B complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"eukaryotic translation initiation factor 2B complex\" RETURN n.identifier LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of the first three genes with the description \"family with sequence similarity 227, member A\"?", "output": "MATCH (n:Gene) WHERE n.description = \"family with sequence similarity 227, member A\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for up to five pathways that have the license type \"CC BY 4.0\".", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve six identifiers of anatomy nodes that specify \"Uberon\" as their source?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifier values are returned for the cellular component labeled as \"BLOC-3 complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"BLOC-3 complex\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifier of one biological process where the license is specified as \"CC BY 4.0\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve and display the identifier of a gene with a \"CC0 1.0\" license. What is it?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of three symptoms that possess a \"CC0 1.0\" license.", "output": "MATCH (n:Symptom) WHERE n.license = \"CC0 1.0\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifiers correspond to genes labeled \"mitochondrial ribosomal protein L44,\" limited to six results?", "output": "MATCH (n:Gene) WHERE n.description = \"mitochondrial ribosomal protein L44\" RETURN n.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers for compounds where the InChI matches \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\", but only show the first ten results.", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\" RETURN n.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular component with a CC BY 4.0 license is the query retrieving the name of first?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.name LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How could you retrieve the names of genes linked to the URL \"http://identifiers.org/ncbigene/158067,\" showing only up to seven entries?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/158067\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve up to three identifiers for the gene that has the name \"SMPD1.\"", "output": "MATCH (n:Gene) WHERE n.name = \"SMPD1\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of genes licensed under \"CC0 1.0\" with a limit of nine?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve up to three identifiers for the molecular function that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_0010997\".", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0010997\" RETURN n.identifier LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifier associated with the Gene node whose URL is exactly \"http://identifiers.org/ncbigene/23568\", limiting the result to six entries.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/23568\" RETURN n.identifier LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the identifiers of \"DNA Replication\" pathways, limited to nine entries?", "output": "MATCH (n:Pathway) WHERE n.name = \"DNA Replication\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of up to seven compounds that have the URL \"http://www.drugbank.ca/drugs/DB00348\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00348\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway names are associated with the identifier \"PC7_4207,\" displaying only the first seven matches?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_4207\" RETURN n.name LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve nine or fewer compound identifiers whose InChI property is exactly \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\".", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What name is returned for the compound with the URL \"http://www.drugbank.ca/drugs/DB00962\" in the dataset?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00962\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of three compounds whose license is specified as \"CC BY-NC 4.0\".", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN n.name LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of molecular functions whose identifier matches \"GO:0005086\", with a maximum return of nine entries.", "output": "MATCH (n:MolecularFunction) WHERE n.identifier = \"GO:0005086\" RETURN n.name LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve up to five names of molecular functions that have the exact URL \"http://purl.obolibrary.org/obo/GO_0005010\".", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0005010\" RETURN n.name LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the Molecular Function node for the given URL: \"http://purl.obolibrary.org/obo/GO_0032934\".", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032934\" RETURN n.identifier LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of compounds that have the name \"Metixene\" up to a maximum of nine results?", "output": "MATCH (n:Compound) WHERE n.name = \"Metixene\" RETURN n.identifier LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of the first ten compounds with the specific InChIKey \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\" RETURN n.identifier LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How does this query fetch the names of two pathways originating from the source \"PID via Pathway Commons\"?", "output": "MATCH (n:Pathway) WHERE n.source = \"PID via Pathway Commons\" RETURN n.name LIMIT 2"}]