[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the disease with identifier \"DOID:1793\"?", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the disease with the identifier \"DOID:0050742\"?", "output": "MATCH (:Disease{identifier: \"DOID:0050742\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes downregulated by the disease \"nicotine dependence\"?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the disease with the identifier DOID:11612?", "output": "MATCH (:Disease{identifier: \"DOID:11612\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the disease known as nicotine dependence?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are downregulated by the disease associated with the identifier DOID:1793?", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that are linked to upregulating the gene with the name \"PLA2R1\".", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"PLA2R1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that are known to upregulate the gene with the name PDZD3.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"PDZD3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene named \"STAT3\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"STAT3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are known to upregulate the gene named \"MAP7D1\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"MAP7D1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene named \"LOC157503\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"LOC157503\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene DLGAP5?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"DLGAP5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that can upregulate the gene named C11orf70?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"C11orf70\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene named TM9SF3?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"TM9SF3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that have an upregulatory influence on the gene named DPYSL5.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"DPYSL5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene named REG3A?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"REG3A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that have a relationship with upregulating the \"WDR1\" gene.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"WDR1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are known to upregulate the gene named \"GLYATL1\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"GLYATL1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that have a gene regulatory relationship with the gene RNF212 where they upregulate this gene?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"RNF212\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are known to upregulate the gene named SH3BP2 according to the database?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"SH3BP2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene LCNL1?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"LCNL1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the upregulation of the gene named MKL1?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"MKL1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene named \"BACH2\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"BACH2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that have an upregulating effect on the gene called FBXO33.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"FBXO33\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate the gene known as FAM114A1?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"FAM114A1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that are linked to the upregulation of any gene on chromosome 17?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases connected to upregulating the gene called ADCK3.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"ADCK3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are linked to the upregulation of the gene CARD6?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"CARD6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are identified as upregulating the gene named BRWD3?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"BRWD3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate genes located on chromosome 17?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that have an upregulatory effect on the gene called ITGB6.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"ITGB6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are associated with the upregulation of the gene named \"PLA2G16\"?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"PLA2G16\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that upregulate genes located on chromosome 19?", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{chromosome: \"19\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are known to upregulate the gene named PPP1R16B?  ", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"PPP1R16B\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that are known to upregulate the CH25H gene.", "output": "MATCH (d:Disease)-[:UPREGULATES_DuG]->(:Gene{name: \"CH25H\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomies that express genes situated on chromosome 21 and provide their names.", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"21\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomies where the gene \"ABCG8\" is expressed?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"ABCG8\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names are given to the anatomy entities that express genes on chromosome 4?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"4\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify anatomies that show gene expression on chromosome 15 and provide their names?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"15\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that express the gene named \"GIF\"?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"GIF\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical names correspond to those expressing genes situated on chromosome number 5?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"5\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy names that show expression of the PPP5C gene?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"PPP5C\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy entities that demonstrate expression for the gene CD79A?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"CD79A\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical names are expressing genes on chromosome 2 according to the specified relationship?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of anatomies that have an expression relationship with genes on chromosome 12.", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"12\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy entities that express a gene specifically found on chromosome 3?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical names correspond to entities expressing genes on chromosome 9?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"9\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy names where the gene KRTAP10-9 is expressed?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"KRTAP10-9\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the names of anatomical components that are expressed by the ATP5J2 gene.", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"ATP5J2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical components that have a relationship with the expression of the gene titled \"BNIP3L\"?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"BNIP3L\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names correspond to expressions linked to genes located on chromosome 6?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"6\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each anatomy that expresses the \"KRTAP5-2\" gene?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"KRTAP5-2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy names that express any gene found on chromosome 17?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"17\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names are linked to the expression of genes residing on the fifth chromosome?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"5\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that express the gene PMAIP1?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"PMAIP1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that express the gene FGFR1OP?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"FGFR1OP\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical elements that express the gene with the name RRBP1.", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"RRBP1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomies are associated with the expression of the gene \"VAT1L\"?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"VAT1L\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of anatomical names that show expression of genes on chromosome 14?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{chromosome: \"14\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that express the gene FABP5?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"FABP5\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomic structures that express the gene named CALR?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"CALR\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy parts that express the gene KRTAP10-4?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"KRTAP10-4\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy parts that express the gene named RNFT1?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"RNFT1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical structures that express the gene named \"OSBP2\"?", "output": "MATCH (a:Anatomy)-[:EXPRESSES_AeG]->(:Gene{name: \"OSBP2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the identifier \"DOID:1793\"?", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the identifier \"DOID:11612\"?", "output": "MATCH (:Disease{identifier: \"DOID:11612\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the identifier \"DOID:0050742\"?", "output": "MATCH (:Disease{identifier: \"DOID:0050742\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease \"nicotine dependence\"?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease known as nicotine dependence?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the identifier \"DOID:8778\"?", "output": "MATCH (:Disease{identifier: \"DOID:8778\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease nicotine dependence?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease with the identifier DOID:11612?", "output": "MATCH (:Disease{identifier: \"DOID:11612\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes upregulated by the disease known as nicotine dependence?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:UPREGULATES_DuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene ZNF45?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"ZNF45\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that upregulate the gene named PSMB10?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"PSMB10\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that upregulate the gene named \"KLHL21\"?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"KLHL21\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene named \"CXCL8\"?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CXCL8\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all compounds that cause the upregulation of the gene called \"MCOLN1\".", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"MCOLN1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds upregulate the gene with the name CCND3, and what are their names?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CCND3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds are involved in upregulating the gene called ST6GALNAC2, and what are their names?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"ST6GALNAC2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene HMGA2?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"HMGA2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds that upregulate the gene with the name C2CD2L.", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"C2CD2L\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene named CNOT4?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CNOT4\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each compound that upregulates the gene named METTL18?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"METTL18\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that upregulate the gene named \"TMEM110\"?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"TMEM110\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that upregulate the ARID4B gene?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"ARID4B\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene identified as CWC25?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CWC25\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that increase the expression of the gene named ICAM3?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"ICAM3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene POLE3?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"POLE3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to upregulate the gene named CHN1, and what are their names?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CHN1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that influence genes on chromosome 17 through upregulation?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the IER5 gene?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"IER5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have a relationship that upregulates the gene with the name \"SSBP2\"?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"SSBP2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds are identified as upregulating the gene with the name PLSCR1?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"PLSCR1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate the gene CDK6?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CDK6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to upregulate the gene named PSME2?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"PSME2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds that cause the upregulation of the gene with the name SLC35A1.", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"SLC35A1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to upregulate the gene named PIK3CA according to the database?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"PIK3CA\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that upregulate the gene TRAPPC6A?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"TRAPPC6A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to upregulate the gene named \"HOXA5\"?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"HOXA5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all compounds that have a regulatory role in upregulating the gene with the name \"CTNND1\".", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{name: \"CTNND1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that upregulate genes located on the X chromosome?", "output": "MATCH (d:Compound)-[:UPREGULATES_CuG]->(:Gene{chromosome: \"X\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of gene names that are positively regulated by the compound with the identifier code \"DB00446\"?", "output": "MATCH (:Compound{identifier: \"DB00446\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00432\"?", "output": "MATCH (:Compound{identifier: \"DB00432\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB01064\"?", "output": "MATCH (:Compound{identifier: \"DB01064\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00755\"?", "output": "MATCH (:Compound{identifier: \"DB00755\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00305\"?", "output": "MATCH (:Compound{identifier: \"DB00305\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB01165\"?", "output": "MATCH (:Compound{identifier: \"DB01165\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with identifier \"DB00322\"?", "output": "MATCH (:Compound{identifier: \"DB00322\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00300\"?", "output": "MATCH (:Compound{identifier: \"DB00300\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00621\"?", "output": "MATCH (:Compound{identifier: \"DB00621\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00732\"?", "output": "MATCH (:Compound{identifier: \"DB00732\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier \"DB00345\"?", "output": "MATCH (:Compound{identifier: \"DB00345\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes upregulated by the compound with the identifier \"DB00960\"?", "output": "MATCH (:Compound{identifier: \"DB00960\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are upregulated by the compound with the identifier \"DB00130\"?", "output": "MATCH (:Compound{identifier: \"DB00130\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that the compound with identifier \"DB01146\" upregulates?", "output": "MATCH (:Compound{identifier: \"DB01146\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with identifier DB00322?", "output": "MATCH (:Compound{identifier: \"DB00322\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier DB00755?", "output": "MATCH (:Compound{identifier: \"DB00755\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the compound with identifier DB00530 upregulates?", "output": "MATCH (:Compound{identifier: \"DB00530\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}]