[{"instruction": "Convert the following natural language into Cypher query.", "input": "Which `Compound` node is described by having an InChI value of \"InChI=1S/C24H34O4/c1-14-12-18-19(22(4)9-6-17(27)13-21(14)22)7-10-23(5)20(18)8-11-24(23,15(2)25)28-16(3)26/h13-14,18-20H,6-12H2,1-5H3/t14-,18+,19-,20-,22+,23-,24-/m0/s1\" if it also either has the specific InChIKey \"InChIKey=PSGAAPLEWMOORI-PEINSRQWSA-N\" or a URL that is not \"http://www.drugbank.ca/drugs/DB00603\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C24H34O4/c1-14-12-18-19(22(4)9-6-17(27)13-21(14)22)7-10-23(5)20(18)8-11-24(23,15(2)25)28-16(3)26/h13-14,18-20H,6-12H2,1-5H3/t14-,18+,19-,20-,22+,23-,24-/m0/s1\" AND (n.inchikey = \"InChIKey=PSGAAPLEWMOORI-PEINSRQWSA-N\" OR NOT n.url = \"http://www.drugbank.ca/drugs/DB00603\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the genes with a CC0 1.0 license that are either on chromosome 19 or not named LSM7?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.chromosome = \"19\" OR NOT n.name = \"LSM7\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find compounds that are licensed under \"CC BY-NC 4.0\" and either have the InChI key \"InChI=1S/C18H19NOS/c1-19-12-11-17(18-10-5-13-21-18)20-16-9-4-7-14-6-2-3-8-15(14)16/h2-10,13,17,19H,11-12H2,1H3/t17-/m0/s1\" or do not link to \"http://www.drugbank.ca/drugs/DB00476\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchi = \"InChI=1S/C18H19NOS/c1-19-12-11-17(18-10-5-13-21-18)20-16-9-4-7-14-6-2-3-8-15(14)16/h2-10,13,17,19H,11-12H2,1H3/t17-/m0/s1\" OR NOT n.url = \"http://www.drugbank.ca/drugs/DB00476\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifier of each CellularComponent node and check if its URL matches \"http://purl.obolibrary.org/obo/GO_0032045\" to return \"Yes\" or \"No\"?", "output": "MATCH (n:CellularComponent) RETURN n.identifier, CASE WHEN n.url = \"http://purl.obolibrary.org/obo/GO_0032045\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the URL for each node with the 'Anatomy' label, and indicate if the license is \"CC BY 3.0\".", "output": "MATCH (n:Anatomy) RETURN n.url, CASE WHEN n.license = \"CC BY 3.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URLs for each compound node and check if their license is \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound) RETURN n.url, CASE WHEN n.license = \"CC BY-NC 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For pharmacologic classes, retrieve each license and determine if a particular class is named \"Dihydrofolate Reductase Inhibitors,\" providing a 'Yes' or 'No' result.", "output": "MATCH (n:PharmacologicClass) RETURN n.license, CASE WHEN n.name = \"Dihydrofolate Reductase Inhibitors\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the license for Pathway nodes and indicate if a Pathway's identifier is \"PC7_1543\" by returning \"Yes\" or \"No\"?", "output": "MATCH (n:Pathway) RETURN n.license, CASE WHEN n.identifier = \"PC7_1543\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URL of each CellularComponent and know if its source is Gene Ontology, marked as \"Yes\" or \"No\"?", "output": "MATCH (n:CellularComponent) RETURN n.url, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you extract the identifier for each Pathway node and specify if the source is WikiPathways?", "output": "MATCH (n:Pathway) RETURN n.identifier, CASE WHEN n.source = \"WikiPathways\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the URLs of SideEffect nodes along with a yes or no indicating whether each node's identifier equals \"C0025322\"?", "output": "MATCH (n:SideEffect) RETURN n.url, CASE WHEN n.identifier = \"C0025322\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the descriptions of genes and specify if the URL matches \"http://identifiers.org/ncbigene/51667\" with a 'Yes' or 'No'.", "output": "MATCH (n:Gene) RETURN n.description, CASE WHEN n.url = \"http://identifiers.org/ncbigene/51667\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we get the source for nodes labeled as MolecularFunction and verify if their name equals \"malonyltransferase activity\"?", "output": "MATCH (n:MolecularFunction) RETURN n.source, CASE WHEN n.name = \"malonyltransferase activity\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the URLs of all Pathway nodes and indicate whether their license is \"CC BY 4.0\"?", "output": "MATCH (n:Pathway) RETURN n.url, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the URLs for each BiologicalProcess node and indicate whether their license is \"CC BY 4.0\"?", "output": "MATCH (n:BiologicalProcess) RETURN n.url, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do I find out if the URL of each 'SideEffect' node matches \"http://identifiers.org/umls/C0221743\" while also retrieving their sources?", "output": "MATCH (n:SideEffect) RETURN n.source, CASE WHEN n.url = \"http://identifiers.org/umls/C0221743\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the source and check if the identifier of Symptom nodes is \"D017109\"?", "output": "MATCH (n:Symptom) RETURN n.source, CASE WHEN n.identifier = \"D017109\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What query do I use to return the license of each gene and check if its description is \"interphotoreceptor matrix proteoglycan 1\"?", "output": "MATCH (n:Gene) RETURN n.license, CASE WHEN n.description = \"interphotoreceptor matrix proteoglycan 1\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of genes and determine if their description matches \"outer dense fiber of sperm tails 4\".", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.description = \"outer dense fiber of sperm tails 4\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the source of each Pathway, and determine if its identifier matches \"PC7_3060\".", "output": "MATCH (n:Pathway) RETURN n.source, CASE WHEN n.identifier = \"PC7_3060\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all genes by name and determine if their description is \"sodium channel, voltage gated, type X alpha subunit\".", "output": "MATCH (n:Gene) RETURN n.name, CASE WHEN n.description = \"sodium channel, voltage gated, type X alpha subunit\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve gene identifiers and a check for whether each gene's description is \"1-acylglycerol-3-phosphate O-acyltransferase 2,\" with a \"Yes\" or \"No\" response?", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.description = \"1-acylglycerol-3-phosphate O-acyltransferase 2\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the source of each CellularComponent node and confirm if its URL is exactly \"http://purl.obolibrary.org/obo/GO_1990590\".", "output": "MATCH (n:CellularComponent) RETURN n.source, CASE WHEN n.url = \"http://purl.obolibrary.org/obo/GO_1990590\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the sources of all CellularComponent nodes and verify if each source has a CC BY 4.0 license?", "output": "MATCH (n:CellularComponent) RETURN n.source, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the BTO ID for anatomy nodes and check whether their MeSH ID equals \"D004848\"?", "output": "MATCH (n:Anatomy) RETURN n.bto_id, CASE WHEN n.mesh_id = \"D004848\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the license for each cellular component and determine if any is specifically named \"calcium channel complex,\" indicating this with a \"Yes\" or \"No\"?", "output": "MATCH (n:CellularComponent) RETURN n.license, CASE WHEN n.name = \"calcium channel complex\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URL of every molecular function node and confirm if each one is sourced from \"Gene Ontology\"?", "output": "MATCH (n:MolecularFunction) RETURN n.url, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the license of each CellularComponent and check if the identifier equals \"GO:0070022\"?", "output": "MATCH (n:CellularComponent) RETURN n.license, CASE WHEN n.identifier = \"GO:0070022\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the licenses of Pathway nodes and determine if their source is \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) RETURN n.license, CASE WHEN n.source = \"Reactome via Pathway Commons\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find out the source of each 'MolecularFunction' node and check if its URL corresponds to \"http://purl.obolibrary.org/obo/GO_0016151\"?", "output": "MATCH (n:MolecularFunction) RETURN n.source, CASE WHEN n.url = \"http://purl.obolibrary.org/obo/GO_0016151\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine if an anatomy node's name is \"brain\" and extract its identifier at the same time?", "output": "MATCH (n:Anatomy) RETURN n.identifier, CASE WHEN n.name = \"brain\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out if each anatomy node has a BTO ID of \"BTO:0000045\", and what is their source?", "output": "MATCH (n:Anatomy) RETURN n.source, CASE WHEN n.bto_id = \"BTO:0000045\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the URLs of cellular components and determine if their license is labeled as \"CC BY 4.0\".", "output": "MATCH (n:CellularComponent) RETURN n.url, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each cellular component, can you return its name and indicate whether the license is CC BY 4.0?", "output": "MATCH (n:CellularComponent) RETURN n.name, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve a list of cellular component identifiers and specify 'Yes' if the component name is 'CBM complex' and 'No' otherwise?", "output": "MATCH (n:CellularComponent) RETURN n.identifier, CASE WHEN n.name = \"CBM complex\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you list the license of each gene and verify if their URL equals \"http://identifiers.org/ncbigene/26301\"?", "output": "MATCH (n:Gene) RETURN n.license, CASE WHEN n.url = \"http://identifiers.org/ncbigene/26301\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of pharmacologic classes and check if their license is \"CC BY 4.0\".", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out the identifiers for each Pathway and check if their source matches \"Reactome via Pathway Commons\"?", "output": "MATCH (n:Pathway) RETURN n.identifier, CASE WHEN n.source = \"Reactome via Pathway Commons\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine the license and check if the source is Gene Ontology for each cellular component?", "output": "MATCH (n:CellularComponent) RETURN n.license, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the source of each Pathway and specify if the license corresponds to CC BY 4.0.", "output": "MATCH (n:Pathway) RETURN n.source, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you show the names of all 'MolecularFunction' nodes and specify if their identifier equals \"GO:0008374\"?", "output": "MATCH (n:MolecularFunction) RETURN n.name, CASE WHEN n.identifier = \"GO:0008374\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine the chromosome of each gene and check if its description reads \"oviductal glycoprotein 1, 120kDa\"?", "output": "MATCH (n:Gene) RETURN n.chromosome, CASE WHEN n.description = \"oviductal glycoprotein 1, 120kDa\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the URLs of compound nodes along with an indication of whether their name is \"Estradiol valerate/Dienogest\" or not?", "output": "MATCH (n:Compound) RETURN n.url, CASE WHEN n.name = \"Estradiol valerate/Dienogest\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of each BiologicalProcess node, and does it have a license of \"CC BY 4.0\"?", "output": "MATCH (n:BiologicalProcess) RETURN n.identifier, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the source information for nodes labeled as Anatomy, and indicate if their identifier matches \"UBERON:0001264\"?", "output": "MATCH (n:Anatomy) RETURN n.source, CASE WHEN n.identifier = \"UBERON:0001264\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the license and a confirmation of whether the URL of each symptom node is \"http://identifiers.org/mesh/D054058\".", "output": "MATCH (n:Symptom) RETURN n.license, CASE WHEN n.url = \"http://identifiers.org/mesh/D054058\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can you retrieve both the license of compounds and check if their URL equals \"http://www.drugbank.ca/drugs/DB08820\"?", "output": "MATCH (n:Compound) RETURN n.license, CASE WHEN n.url = \"http://www.drugbank.ca/drugs/DB08820\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I identify the names of pharmacologic classes and determine if their license is 'CC BY 4.0'?", "output": "MATCH (n:PharmacologicClass) RETURN n.name, CASE WHEN n.license = \"CC BY 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the source of each molecular function and verify whether its name is \"fatty-acyl-CoA synthase activity\" or not.", "output": "MATCH (n:MolecularFunction) RETURN n.source, CASE WHEN n.name = \"fatty-acyl-CoA synthase activity\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve each gene's description along with a 'Yes' or 'No' indicating whether its URL matches \"http://identifiers.org/ncbigene/3670\"?", "output": "MATCH (n:Gene) RETURN n.description, CASE WHEN n.url = \"http://identifiers.org/ncbigene/3670\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the URL of every compound and determine whether the identifier matches \"DB04890\", answering with \"Yes\" or \"No\".", "output": "MATCH (n:Compound) RETURN n.url, CASE WHEN n.identifier = \"DB04890\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of each pharmacologic class and check if its class type is defined as \"Physiologic Effect\".", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier, CASE WHEN n.class_type = \"Physiologic Effect\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions have identifiers and how can I verify if their names match \"transcription factor activity, RNA polymerase II basal transcription factor binding\"?", "output": "MATCH (n:MolecularFunction) RETURN n.identifier, CASE WHEN n.name = \"transcription factor activity, RNA polymerase II basal transcription factor binding\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the license of each 'Gene' node, and does the source for each node identify as \"Entrez Gene\"?", "output": "MATCH (n:Gene) RETURN n.license, CASE WHEN n.source = \"Entrez Gene\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for each gene and check if its name matches \"SLC18A3\".", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.name = \"SLC18A3\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of genes and check if their URLs are \"http://identifiers.org/ncbigene/5596\".", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.url = \"http://identifiers.org/ncbigene/5596\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get each symptom's identifier along with a \"Yes\" or \"No\" indicating if the symptom's URL matches \"http://identifiers.org/mesh/D051474\"?", "output": "MATCH (n:Symptom) RETURN n.identifier, CASE WHEN n.url = \"http://identifiers.org/mesh/D051474\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of all anatomy nodes, indicating whether their identifier matches \"UBERON:0001687\"?", "output": "MATCH (n:Anatomy) RETURN n.name, CASE WHEN n.identifier = \"UBERON:0001687\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list each compound's name and indicate whether its license is \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound) RETURN n.name, CASE WHEN n.license = \"CC BY-NC 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we output compound names and identify those with the specific identifier \"DB08941\" using \"Yes\" or \"No\"?", "output": "MATCH (n:Compound) RETURN n.name, CASE WHEN n.identifier = \"DB08941\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the license of each symptom and indicate whether its name is \"Tremor\" by returning \"Yes\" or \"No\"?", "output": "MATCH (n:Symptom) RETURN n.license, CASE WHEN n.name = \"Tremor\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the license information for each Pathway while checking if the identifier \"PC7_3326\" is present?", "output": "MATCH (n:Pathway) RETURN n.license, CASE WHEN n.identifier = \"PC7_3326\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs of genes and check if their license type is CC0 1.0 or not?", "output": "MATCH (n:Gene) RETURN n.url, CASE WHEN n.license = \"CC0 1.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the sources of BiologicalProcess nodes and tell me if their identifier matches \"GO:2000686\"?", "output": "MATCH (n:BiologicalProcess) RETURN n.source, CASE WHEN n.identifier = \"GO:2000686\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each pathway, what is its identifier, and does it have the name \"Hypoxia-mediated EMT and Stemness\"?", "output": "MATCH (n:Pathway) RETURN n.identifier, CASE WHEN n.name = \"Hypoxia-mediated EMT and Stemness\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you determine if nodes labeled \"BiologicalProcess\" possess the URL \"http://purl.obolibrary.org/obo/GO_0071599,\" and what are their respective licenses?", "output": "MATCH (n:BiologicalProcess) RETURN n.license, CASE WHEN n.url = \"http://purl.obolibrary.org/obo/GO_0071599\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you show the URL of each pathway along with a yes or no depending on whether its identifier is \"PC7_7767\"?", "output": "MATCH (n:Pathway) RETURN n.url, CASE WHEN n.identifier = \"PC7_7767\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of all nodes labeled as Gene and indicate whether their name is \"OAF\"?", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.name = \"OAF\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which licenses belong to Molecular Function nodes, and do any of these nodes have an identifier equal to \"GO:0015277\"?", "output": "MATCH (n:MolecularFunction) RETURN n.license, CASE WHEN n.identifier = \"GO:0015277\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the InChIKey for each compound node, and does its URL match \"http://www.drugbank.ca/drugs/DB01324\"?", "output": "MATCH (n:Compound) RETURN n.inchikey, CASE WHEN n.url = \"http://www.drugbank.ca/drugs/DB01324\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URLs of genes and determine if each belongs to chromosome 1?", "output": "MATCH (n:Gene) RETURN n.url, CASE WHEN n.chromosome = \"1\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine the chromosome of each gene and verify if it is sourced from \"Entrez Gene\"?", "output": "MATCH (n:Gene) RETURN n.chromosome, CASE WHEN n.source = \"Entrez Gene\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the URL of each gene and indicate if it is situated on chromosome 6?", "output": "MATCH (n:Gene) RETURN n.url, CASE WHEN n.chromosome = \"6\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify all molecular functions and determine if their name is specifically \"peptide-methionine (R)-S-oxide reductase activity\"?", "output": "MATCH (n:MolecularFunction) RETURN n.identifier, CASE WHEN n.name = \"peptide-methionine (R)-S-oxide reductase activity\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list the identifiers of genes along with a yes/no response indicating if each gene's source is \"Entrez Gene\"?", "output": "MATCH (n:Gene) RETURN n.identifier, CASE WHEN n.source = \"Entrez Gene\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes have the identifier of their pathway along with an indication if their name is \"Signaling by Activin\"?", "output": "MATCH (n:Pathway) RETURN n.identifier, CASE WHEN n.name = \"Signaling by Activin\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers for each pathway and indicate whether their name is \"Signaling by FGFR in disease\"?", "output": "MATCH (n:Pathway) RETURN n.identifier, CASE WHEN n.name = \"Signaling by FGFR in disease\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For every Pathway node, what is the source and whether it is under the \"CC0 1.0\" license?", "output": "MATCH (n:Pathway) RETURN n.source, CASE WHEN n.license = \"CC0 1.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the InChI numbers for the compound nodes, and is the compound's identifier equal to \"DB00630\"?", "output": "MATCH (n:Compound) RETURN n.inchi, CASE WHEN n.identifier = \"DB00630\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the InChiKey of compounds and determine if their InChI is equal to \"InChI=1S/C31H36N2O11/c1-14(2)7-8-16-13-17(9-11-19(16)34)27(37)33-21-22(35)18-10-12-20(15(3)24(18)42-28(21)38)41-29-23(36)25(43-30(32)39)26(40-6)31(4,5)44-29/h7,9-13,23,25-26,29,34-36H,8H2,1-6H3,(H2,32,39)(H,33,37)/t23-,25+,26-,29-/m1/s1\"?", "output": "MATCH (n:Compound) RETURN n.inchikey, CASE WHEN n.inchi = \"InChI=1S/C31H36N2O11/c1-14(2)7-8-16-13-17(9-11-19(16)34)27(37)33-21-22(35)18-10-12-20(15(3)24(18)42-28(21)38)41-29-23(36)25(43-30(32)39)26(40-6)31(4,5)44-29/h7,9-13,23,25-26,29,34-36H,8H2,1-6H3,(H2,32,39)(H,33,37)/t23-,25+,26-,29-/m1/s1\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Please show me the names of all compounds and determine if each one\u2019s URL is \"http://www.drugbank.ca/drugs/DB08871\", marking them as \"Yes\" or \"No\".", "output": "MATCH (n:Compound) RETURN n.name, CASE WHEN n.url = \"http://www.drugbank.ca/drugs/DB08871\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes and specify if they are licensed under \"CC0 1.0\".", "output": "MATCH (n:Gene) RETURN n.name, CASE WHEN n.license = \"CC0 1.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine the names of compounds along with their status of having a CC BY-NC 4.0 license?", "output": "MATCH (n:Compound) RETURN n.name, CASE WHEN n.license = \"CC BY-NC 4.0\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs of entities classified as MolecularFunction and determine whether their source is Gene Ontology?", "output": "MATCH (n:MolecularFunction) RETURN n.url, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out the URL of each compound along with a confirmation if its identifier is DB00308?", "output": "MATCH (n:Compound) RETURN n.url, CASE WHEN n.identifier = \"DB00308\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out the identifiers of pharmacologic classes and check if their source is labeled as \"FDA via DrugCentral\"?", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier, CASE WHEN n.source = \"FDA via DrugCentral\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For every biological process, can you provide its URL and confirm if its source is Gene Ontology?", "output": "MATCH (n:BiologicalProcess) RETURN n.url, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine the license of molecular function nodes and verify if they originate from Gene Ontology?", "output": "MATCH (n:MolecularFunction) RETURN n.license, CASE WHEN n.source = \"Gene Ontology\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list the sources of 'MolecularFunction' nodes along with a confirmation of whether their URL matches \"http://purl.obolibrary.org/obo/GO_0004992\"?", "output": "MATCH (n:MolecularFunction) RETURN n.source, CASE WHEN n.url = \"http://purl.obolibrary.org/obo/GO_0004992\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we determine if a compound's source is DrugBank and retrieve its InChIKey?", "output": "MATCH (n:Compound) RETURN n.inchikey, CASE WHEN n.source = \"DrugBank\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do the URLs of anatomy nodes compare in terms of being sourced from Uberon or not?", "output": "MATCH (n:Anatomy) RETURN n.url, CASE WHEN n.source = \"Uberon\" THEN \"Yes\" ELSE \"No\" END"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list the descriptions of genes and determine if each gene's source is \"Entrez Gene\"?", "output": "MATCH (n:Gene) RETURN n.description, CASE WHEN n.source = \"Entrez Gene\" THEN \"Yes\" ELSE \"No\" END"}]