[{"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths exist that directly relate a gene node to a disease node?", "output": "MATCH path = (n:Gene)-[*1]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all paths that consist of three relationships between MolecularFunction nodes and Symptom nodes.", "output": "MATCH path = (n:MolecularFunction)-[*3]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the paths of length three that link 'Gene' entities to 'Compound' entities in our graph?", "output": "MATCH path = (n:Gene)-[*3]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths connect any node labeled as \"MolecularFunction\" to any node labeled as \"BiologicalProcess\" through a single relationship?", "output": "MATCH path = (n:MolecularFunction)-[*1]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths in the database take three steps to connect anatomical elements with gene elements?", "output": "MATCH path = (n:Anatomy)-[*3]-(m:Gene) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you explain how the query retrieves all paths of length one that link a BiologicalProcess node to a CellularComponent node?", "output": "MATCH path = (n:BiologicalProcess)-[*1]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are any \"Anatomy\" nodes linked to \"Disease\" nodes via precisely three steps, and can you return those paths?", "output": "MATCH path = (n:Anatomy)-[*3]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths of exactly two relationships starting from nodes labeled as 'Compound' and ending at nodes labeled as 'CellularComponent'?", "output": "MATCH path = (n:Compound)-[*2]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths consisting of three relationships that link nodes classified under 'Anatomy' with those labeled as 'SideEffect'?", "output": "MATCH path = (n:Anatomy)-[*3]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all anatomy node names that have some form of relationship with the pathway node labeled with \"PC7_5558.\"", "output": "MATCH path = (n:Pathway{identifier: \"PC7_5558\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all gene nodes that are linked, through any relationship, to the pharmacologic class node with the identifier \"N0000009801\".", "output": "MATCH path = (n:PharmacologicClass{identifier: \"N0000009801\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy nodes can be found in relation to the specific pathway named \"Synthesis of 5-eicosatetraenoic acids\"?", "output": "MATCH path = (n:Pathway{name: \"Synthesis of 5-eicosatetraenoic acids\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy nodes that have any connection to the pathway with the title \"APOBEC3G mediated resistance to HIV-1 infection.\"", "output": "MATCH path = (n:Pathway{name: \"APOBEC3G mediated resistance to HIV-1 infection\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all anatomy nodes that are connected via any path to the pathway with the identifier \"PC7_4099\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_4099\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy nodes have a relationship with the \"Oxytocin signaling\" pathway, and what are their names?", "output": "MATCH path = (n:Pathway{name: \"Oxytocin signaling\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy nodes that are connected to the pathway with the identifier \"WP2889_r79753\"?", "output": "MATCH path = (n:Pathway{identifier: \"WP2889_r79753\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy nodes that are connected to the pathway identified as \"PC7_1537\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_1537\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of anatomy nodes that have any form of connection with the molecular function node marked as \"GO:0016309\".", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0016309\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of pharmacologic classes that have a relationship with the anatomy node identified as \"UBERON:0001295\".", "output": "MATCH path = (n:Anatomy{identifier: \"UBERON:0001295\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy nodes are related to the pathway called \"Ca activated K+ channels\" via any type of relationship?", "output": "MATCH path = (n:Pathway{name: \"Ca activated K+ channels\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names can be found by traversing from the pathway node \"PC7_1561\" through any relationships?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_1561\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names are linked to the specific anatomy node labeled \"UBERON:0002367\" through any connections?", "output": "MATCH path = (n:Anatomy{identifier: \"UBERON:0002367\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of biological processes are related through connections to the pathway node with identifier \"PC7_6514\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_6514\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy nodes that are connected in some way to the activity involving potassium-transporting ATPase?", "output": "MATCH path = (n:MolecularFunction{name: \"potassium-transporting ATPase activity\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy-related nodes that have some form of connection with the molecular function \"enone reductase activity\"?", "output": "MATCH path = (n:MolecularFunction{name: \"enone reductase activity\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy nodes associated with the \"ER-Phagosome pathway\"?", "output": "MATCH path = (n:Pathway{name: \"ER-Phagosome pathway\"})-[*]-(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What biological process names can be found in paths associated with the \"Activation of APC/C and APC/C:Cdc20 mediated degradation of mitotic proteins\" pathway?", "output": "MATCH path = (n:Pathway{name: \"Activation of APC/C and APC/C:Cdc20 mediated degradation of mitotic proteins\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the symptom names that are connected, via any type of relationship, with the \"mitogen-activated protein kinase p38 binding\" molecular function.", "output": "MATCH path = (n:MolecularFunction{name: \"mitogen-activated protein kinase p38 binding\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all cellular components connected to the pathway with the identifier \"PC7_6520\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_6520\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pharmacologic classes associated through any relationship with the specific anatomy node identified by \"UBERON:0002365\"?", "output": "MATCH path = (n:Anatomy{identifier: \"UBERON:0002365\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound names can be found in the network associated with the pathway labeled \"Metabolism of folate and pterines\"?", "output": "MATCH path = (n:Pathway{name: \"Metabolism of folate and pterines\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pharmacologic classes associated with the \"Transcriptional activation of cell cycle inhibitor p21\" pathway?", "output": "MATCH path = (n:Pathway{name: \"Transcriptional activation of cell cycle inhibitor p21\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are connected to the pathway with the identifier \"PC7_3277\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_3277\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of diseases linked, through any pathway, to the anatomy node with the identifier \"UBERON:0001479\"?", "output": "MATCH path = (n:Anatomy{identifier: \"UBERON:0001479\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of pathways that share any type of relationship with the \"beta-galactosidase activity\" molecular function.", "output": "MATCH path = (n:MolecularFunction{name: \"beta-galactosidase activity\"})-[*]-(m:Pathway) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compound names are returned when looking for connections with the pathway marked by the identifier \"PC7_7707\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_7707\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms associated with the \"Aurora B signaling\" pathway?", "output": "MATCH path = (n:Pathway{name: \"Aurora B signaling\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic classes are linked through any kind of relationship to the pathway with identifier \"PC7_7729\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_7729\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the gene names linked to the anatomy node with the identifier \"UBERON:0002382\"?", "output": "MATCH path = (n:Anatomy{identifier: \"UBERON:0002382\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of pharmacologic classes that are related, through any type or number of links, to the molecular function with the identifier \"GO:1901611\".", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:1901611\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the cellular component names related in any way to the molecular function node with identifier \"GO:0030742\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0030742\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of biological processes that have a connection with the 'Viral RNP Complexes in the Host Cell Nucleus' pathway.", "output": "MATCH path = (n:Pathway{name: \"Viral RNP Complexes in the Host Cell Nucleus\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are connected in any path to the pathway identified as \"PC7_2117\"?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_2117\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are related to the \"Loss of Nlp from mitotic centrosomes\" pathway via any relationships?", "output": "MATCH path = (n:Pathway{name: \"Loss of Nlp from mitotic centrosomes\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are connected to the biological process \"phosphatidylinositol dephosphorylation\" by any path in the graph?", "output": "MATCH path = (n:BiologicalProcess{name: \"phosphatidylinositol dephosphorylation\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound names are linked to the pathway 'Thrombin signalling through proteinase activated receptors (PARs)'?", "output": "MATCH path = (n:Pathway{name: \"Thrombin signalling through proteinase activated receptors (PARs)\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all compounds that are connected in any way to the gene named \"LZTS3\" in the database?", "output": "MATCH path = (n:Gene{name: \"LZTS3\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of biological processes that have a relationship with the pathway identified by \"PC7_4781\".", "output": "MATCH path = (n:Pathway{identifier: \"PC7_4781\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of gene nodes associated with the molecular function labeled with the identifier \"GO:0004816\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0004816\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms connected to the \"Nucleotide-like (purinergic) receptors\" pathway through any kind of relationship?", "output": "MATCH path = (n:Pathway{name: \"Nucleotide-like (purinergic) receptors\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of biological processes that have a relationship with the \"IL2 signaling events mediated by STAT5\" pathway.", "output": "MATCH path = (n:Pathway{name: \"IL2 signaling events mediated by STAT5\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of symptoms that are connected to the molecular function \"chondroitin 6-sulfotransferase activity\" in any way?", "output": "MATCH path = (n:MolecularFunction{name: \"chondroitin 6-sulfotransferase activity\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names can we obtain when traversing any relationships starting from the pharmacologic class with the name \"Estradiol\"?", "output": "MATCH path = (n:PharmacologicClass{name: \"Estradiol\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms connected to the gene named \"GPX3\" in the database?", "output": "MATCH path = (n:Gene{name: \"GPX3\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene names that have any form of connection with the molecular function node labeled \"GO:1902271\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:1902271\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of Cellular Components that have any type of relationship with the \"FGFR2c ligand binding and activation\" pathway.", "output": "MATCH path = (n:Pathway{name: \"FGFR2c ligand binding and activation\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of diseases that have a relationship with any node linked to the pharmacologic class identified by \"N0000166743\"?", "output": "MATCH path = (n:PharmacologicClass{identifier: \"N0000166743\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components connected to the \"Mitotic Metaphase/Anaphase Transition\" pathway?", "output": "MATCH path = (n:Pathway{name: \"Mitotic Metaphase/Anaphase Transition\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are connected, directly or indirectly, to the pathway named \"Monoamine Transport\"?", "output": "MATCH path = (n:Pathway{name: \"Monoamine Transport\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of all cellular components that are associated, through any type of relationship, with the pathway labeled \"PC7_8675\".", "output": "MATCH path = (n:Pathway{identifier: \"PC7_8675\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components, by name, are connected to the pathway with ID \"PC7_11385\", regardless of the type or direction of the relationship?", "output": "MATCH path = (n:Pathway{identifier: \"PC7_11385\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are related to the pathway \"SUMO is proteolytically processed\" through any kind of relationship?", "output": "MATCH path = (n:Pathway{name: \"SUMO is proteolytically processed\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological process names can be found through any type or distance of connections originating from the \"DNA Repair\" pathway?", "output": "MATCH path = (n:Pathway{name: \"DNA Repair\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pathways that are connected to the molecular function identified as \"GO:0019905\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0019905\"})-[*]-(m:Pathway) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are connected to the gene named \"NLGN4Y\" in the network?", "output": "MATCH path = (n:Gene{name: \"NLGN4Y\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the disease names linked to the molecular function \"interferon binding\" by any number of connections.", "output": "MATCH path = (n:MolecularFunction{name: \"interferon binding\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are connected to the gene named 'AQP12A' in the database?", "output": "MATCH path = (n:Gene{name: \"AQP12A\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have any kind of relationship with the pathway named \"Proteasome Degradation\".", "output": "MATCH path = (n:Pathway{name: \"Proteasome Degradation\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms connected to the gene labeled \"LOC105369212\" in the network?", "output": "MATCH path = (n:Gene{name: \"LOC105369212\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names that are connected, directly or indirectly, to the gene with identifier \"221823\"?", "output": "MATCH path = (n:Gene{identifier: \"221823\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the BiologicalProcesses connected to the MolecularFunction with the identifier \"GO:0035939\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0035939\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names can be found by tracing any path to the biological process with the identifier \"GO:0009313\"?", "output": "MATCH path = (n:BiologicalProcess{identifier: \"GO:0009313\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names that have any type of relationship with the \"sense organ\" node in the anatomy category?", "output": "MATCH path = (n:Anatomy{name: \"sense organ\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class names are linked through any type or number of relationships to the molecular function with the identifier \"GO:0016661\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0016661\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms linked through any number of relationships to the gene with identifier \"8708\"?", "output": "MATCH path = (n:Gene{identifier: \"8708\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds connected to the biological process named \"tolerance induction to lipopolysaccharide\" within the graph?", "output": "MATCH path = (n:BiologicalProcess{name: \"tolerance induction to lipopolysaccharide\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of all cellular components connected to the compound with the identifier \"DB00573\"?", "output": "MATCH path = (n:Compound{identifier: \"DB00573\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names are related to the molecular function \"hydroxymethylglutaryl-CoA synthase activity\" through any type of connection?", "output": "MATCH path = (n:MolecularFunction{name: \"hydroxymethylglutaryl-CoA synthase activity\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are related through any relationship path to the pharmacologic class having identifier \"N0000000243\"?", "output": "MATCH path = (n:PharmacologicClass{identifier: \"N0000000243\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological processes are related, either directly or through other nodes, to the gene with the identifier \"102723547\"?", "output": "MATCH path = (n:Gene{identifier: \"102723547\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are connected through any type of relationship to the \"TGF-beta Receptor Signaling\" pathway?", "output": "MATCH path = (n:Pathway{name: \"TGF-beta Receptor Signaling\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components that are connected to the biological process known as \"sulfur compound transport\"?", "output": "MATCH path = (n:BiologicalProcess{name: \"sulfur compound transport\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular components involved in or related to the process of \"regulation of calcium ion transport into cytosol\".", "output": "MATCH path = (n:BiologicalProcess{name: \"regulation of calcium ion transport into cytosol\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are connected, directly or indirectly, to the pharmacologic class \"Platinum-containing Compounds\" in the database?", "output": "MATCH path = (n:PharmacologicClass{name: \"Platinum-containing Compounds\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of diseases that are linked through any type of relationship to the molecular function with the identifier \"GO:0016273\".", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0016273\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are connected to the gene labeled \"PIAS1\" in the database?", "output": "MATCH path = (n:Gene{name: \"PIAS1\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the biological process names connected to the gene known as \"CLCN6\".", "output": "MATCH path = (n:Gene{name: \"CLCN6\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of biological processes connected to the 'Bile salt and organic anion SLC transporters' pathway?", "output": "MATCH path = (n:Pathway{name: \"Bile salt and organic anion SLC transporters\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases, by name, are connected in any way to the gene specified by the identifier \"339834\"?", "output": "MATCH path = (n:Gene{identifier: \"339834\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components associated with the biological process named \"regulation of single-species biofilm formation in or on host organism\"?", "output": "MATCH path = (n:BiologicalProcess{name: \"regulation of single-species biofilm formation in or on host organism\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the symptoms that have some relational path with the TMEM159 gene.", "output": "MATCH path = (n:Gene{name: \"TMEM159\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components connected to the \"Activation of RAS in B cells\" pathway?", "output": "MATCH path = (n:Pathway{name: \"Activation of RAS in B cells\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that are connected by any kind of relationship to the gene labeled \"ZBED2\"?", "output": "MATCH path = (n:Gene{name: \"ZBED2\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are linked to the molecular function with the identifier \"GO:0071568\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0071568\"})-[*]-(m:Pathway) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases connected to the molecular function named \"ICAM-3 receptor activity\"?", "output": "MATCH path = (n:MolecularFunction{name: \"ICAM-3 receptor activity\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of biological processes connected to the molecular function named \"phosphatidylinositol-3,5-bisphosphate 3-phosphatase activity\"?", "output": "MATCH path = (n:MolecularFunction{name: \"phosphatidylinositol-3,5-bisphosphate 3-phosphatase activity\"})-[*]-(m:BiologicalProcess) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are interconnected with the pathway named \"Heme biosynthesis\"?", "output": "MATCH path = (n:Pathway{name: \"Heme biosynthesis\"})-[*]-(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names can be found that have some form of connection to the molecular function labeled \"type I interferon binding\"?", "output": "MATCH path = (n:MolecularFunction{name: \"type I interferon binding\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all cellular components related to the gene with identifier \"4114\" in any way?", "output": "MATCH path = (n:Gene{identifier: \"4114\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of all cellular components linked through any relationship to the biological process called ovarian follicle development.", "output": "MATCH path = (n:BiologicalProcess{name: \"ovarian follicle development\"})-[*]-(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are connected to the NFIL3 gene through any path?", "output": "MATCH path = (n:Gene{name: \"NFIL3\"})-[*]-(m:Symptom) RETURN m.name"}]