[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that regulate the gene named \"WIF1\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"WIF1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are known to regulate the gene named \"MAN2B1\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"MAN2B1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are responsible for the regulation of the gene named \"TUBA1A\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"TUBA1A\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that regulate the gene named \"IARS2\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"IARS2\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are directly regulating the gene named \"IFI44L\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"IFI44L\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that regulate STX4?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"STX4\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that regulate the gene named \"NME1\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"NME1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are involved in regulating the gene named \"DUSP14\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"DUSP14\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that regulate the gene named \"FAM86C1\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"FAM86C1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that regulate the gene labeled TMEM109?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"TMEM109\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are involved in regulating the gene with the name \"DONSON\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"DONSON\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are responsible for regulating the gene named \"EDEM1\"?", "output": "MATCH (g:Gene)-[:REGULATES_GrG]->(:Gene{name: \"EDEM1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes that form an interaction with \"USP45\".", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"USP45\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that are connected to \"KRT18\" through an interaction.", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"KRT18\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that interact with the gene named \"UBE2I\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"UBE2I\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that interact with the gene named \"PPP1R13B\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"PPP1R13B\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that interact with the gene named \"HDAC4\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"HDAC4\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that interact with the gene named MAP3K2?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"MAP3K2\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are known to interact with the gene named PELI3?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"PELI3\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes that have an interaction relationship with the gene called \"JAK3.\"", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"JAK3\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have an interaction with the gene named \"MED28\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"MED28\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that interact with the gene named \"CXCL6\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"CXCL6\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have an interaction relationship with the gene identified as \"CABLES1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"CABLES1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have an interaction relationship with \"HNRNPK.\"", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"HNRNPK\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all genes that have a relationship indicating interaction with TMED10.", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"TMED10\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes interact with the gene \"HIST1H3E\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"HIST1H3E\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that interact with the gene named \"GNG2\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"GNG2\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes interact with the gene named 'HSPA8'?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"HSPA8\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes that have an interaction with the gene whose name is NCOA6.", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"NCOA6\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the genes that interact directly with the gene named \"JAK1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"JAK1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all genes that interact with the gene named \"CCNL1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"CCNL1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that interact with the gene named \"KIAA0101\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"KIAA0101\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that have interactions with the gene named YLPM1?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"YLPM1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes interact with the gene named PPARGC1A?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"PPARGC1A\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes show interaction with the gene having the name \"PASK\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"PASK\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes interact with the gene named \"ERRFI1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"ERRFI1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are associated through an interaction with the gene \"NFATC4\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"NFATC4\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes show a direct interaction with the gene specifically named \"HSP90AA1\"? ", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"HSP90AA1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are known to interact with the gene named \"YTHDC1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"YTHDC1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene interactions involving the gene named \"CUL5\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"CUL5\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes interact with the gene named \"GNB2L1\"?", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"GNB2L1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes that have a direct interaction relationship with \"EWSR1\".", "output": "MATCH (g:Gene)-[:INTERACTS_GiG]->(:Gene{name: \"EWSR1\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of the genes associated with the pathway having the identifier \"PC7_4100\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_4100\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that are associated with the pathway whose identifier is \"PC7_5537\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_5537\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene names that take part in the VEGFR3 signaling in lymphatic endothelium pathway?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"VEGFR3 signaling in lymphatic endothelium\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that take part in the \"Urokinase-type plasminogen activator (uPA) and uPAR-mediated signaling\" pathway?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Urokinase-type plasminogen activator (uPA) and uPAR-mediated signaling\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes associated with the pathway having the identifier \"PC7_4693\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_4693\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are involved in the pathway named \"Inactivation, recovery and regulation of the phototransduction cascade\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Inactivation, recovery and regulation of the phototransduction cascade\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names correspond to those participating in the pathway with the identifier \"PC7_2525\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_2525\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names that take part in the pathway denoted by the identifier \"PC7_6149\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_6149\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are associated with the participation in the pathway called \"Presenilin action in Notch and Wnt signaling\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Presenilin action in Notch and Wnt signaling\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that participate in the pathway with the identifier \"PC7_3869\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_3869\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that participate in the pathway with the identifier \"PC7_6923\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_6923\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that participate in the pathway with the identifier \"PC7_4755\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_4755\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are involved in the pathway named \"Factors involved in megakaryocyte development and platelet production\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Factors involved in megakaryocyte development and platelet production\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that participate in the pathway with the identifier \"PC7_2621\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"PC7_2621\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes involved in the Class B/2 (Secretin family receptors) pathway?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Class B/2 (Secretin family receptors)\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that take part in the pathway related to the phototransduction cascade's inactivation, recovery, and regulation?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Inactivation, recovery and regulation of the phototransduction cascade\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that connect to the pathway designated as \"WP2889_r79753\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{identifier: \"WP2889_r79753\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are involved in the \"Ligand-gated ion channel transport\" pathway?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpPW]->(:Pathway{name: \"Ligand-gated ion channel transport\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of pathways where the \"NUP205\" gene plays a role.", "output": "MATCH (:Gene{name: \"NUP205\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathway names that involve participation from the gene named \"ZBTB2\".", "output": "MATCH (:Gene{name: \"ZBTB2\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all the pathway names that include participation from the gene called \"KIF11\"?", "output": "MATCH (:Gene{name: \"KIF11\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of the pathways that include the gene \"RHO.\"", "output": "MATCH (:Gene{name: \"RHO\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of the pathways that the 'IL17B' gene is involved in?", "output": "MATCH (:Gene{name: \"IL17B\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of pathway names associated with the ITGA5 gene through participation?", "output": "MATCH (:Gene{name: \"ITGA5\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways does the gene named ITGB3 participate in according to the database?", "output": "MATCH (:Gene{name: \"ITGB3\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathways that have WNT9B as a participating gene by name.", "output": "MATCH (:Gene{name: \"WNT9B\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and list the names of all pathways that include the participation of the gene GRB2.", "output": "MATCH (:Gene{name: \"GRB2\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of pathway names that include genes from chromosome 17?", "output": "MATCH (:Gene{chromosome: \"17\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways does the gene named \"POLR2E\" participate in according to the database?", "output": "MATCH (:Gene{name: \"POLR2E\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways do genes from chromosome 4 participate in, according to their names?", "output": "MATCH (:Gene{chromosome: \"4\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of all pathways that have participation from the gene identified as \"RAC1.\"", "output": "MATCH (:Gene{name: \"RAC1\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names are given to pathways that genes on chromosome 11 are involved in?", "output": "MATCH (:Gene{chromosome: \"11\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pathways in which the gene named \"IFNA7\" participates?", "output": "MATCH (:Gene{name: \"IFNA7\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pathways in which a gene located on chromosome 17 is involved?", "output": "MATCH (:Gene{chromosome: \"17\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of pathways that genes on chromosome 17 participate in?", "output": "MATCH (:Gene{chromosome: \"17\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways do genes on chromosome 21 participate in, and what are their names?", "output": "MATCH (:Gene{chromosome: \"21\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathway names that include participation from the HIST1H2BM gene.", "output": "MATCH (:Gene{name: \"HIST1H2BM\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathway names associated with the gene GABRA3.", "output": "MATCH (:Gene{name: \"GABRA3\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway names are linked to the gene WNT3 through participation?", "output": "MATCH (:Gene{name: \"WNT3\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of pathways linked to genes from chromosome 13.", "output": "MATCH (:Gene{chromosome: \"13\"})-[:PARTICIPATES_GpPW]->(p:Pathway) RETURN p.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes participating in the cellular component specified by identifier GO:0031965.", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0031965\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all genes that take part in the cellular component with ID \"GO:0005759\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0005759\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that participate in the cellular component with the identifier \"GO:0005732\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0005732\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are involved in the inhibitory synapse cellular component?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"inhibitory synapse\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes that are linked to the cellular component having the identifier GO:0042383.", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0042383\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that are linked to the cellular component described as \"GO:0022624\".", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0022624\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes linked to the cellular component identified as GO:0001726.", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0001726\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes are connected to the cellular component with the name inhibitory synapse via participation?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"inhibitory synapse\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of genes that are associated with the cellular component whose identifier is GO:0031464.", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0031464\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of genes that participate in the inhibitory synapse cellular component?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"inhibitory synapse\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are associated with participating in the cellular component with the identifier GO:0005759?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0005759\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes associated with the cellular component known as the mitochondrial matrix?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"mitochondrial matrix\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are part of the small nucleolar ribonucleoprotein complex?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"small nucleolar ribonucleoprotein complex\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the names of genes that participate in the cellular component designated as the mitochondrial matrix?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"mitochondrial matrix\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes take part in the cellular component whose identifier is \"GO:0032807\"?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0032807\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that participate in the mitochondrial matrix cellular component?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"mitochondrial matrix\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that take part within the cellular component referred to as the mitochondrial matrix?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{name: \"mitochondrial matrix\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are linked to the cellular component with identifier GO:0001726?", "output": "MATCH (g:Gene)-[:PARTICIPATES_GpCC]->(:CellularComponent{identifier: \"GO:0001726\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular component names that have a participation relationship with the gene PIP5K1A.", "output": "MATCH (:Gene{name: \"PIP5K1A\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components that the gene named \"SH3YL1\" is involved in?", "output": "MATCH (:Gene{name: \"SH3YL1\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are linked to the gene named AGXT2?", "output": "MATCH (:Gene{name: \"AGXT2\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names correspond to the participation of genes from chromosome 13?", "output": "MATCH (:Gene{chromosome: \"13\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components that are associated with the gene named BAIAP2?", "output": "MATCH (:Gene{name: \"BAIAP2\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular components are associated with the gene named YBX1 based on its participation?", "output": "MATCH (:Gene{name: \"YBX1\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components in which genes located on chromosome 17 participate?", "output": "MATCH (:Gene{chromosome: \"17\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components in which the gene named \"ESCO2\" is involved?", "output": "MATCH (:Gene{name: \"ESCO2\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are linked through participation with the gene MRPL10?", "output": "MATCH (:Gene{name: \"MRPL10\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular components linked to the gene named \"UQCC2\" by participation.", "output": "MATCH (:Gene{name: \"UQCC2\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components in which the gene named \"HMGCS2\" is involved?", "output": "MATCH (:Gene{name: \"HMGCS2\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the names of cellular components connected to the \"PGM5\" gene through participation?", "output": "MATCH (:Gene{name: \"PGM5\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components do genes found on chromosome 4 participate in, according to their names?", "output": "MATCH (:Gene{chromosome: \"4\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of the cellular components linked to the gene \"SLC27A6\".", "output": "MATCH (:Gene{name: \"SLC27A6\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the cellular component names linked to the RAB22A gene?", "output": "MATCH (:Gene{name: \"RAB22A\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components that the gene TDRD6 is involved in?", "output": "MATCH (:Gene{name: \"TDRD6\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}]