[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to cause the side effect named \"Nystagmus\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Nystagmus\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound names correspond to the side effect Enterocutaneous fistula?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Enterocutaneous fistula\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause liver disorder as a side effect?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Liver disorder\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names that result in dizziness as a side effect?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Dizziness\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify compounds that result in the side effect labeled with the identifier \"C0344232\".", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0344232\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the names of compounds that are linked to the side effect known as hypersensitivity.", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Hypersensitivity\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect with the identifier \"C0028084\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0028084\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of compounds that lead to a side effect called \"Swelling face\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Swelling face\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are associated with causing the side effect with the identifier \"C0858678\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0858678\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause gastrointestinal pain as a side effect?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Gastrointestinal pain\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that lead to the side effect with the identifier \"C0020505\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0020505\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What side effect names result from the compound identified as \"DB01148\"?", "output": "MATCH (:Compound{identifier: \"DB01148\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What side effect names result from the compound labeled with identifier \"DB00246\"?", "output": "MATCH (:Compound{identifier: \"DB00246\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of side effects linked to the compound with identifier \"DB06589\".", "output": "MATCH (:Compound{identifier: \"DB06589\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the side effects caused by the compound with the identifier \"DB01359\"?", "output": "MATCH (:Compound{identifier: \"DB01359\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the side effects caused by the compound with the identifier \"DB00972\"?", "output": "MATCH (:Compound{identifier: \"DB00972\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the side effects caused by the compound with the identifier \"DB00322\"?", "output": "MATCH (:Compound{identifier: \"DB00322\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the side effects caused by the compound with the identifier \"DB00833\"?", "output": "MATCH (:Compound{identifier: \"DB00833\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What side effect names are linked to the compound Azelastine?", "output": "MATCH (:Compound{name: \"Azelastine\"})-[:CAUSES_CcSE]->(se:SideEffect) RETURN se.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds that have a relationship indicating similarity with \"Medroxyprogesterone Acetate\" and return their names.", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Medroxyprogesterone Acetate\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are similar to the compound named \"Ceforanide\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Ceforanide\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that resemble the compound with the identifier \"DB01224\".", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB01224\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound with the identifier \"DB01227\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB01227\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds resemble the compound named \"Enoxacin\" based on the specified relationship?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Enoxacin\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have a relationship of resemblance to the compound with the identifier \"DB01303\" according to their names?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB01303\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound with the identifier \"DB01551\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB01551\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that resemble the compound named \"Tripelennamine\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Tripelennamine\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds related through resemblance to the compound whose identifier is \"DB00151.\"", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB00151\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do I find all compounds that are similar to Ifosfamide, and what are their names?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Ifosfamide\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that are similar to the compound with identifier \"DB00363.\"", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB00363\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound named Delorazepam?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Delorazepam\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound named \"Mephentermine\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Mephentermine\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that are similar to the compound with identifier \"DB06148\".", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB06148\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have a resemblance with the compound Metipranolol.", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Metipranolol\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound named \"Milnacipran\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Milnacipran\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds that are similar to the compound whose identifier is \"DB06771.\"", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB06771\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that share similarities with the compound Ranolazine.", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Ranolazine\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds whose structure is similar to that of the compound with the identifier \"DB01364\" and provide their names.", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB01364\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that have a resemblance to the compound named Rilpivirine?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{name: \"Rilpivirine\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that have a resemblance to the compound with the identifier \"DB00902\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB00902\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble the compound with the identifier \"DB00953\"?", "output": "MATCH (g:Compound)-[:RESEMBLES_CrC]->(:Compound{identifier: \"DB00953\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the anatomy entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0002367\"})-[:DOWNREGULATES_AdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the anatomy entity with the identifier \"UBERON:0002367\"?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0002367\"})-[:DOWNREGULATES_AdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to treat the disease with the identifier \"DOID:1686\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1686\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to treat the disease with the identifier \"DOID:11476\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:11476\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that treat the disease with the identifier DOID:1324?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1324\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that can treat the disease with the identifier \"DOID:2841\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:2841\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to treat the disease with the identifier \"DOID:10763\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:10763\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with identifier DOID:2531?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:2531\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier \"DOID:1319\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1319\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all compounds that treat the disease corresponding to the identifier DOID:1612.", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1612\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier \"DOID:9970\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:9970\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all compounds that are associated with treating the disease labeled by the identifier DOID:1936.", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1936\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have a relationship indicating they treat the disease with identifier DOID:263, and what are their respective names?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:263\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier \"DOID:418\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:418\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier \"DOID:9352\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:9352\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compound names are connected to the disease with identifier \"DOID:2531\" through the treatment relationship?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:2531\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that can treat the disease with the identifier DOID:10763?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:10763\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with identifier \"DOID:3310\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:3310\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier DOID:12236?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:12236\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with identifier DOID:1319?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:1319\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of compounds that have been linked to treating the disease with the identifier \"DOID:4481\".", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:4481\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that are used to treat the disease with the identifier DOID:5408?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:5408\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier \"DOID:9008\"?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:9008\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to treat the disease with the identifier DOID:2841?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:2841\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of compounds that have a treatment relationship with malaria.", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{name: \"malaria\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of compounds that are linked to treating the specified disease with the identifier \"DOID:0050741\".", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{identifier: \"DOID:0050741\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound names are returned for the compounds that treat hepatitis B?", "output": "MATCH (d:Compound)-[:TREATS_CtD]->(:Disease{name: \"hepatitis B\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases treated by the compound with the identifier \"DB00242\"?", "output": "MATCH (:Compound{identifier: \"DB00242\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases treated by the compound with the identifier \"DB00716\"?", "output": "MATCH (:Compound{identifier: \"DB00716\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases treated by the compound with the identifier \"DB00443\"?", "output": "MATCH (:Compound{identifier: \"DB00443\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases treated by the compound with the identifier \"DB00178\"?", "output": "MATCH (:Compound{identifier: \"DB00178\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the disease names that can be treated by the compound having the identifier \"DB01077\"?", "output": "MATCH (:Compound{identifier: \"DB01077\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases treated by the compound with the identifier \"DB00262\"?", "output": "MATCH (:Compound{identifier: \"DB00262\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the names of diseases that are treated by the compound with identifier \"DB08881\".", "output": "MATCH (:Compound{identifier: \"DB08881\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB01105\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB01105\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB01136\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB01136\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are treated by the compound with the identifier \"DB06589\"?", "output": "MATCH (:Compound{identifier: \"DB06589\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that the compound with the identifier \"DB01206\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB01206\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that are treated by the compound with the identifier \"DB08866\"?", "output": "MATCH (:Compound{identifier: \"DB08866\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB00286\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB00286\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB01156\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB01156\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB01394\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB01394\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB01041\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB01041\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00571\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB00571\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB01229\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB01229\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB00541\" can treat?", "output": "MATCH (:Compound{identifier: \"DB00541\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00206\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB00206\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00563\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB00563\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases can be treated by the compound with the identifier \"DB00455\"?", "output": "MATCH (:Compound{identifier: \"DB00455\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB00641\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB00641\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00909\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB00909\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00958\" is known to treat?", "output": "MATCH (:Compound{identifier: \"DB00958\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound identified by \"DB01057\" is used to treat according to the database?", "output": "MATCH (:Compound{identifier: \"DB01057\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases for which the compound \"DB01248\" acts as a treatment.", "output": "MATCH (:Compound{identifier: \"DB01248\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB00635\" is used to treat?", "output": "MATCH (:Compound{identifier: \"DB00635\"})-[:TREATS_CtD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds that offer palliation for the disease specified as DOID:1612.", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:1612\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds linked to palliating the disease corresponding to the identifier \"DOID:11934\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:11934\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds palliate the disease with the DOID:1324 identifier, and what are the names of these compounds?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:1324\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds that serve a palliative function for the disease with the identifier \"DOID:4481\".", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:4481\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to palliate the disease with the identifier \"DOID:418\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:418\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound names that palliates the disease represented by the identifier \"DOID:6364\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:6364\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to palliate the disease with the identifier \"DOID:10283\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:10283\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that palliate ankylosing spondylitis?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"ankylosing spondylitis\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds associated with palliating Gilles de la Tourette syndrome?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"Gilles de la Tourette syndrome\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to palliate the disease with the identifier DOID:6364?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:6364\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that palliate the disease identified as DOID:5419?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:5419\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of compounds that palliate the disease with the identifier DOID:6364?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:6364\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have a palliative effect on the disease specified by the identifier \"DOID:1319\".", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:1319\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of compounds associated with palliating lung cancer?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"lung cancer\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have a palliating effect on the disease known as \"DOID:3393\".", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:3393\"}) RETURN c.name"}]