[{"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound names that are interconnected in any way with the molecular function called \"alpha-actinin binding\"?", "output": "MATCH path = (n:MolecularFunction{name: \"alpha-actinin binding\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the names of pharmacologic classes related to the specific molecular function designated by the identifier \"GO:0008757\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0008757\"})-[*]-(m:PharmacologicClass) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that are connected to the molecular function with the identifier \"GO:0004995\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0004995\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compound names can you find that are associated, at any connection depth, with the molecular function marked by GO:0015440?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0015440\"})-[*]-(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms that are connected to the molecular function with the identifier \"GO:0030158\"?", "output": "MATCH path = (n:MolecularFunction{identifier: \"GO:0030158\"})-[*]-(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names that are associated with the pharmacologic class named \"Receptor Tyrosine Kinase Inhibitors.\"", "output": "MATCH path = (n:PharmacologicClass{name: \"Receptor Tyrosine Kinase Inhibitors\"})-[*]-(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the URL and name of the compound whose InChI value matches \"InChI=1S/C19H20N2O3S/c1-2-13-3-6-15(20-12-13)9-10-24-16-7-4-14(5-8-16)11-17-18(22)21-19(23)25-17/h3-8,12,17H,2,9-11H2,1H3,(H,21,22,23)\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C19H20N2O3S/c1-2-13-3-6-15(20-12-13)9-10-24-16-7-4-14(5-8-16)11-17-18(22)21-19(23)25-17/h3-8,12,17H,2,9-11H2,1H3,(H,21,22,23)\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the URL and name of the compound with the InChI identifier \"InChI=1S/C15H18N4O5/c1-5-9(16)12(21)8-6(4-24-14(17)22)15(23-2)13-7(18-13)3-19(15)10(8)11(5)20/h6-7,13,18H,3-4,16H2,1-2H3,(H2,17,22)/t6-,7+,13+,15-/m1/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C15H18N4O5/c1-5-9(16)12(21)8-6(4-24-14(17)22)15(23-2)13-7(18-13)3-19(15)10(8)11(5)20/h6-7,13,18H,3-4,16H2,1-2H3,(H2,17,22)/t6-,7+,13+,15-/m1/s1\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the name and source of the gene with the description specified as \"Fas (TNFRSF6)-associated via death domain\".", "output": "MATCH (n:Gene { description: \"Fas (TNFRSF6)-associated via death domain\" }) RETURN n.name, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URL and name for the gene node described as \"cyclin-dependent kinase inhibitor 1B (p27, Kip1)\"?", "output": "MATCH (n:Gene { description: \"cyclin-dependent kinase inhibitor 1B (p27, Kip1)\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the URL and name details for the gene that has \"chemokine (C-X-C motif) receptor 2\" as its description?", "output": "MATCH (n:Gene { description: \"chemokine (C-X-C motif) receptor 2\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URL and identifier associated with a compound given its InChI code \"InChI=1S/C22H23N3O4/c1-4-16-6-5-7-17(12-16)25-22-18-13-20(28-10-8-26-2)21(29-11-9-27-3)14-19(18)23-15-24-22/h1,5-7,12-15H,8-11H2,2-3H3,(H,23,24,25)\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C22H23N3O4/c1-4-16-6-5-7-17(12-16)25-22-18-13-20(28-10-8-26-2)21(29-11-9-27-3)14-19(18)23-15-24-22/h1,5-7,12-15H,8-11H2,2-3H3,(H,23,24,25)\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the InChIKey and name of a compound identified by the given InChI \"InChI=1S/C10H12ClN5O3/c11-10-14-8(12)7-9(15-10)16(3-13-7)6-1-4(18)5(2-17)19-6/h3-6,17-18H,1-2H2,(H2,12,14,15)/t4-,5+,6+/m0/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C10H12ClN5O3/c11-10-14-8(12)7-9(15-10)16(3-13-7)6-1-4(18)5(2-17)19-6/h3-6,17-18H,1-2H2,(H2,12,14,15)/t4-,5+,6+/m0/s1\" }) RETURN n.inchikey, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound has the InChI \"InChI=1S/C27H38N2O4/c1-20(2)27(19-28,22-10-12-24(31-5)26(18-22)33-7)14-8-15-29(3)16-13-21-9-11-23(30-4)25(17-21)32-6/h9-12,17-18,20H,8,13-16H2,1-7H3\" and what are its identifier and name?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C27H38N2O4/c1-20(2)27(19-28,22-10-12-24(31-5)26(18-22)33-7)14-8-15-29(3)16-13-21-9-11-23(30-4)25(17-21)32-6/h9-12,17-18,20H,8,13-16H2,1-7H3\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifier and BTO ID for the anatomy entity labeled \"prostate gland\"?", "output": "MATCH (n:Anatomy { name: \"prostate gland\" }) RETURN n.identifier, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which URL and identifier are associated with the compound having the InChI \"InChI=1S/C17H18N2O6/c1-9-13(16(20)24-3)15(14(10(2)18-9)17(21)25-4)11-7-5-6-8-12(11)19(22)23/h5-8,15,18H,1-4H3\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C17H18N2O6/c1-9-13(16(20)24-3)15(14(10(2)18-9)17(21)25-4)11-7-5-6-8-12(11)19(22)23/h5-8,15,18H,1-4H3\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I would like to know the identifier and name of the compound associated with the URL \"http://www.drugbank.ca/drugs/DB06589.\"", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB06589\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifiers and names of pharmacologic classes whose source is the FDA via DrugCentral?", "output": "MATCH (n:PharmacologicClass { source: \"FDA via DrugCentral\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "I need to find out the name and source of the gene linked to the URL \"http://identifiers.org/ncbigene/23435\". What are they?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/23435\" }) RETURN n.name, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the source and name of the compound with the InChIKey \"InChIKey=HAWPXGHAZFHHAD-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=HAWPXGHAZFHHAD-UHFFFAOYSA-N\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the identifiers and names of pharmacologic classes that hold a \"CC BY 4.0\" license.", "output": "MATCH (n:PharmacologicClass { license: \"CC BY 4.0\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifier and name of the compound with the URL \"http://www.drugbank.ca/drugs/DB00151\"?", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB00151\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the source and identifier of the compound with the specified InChI string \"InChI=1S/C20H23N/c1-21(2)15-7-12-20-18-10-5-3-8-16(18)13-14-17-9-4-6-11-19(17)20/h3-6,8-12H,7,13-15H2,1-2H3\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C20H23N/c1-21(2)15-7-12-20-18-10-5-3-8-16(18)13-14-17-9-4-6-11-19(17)20/h3-6,8-12H,7,13-15H2,1-2H3\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifier and name of the disease with the specific URL \"http://purl.obolibrary.org/obo/DOID_1793\"?", "output": "MATCH (n:Disease { url: \"http://purl.obolibrary.org/obo/DOID_1793\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we obtain the source and identifier details for the compound that is identified by the InChI \"InChI=1/C21H26O2/c1-4-21(22)12-10-19-18-7-5-14-13-15(23-3)6-8-16(14)17(18)9-11-20(19,21)2/h1,6,8,13,17-19,22H,5,7,9-12H2,2-3H3/t17-,18-,19+,20+,21+/s2\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1/C21H26O2/c1-4-21(22)12-10-19-18-7-5-14-13-15(23-3)6-8-16(14)17(18)9-11-20(19,21)2/h1,6,8,13,17-19,22H,5,7,9-12H2,2-3H3/t17-,18-,19+,20+,21+/s2\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names and sources of diseases that possess a \"CC BY 3.0\" license?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the source and URL associated with the compound that has the InChI string \"InChI=1S/C21H21ClN4OS/c22-17-13-18-15(12-20(27)23-18)11-14(17)5-6-25-7-9-26(10-8-25)21-16-3-1-2-4-19(16)28-24-21/h1-4,11,13H,5-10,12H2,(H,23,27)\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C21H21ClN4OS/c22-17-13-18-15(12-20(27)23-18)11-14(17)5-6-25-7-9-26(10-8-25)21-16-3-1-2-4-19(16)28-24-21/h1-4,11,13H,5-10,12H2,(H,23,27)\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URL and source for genes specifically on chromosome 8?", "output": "MATCH (n:Gene { chromosome: \"8\" }) RETURN n.url, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name and source of the gene identified by the URL \"http://identifiers.org/ncbigene/7043\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/7043\" }) RETURN n.name, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the ID and name of diseases with a \"CC BY 3.0\" license?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the InChIKeys and names for each compound that has been associated with the license \"CC BY-NC 4.0\".", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.inchikey, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the source and BTO ID for each anatomy entity that has the license \"CC BY 3.0\"?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.source, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier and name of the compound characterized by the InChIKey \"CUIHSIWYWATEQL-UHFFFAOYSA-N\".", "output": "MATCH (n:Compound { inchikey: \"InChIKey=CUIHSIWYWATEQL-UHFFFAOYSA-N\" }) RETURN n.identifier, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the source and name for each compound that has been assigned the \"CC BY-NC 4.0\" license?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the chromosome and name of each gene that has a CC0 1.0 license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.chromosome, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which source and identifier are listed for the compound that has the exact InChI formula \"InChI=1S/C11H12Cl2N2O5/c12-10(13)11(18)14-8(5-16)9(17)6-1-3-7(4-2-6)15(19)20/h1-4,8-10,16-17H,5H2,(H,14,18)/t8-,9-/m1/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C11H12Cl2N2O5/c12-10(13)11(18)14-8(5-16)9(17)6-1-3-7(4-2-6)15(19)20/h1-4,8-10,16-17H,5H2,(H,14,18)/t8-,9-/m1/s1\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs and sources associated with genes on chromosome number 19?", "output": "MATCH (n:Gene { chromosome: \"19\" }) RETURN n.url, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the URL and BTO ID for each Anatomy element with a \"CC BY 3.0\" license.", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.url, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the source and name details of anatomy items that possess the license type \"CC BY 3.0.\"", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What chromosome information and descriptions are available for genes with the \"CC0 1.0\" license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.chromosome, n.description"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the InChI and InChIKey of compounds with a \"CC BY-NC 4.0\" license?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.inchi, n.inchikey"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the source and identifier information for diseases that are licensed as \"CC BY 3.0\"?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the URLs and names for anatomy entities that hold a \"CC BY 3.0\" license.", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy is associated with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\", and what are its name and identifier?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0002367\" }) RETURN n.name, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the mesh_id and bto_id from Anatomy nodes with the \"CC BY 3.0\" license?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.mesh_id, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which source and name are associated with the compound that has the InChI notation: \"InChI=1S/C16H19BrN2/c1-19(2)12-10-15(16-5-3-4-11-18-16)13-6-8-14(17)9-7-13/h3-9,11,15H,10,12H2,1-2H3/t15-/m0/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C16H19BrN2/c1-19(2)12-10-15(16-5-3-4-11-18-16)13-6-8-14(17)9-7-13/h3-9,11,15H,10,12H2,1-2H3/t15-/m0/s1\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the source and URL of the compound with the specific InChI key \"InChI=1S/C15H14ClN3O4S/c16-8-6-24-14-10(13(21)19(14)11(8)15(22)23)18-12(20)9(17)7-4-2-1-3-5-7/h1-5,9-10,14H,6,17H2,(H,18,20)(H,22,23)/t9-,10-,14-/m1/s1\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C15H14ClN3O4S/c16-8-6-24-14-10(13(21)19(14)11(8)15(22)23)18-12(20)9(17)7-4-2-1-3-5-7/h1-5,9-10,14H,6,17H2,(H,18,20)(H,22,23)/t9-,10-,14-/m1/s1\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find out the source and name of the anatomy entry with the mesh_id \"D011467\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs and names of diseases that have 'Disease Ontology' as their source?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URL and name of each compound that comes from DrugBank?", "output": "MATCH (n:Compound { source: \"DrugBank\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy item has the specified URL \"http://purl.obolibrary.org/obo/UBERON_0002367\" and what are its associated name and BTO ID?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0002367\" }) RETURN n.name, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the InChI and name details of compounds that possess a \"CC BY-NC 4.0\" license.", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.inchi, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the source and URL for each disease that is available with a \"CC BY 3.0\" license.", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can you find the source and identifier for a compound with the specified InChIKey \"LMEKQMALGUDUQG-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=LMEKQMALGUDUQG-UHFFFAOYSA-N\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the mesh identifiers and identifiers for anatomy records that are available under the \"CC BY 3.0\" license.", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.mesh_id, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can you retrieve the chromosome and URL details for genes that are licensed as \"CC0 1.0\"?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.chromosome, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the mesh ID and name for each Anatomy that holds a \"CC BY 3.0\" license in the dataset?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.mesh_id, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes with the \"CC0 1.0\" license have their descriptions and sources available?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.description, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What source and BTO ID information correspond to the anatomy entry with the specific mesh_id \"D011467\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" }) RETURN n.source, n.bto_id"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which chromosomes and descriptions pertain to genes with the license type CC0 1.0?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.chromosome, n.description"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the description and name for each gene node with a \"CC0 1.0\" license.", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.description, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the source and identifier details for the compound where the InChIKey is \"GJJFMKBJSRMPLA-DZGCQCFKSA-N\".", "output": "MATCH (n:Compound { inchikey: \"InChIKey=GJJFMKBJSRMPLA-DZGCQCFKSA-N\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which source and URL are linked to the Anatomy record that contains the mesh_id \"D004817\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D004817\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the source and URL information for each compound with a \"CC BY-NC 4.0\" license?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available about the name and source of genes with a CC0 1.0 license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.name, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the URL and name attributes of the anatomy object that has a mesh ID of \"D011467\".", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and return the name and identifier of the anatomy node with the specific mesh ID of \"D011467\".", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" }) RETURN n.name, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can be retrieved about the URL and source for each gene node having a license type of \"CC0 1.0\"?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.url, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names and sources of genes that have a CC0 1.0 license in the database?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.name, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available regarding the source and URLs for anatomy items that have the \"CC BY 3.0\" license?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n.source, n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the source and name of the compound with the InChIKey \"CEUORZQYGODEFX-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=CEUORZQYGODEFX-UHFFFAOYSA-N\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URL and identifier for the compound with the InChIKey HEFNNWSXXWATRW-UHFFFAOYSA-N?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=HEFNNWSXXWATRW-UHFFFAOYSA-N\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URL and name of genes that have the \"CC0 1.0\" license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.url, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URL and identifier information for the Anatomy node with mesh_id \"D004817\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D004817\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the InChI information and identifiers for compounds that are licensed as \"CC BY-NC 4.0\".", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n.inchi, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs and sources for genes with the license \"CC0 1.0\" recorded in the database?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.url, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the URL and identifier for each compound that has \"DrugBank\" as its source?", "output": "MATCH (n:Compound { source: \"DrugBank\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the chromosome and source information for genes that have a license of \"CC0 1.0\"?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n.chromosome, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the URL and identifier of the compound with InChIKey \"SDUQYLNIPVEERB-QPPQHZFASA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=SDUQYLNIPVEERB-QPPQHZFASA-N\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the name and source of the compound with an InChIKey of \"CUIHSIWYWATEQL-UHFFFAOYSA-N\".", "output": "MATCH (n:Compound { inchikey: \"InChIKey=CUIHSIWYWATEQL-UHFFFAOYSA-N\" }) RETURN n.source, n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the source and identifier associated with the compound having the InChIKey \"HYIMSNHJOBLJNT-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=HYIMSNHJOBLJNT-UHFFFAOYSA-N\" }) RETURN n.source, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URL and identifier of the anatomy entry with the MeSH ID \"D011467\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the URLs and identifiers for pharmacologic classes sourced through FDA via DrugCentral?", "output": "MATCH (n:PharmacologicClass { source: \"FDA via DrugCentral\" }) RETURN n.url, n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which descriptions and sources pertain to genes associated with chromosome 17?", "output": "MATCH (n:Gene { chromosome: \"17\" }) RETURN n.description, n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds and the specific genes they upregulate through the UPREGULATES_CuG relationship.", "output": "MATCH (n:Compound)-[r:UPREGULATES_CuG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifiers for both pharmacologic classes and compounds that are linked through an 'INCLUDES_PCiC' relationship?", "output": "MATCH (n:PharmacologicClass)-[r:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers for genes that have regulatory relationships ('REGULATES_GrG') with other genes?", "output": "MATCH (n:Gene)-[r:REGULATES_GrG]->(m:Gene) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify and return the names of each compound that is linked to another compound by the 'RESEMBLES_CrC' relationship?", "output": "MATCH (n:Compound)-[r:RESEMBLES_CrC]->(m:Compound) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are similar to each other based on the 'RESEMBLES_DrD' relationship?", "output": "MATCH (n:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy structures that express specific genes according to the EXPRESSES_AeG relationship?", "output": "MATCH (n:Anatomy)-[r:EXPRESSES_AeG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease identifiers are associated with genes that they upregulate through the relationship UPREGULATES_DuG, and what are the identifiers of those genes?", "output": "MATCH (n:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the gene identifiers and the identifiers of the cellular components they are associated with via the 'PARTICIPATES_GpCC' relationship?", "output": "MATCH (n:Gene)-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the disease names along with the genes they upregulate using the 'UPREGULATES_DuG' relationship?", "output": "MATCH (n:Disease)-[r:UPREGULATES_DuG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that regulate other genes according to the 'REGULATES_GrG' relationship?", "output": "MATCH (n:Gene)-[r:REGULATES_GrG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are linked to which genes according to the 'ASSOCIATES_DaG' relationship?", "output": "MATCH (n:Disease)-[r:ASSOCIATES_DaG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of compounds that are used to treat specific diseases according to the TREATS_CtD relationship in the database?", "output": "MATCH (n:Compound)-[r:TREATS_CtD]->(m:Disease) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are linked to biological processes through the PARTICIPATES_GpBP relationship, and what are their identifiers?", "output": "MATCH (n:Gene)-[r:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are associated with genes through the binds CbG relationship, and what are their names?", "output": "MATCH (n:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN n.name, m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list pairs of disease identifiers that are connected by the RESEMBLES_DrD relationship?", "output": "MATCH (n:Disease)-[r:RESEMBLES_DrD]->(m:Disease) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene and molecular function pairs, identified by their unique identifiers, are connected by a PARTICIPATES_GpMF relationship?", "output": "MATCH (n:Gene)-[r:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.identifier, m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers for compounds that have a connection labeled 'BINDS_CbG' to genes?", "output": "MATCH (n:Compound)-[r:BINDS_CbG]->(m:Gene) RETURN n.identifier, m.identifier"}]