[{"instruction": "Convert the following natural language into Cypher query.", "input": "Find the diseases that have a relationship with the \"GAGE1\" gene.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"GAGE1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are connected to genes residing on chromosome 20?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"20\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that have an associative relationship with the CELA3B gene.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"CELA3B\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that associate with genes situated on chromosome 13.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"13\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases whose related genes exist on chromosome 11. What are their names?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"11\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with genes located on chromosome 18?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"18\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of diseases linked to genes situated on chromosome 2.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are linked to the \"STAT6\" gene through an association?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"STAT6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are associated with the gene named DAB2 according to this query?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"DAB2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all diseases that are associated with the CYP1A1 gene.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"CYP1A1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the symptom names that are connected to the disease marked by the identifier \"DOID:2377\".", "output": "MATCH (:Disease{identifier: \"DOID:2377\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of symptom names linked to the disease described by the identifier \"DOID:1793\"?", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are connected to the disease with identifier \"DOID:3312\"?", "output": "MATCH (:Disease{identifier: \"DOID:3312\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are connected to the disease with identifier \"DOID:5041\"?", "output": "MATCH (:Disease{identifier: \"DOID:5041\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are connected to the disease whose identifier is DOID:10871?", "output": "MATCH (:Disease{identifier: \"DOID:10871\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms associated with the disease identifier \"DOID:10763\"?", "output": "MATCH (:Disease{identifier: \"DOID:10763\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms associated with the disease having the identifier \"DOID:5612\"?", "output": "MATCH (:Disease{identifier: \"DOID:5612\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the symptom names that are presented by the disease with identifier \"DOID:7693\"?", "output": "MATCH (:Disease{identifier: \"DOID:7693\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are related to the disease having DOID:7693 as its identifier?", "output": "MATCH (:Disease{identifier: \"DOID:7693\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of symptoms associated with the disease that has the identifier \"DOID:1936\"?", "output": "MATCH (:Disease{identifier: \"DOID:1936\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are recorded for the disease with the identifier \"DOID:184\"?", "output": "MATCH (:Disease{identifier: \"DOID:184\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the symptom names presented by the disease with the identifier DOID:1725?", "output": "MATCH (:Disease{identifier: \"DOID:1725\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of symptoms for the disease marked by the identifier \"DOID:1612\".", "output": "MATCH (:Disease{identifier: \"DOID:1612\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of symptoms that are presented by the disease with the identifier \"DOID:1686\"?", "output": "MATCH (:Disease{identifier: \"DOID:1686\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the symptoms associated with the disease having the identifier \"DOID:8850\"?", "output": "MATCH (:Disease{identifier: \"DOID:8850\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the symptom names that are connected to the disease with the identifier \"DOID:11949\"?", "output": "MATCH (:Disease{identifier: \"DOID:11949\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are linked to the disease that has the identifier DOID:2377?", "output": "MATCH (:Disease{identifier: \"DOID:2377\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the symptoms associated with the disease that has the identifier \"DOID:1826\"?", "output": "MATCH (:Disease{identifier: \"DOID:1826\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are returned for the disease name \"asthma\"?", "output": "MATCH (:Disease{name: \"asthma\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are linked to the disease known as age-related macular degeneration?", "output": "MATCH (:Disease{name: \"age related macular degeneration\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of symptoms presented by the disease with identifier DOID:13241?", "output": "MATCH (:Disease{identifier: \"DOID:13241\"})-[:PRESENTS_DpS]->(s:Symptom) RETURN s.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases linked to the symptom with the identifier \"D001724\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D001724\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that have the symptom with the identifier \"D007383.\"", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D007383\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases associated with the symptom \"Spinocerebellar Ataxias\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{name: \"Spinocerebellar Ataxias\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that exhibit the \"Pain Threshold\" symptom.", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{name: \"Pain Threshold\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that present with the symptom having the identifier \"D015431\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D015431\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names correspond to the symptom with the identifier \"D010243\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D010243\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that exhibit the symptom represented by the identifier \"D010291\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D010291\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of disease names that exhibit the symptom assigned the identifier \"D010146\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D010146\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of disease names associated with the symptom having the identifier \"D005221\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D005221\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of disease names that show the symptom with identifier \"D001260\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D001260\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of diseases that have symptoms matching the identifier \"D002375\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D002375\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that show the symptom with the identifier \"D005158\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D005158\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that exhibit a symptom marked by the identifier \"D004487\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D004487\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names correspond to the symptom marked by the identifier \"D006212\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D006212\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that present the symptom with the identifier \"D020233\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D020233\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names correspond to the symptom \"Purpura, Thrombocytopenic, Idiopathic\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{name: \"Purpura, Thrombocytopenic, Idiopathic\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that exhibit the symptom marked by the identifier \"D020234\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D020234\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases associated with the symptom that has the identifier \"D018886\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D018886\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names correspond to the symptom with the identifier \"D005335\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D005335\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the names of diseases associated with the symptom whose identifier is \"D060050\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D060050\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that have a symptom with the identifier \"D000326\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D000326\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the diseases that exhibit the symptom denoted by the identifier D013746.", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D013746\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are connected to the symptom marked by the identifier \"D004421\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D004421\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of diseases that are linked to the symptom coded as \"D012021\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D012021\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that are connected to the symptom represented by the identifier \"D006396\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D006396\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that manifest the symptom with the identifier \"D000855\".", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D000855\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that exhibit the symptom with the identifier \"D001750\"?", "output": "MATCH (d:Disease)-[:PRESENTS_DpS]->(:Symptom{identifier: \"D001750\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all disease names that appear to be similar to sclerosing cholangitis.", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"sclerosing cholangitis\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that have a resemblance to the disease whose identifier is DOID:10153.", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:10153\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that share a resemblance with attention deficit hyperactivity disorder in this dataset?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"attention deficit hyperactivity disorder\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are related through resemblance to the disease with the identifier \"DOID:1324\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1324\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are identified as being similar to the disease with the identifier \"DOID:11054\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:11054\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are similar to the disease specified by the identifier \"DOID:1781\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1781\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of diseases are returned when looking for those with a resemblance to fallopian tube cancer?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"fallopian tube cancer\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that are linked as resembling the disease characterized by the identifier \"DOID:1094\".", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1094\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that match polycystic ovary syndrome in similarity?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"polycystic ovary syndrome\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that resemble the disease marked by \"DOID:1192\" in this database.", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1192\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that share a resemblance to the disease with the identifier code DOID:11934 according to the available data.", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:11934\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have a resemblance to the disease with the identifier \"DOID:119\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:119\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have a resemblance to the disease defined by the identifier \"DOID:332\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:332\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the diseases that have a similarity link to the disease with the identifier \"DOID:1909\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1909\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that share similarities with restless legs syndrome?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"restless legs syndrome\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have a resemblance to the disease with the identifier \"DOID:418\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:418\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are similar to the one specified by the identifier \"DOID:2394\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:2394\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are identified as resembling the disease with identifier \"DOID:11612\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:11612\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of each disease that is similar to the disease represented by the identifier \"DOID:1115\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:1115\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the database, what are the names of diseases that show resemblance to the disease with the identifier \"DOID:5612\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:5612\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of diseases that are connected to urinary bladder cancer by a resemblance relationship?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"urinary bladder cancer\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all diseases that are connected through a resemblance relationship to the disease having the identifier \"DOID:2174\".", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:2174\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have a resemblance link to the disease with identifier \"DOID:9352\"?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{identifier: \"DOID:9352\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that have a similarity link to systemic lupus erythematosus?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"systemic lupus erythematosus\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are considered similar to primary biliary cirrhosis according to the database?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"primary biliary cirrhosis\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that have a resemblance to larynx cancer according to their relationship in the database?", "output": "MATCH (g:Disease)-[:RESEMBLES_DrD]->(:Disease{name: \"larynx cancer\"}) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named ZBED3?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"ZBED3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named COX6A2?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"COX6A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named \"NEURL3\"?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"NEURL3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named PFN2?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"PFN2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that cause a downregulation of the gene with the name C7orf73.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"C7orf73\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named CDK5?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"CDK5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of diseases that decrease the expression of the gene with the name RPL35A?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"RPL35A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named \"MT1HL1\"?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"MT1HL1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene NDUFA3?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"NDUFA3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that lead to the downregulation of the gene named \"HDDC2\"?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"HDDC2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named ATP2A2?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"ATP2A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that act to downregulate the gene named PCDHGB7.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"PCDHGB7\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene named FASTKD1?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"FASTKD1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the diseases that are linked to the downregulation of the gene with the name OXNAD1.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"OXNAD1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that cause the downregulation of the gene with the name JADE3.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"JADE3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names correspond to the downregulation of the gene called GGT6?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"GGT6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene known as C14orf28?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"C14orf28\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene EBAG9?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"EBAG9\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene RPP14?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"RPP14\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of disease names linked to the downregulation of genes on the seventh chromosome?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{chromosome: \"7\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene SYT17?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"SYT17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene SCGB1D4?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"SCGB1D4\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names appear in the database as downregulating the TMEM97 gene?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"TMEM97\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that downregulate any gene on chromosome 5.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{chromosome: \"5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate genes located on chromosome 18?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{chromosome: \"18\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that have a downregulation effect on the gene named PRKAR2A.", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"PRKAR2A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases linked to the downregulation of chromosome 5 genes?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{chromosome: \"5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that downregulate the gene RPL11?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"RPL11\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases can be identified that downregulate the gene with the name RTCA?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"RTCA\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the disease names associated with the downregulation of the gene C6orf226?", "output": "MATCH (d:Disease)-[:DOWNREGULATES_DdG]->(:Gene{name: \"C6orf226\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the gene names that are negatively regulated by the disease with identifier \"DOID:11612.\"", "output": "MATCH (:Disease{identifier: \"DOID:11612\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are downregulated by the disease with the identifier \"DOID:8778.\"", "output": "MATCH (:Disease{identifier: \"DOID:8778\"})-[:DOWNREGULATES_DdG]->(g:Gene) RETURN g.name"}]