[{"instruction": "Convert the following natural language into Cypher query.", "input": "Find the genes on chromosome 18 that either fit the description \"small nuclear ribonucleoprotein D1 polypeptide 16kDa\" or have a different designation than \"SNRPD1\".", "output": "MATCH (n:Gene) WHERE n.chromosome = \"18\" AND (n.description = \"small nuclear ribonucleoprotein D1 polypeptide 16kDa\" OR NOT n.name = \"SNRPD1\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find compounds with a specific InChI of \"InChI=1S/C21H23N7O2S/c1-13-5-6-15(11-19(13)31(22,29)30)24-21-23-10-9-20(25-21)27(3)16-7-8-17-14(2)28(4)26-18(17)12-16/h5-12H,1-4H3,(H2,22,29,30)(H,23,24,25)\" that either have the InChIKey \"InChIKey=CUIHSIWYWATEQL-UHFFFAOYSA-N\" or a different name than \"Pazopanib\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C21H23N7O2S/c1-13-5-6-15(11-19(13)31(22,29)30)24-21-23-10-9-20(25-21)27(3)16-7-8-17-14(2)28(4)26-18(17)12-16/h5-12H,1-4H3,(H2,22,29,30)(H,23,24,25)\" AND (n.inchikey = \"InChIKey=CUIHSIWYWATEQL-UHFFFAOYSA-N\" OR NOT n.name = \"Pazopanib\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the compounds that are under the \"CC BY-NC 4.0\" license and feature either the given URL \"http://www.drugbank.ca/drugs/DB06589\" or an alternate identifier from \"DB06589\".", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.url = \"http://www.drugbank.ca/drugs/DB06589\" OR NOT n.identifier = \"DB06589\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the genes whose description is \"DAB2 interacting protein,\" with the condition that they either have the URL \"http://identifiers.org/ncbigene/153090\" or have a name other than \"DAB2IP.\"", "output": "MATCH (n:Gene) WHERE n.description = \"DAB2 interacting protein\" AND (n.url = \"http://identifiers.org/ncbigene/153090\" OR NOT n.name = \"DAB2IP\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of compounds with a \"CC BY-NC 4.0\" license that either link to \"http://www.drugbank.ca/drugs/DB00755\" or do not have the name \"Tretinoin\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.url = \"http://www.drugbank.ca/drugs/DB00755\" OR NOT n.name = \"Tretinoin\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease entry has the URL \"http://purl.obolibrary.org/obo/DOID_1826\" and either the identifier \"DOID:1826\" or a different name than \"epilepsy syndrome\"?", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_1826\" AND (n.identifier = \"DOID:1826\" OR NOT n.name = \"epilepsy syndrome\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can you provide about a pharmacologic class whose URL is \"http://purl.bioontology.org/ontology/NDFRT/N0000175967\" and either matches the identifier \"N0000175967\" or has a different name than \"Thrombopoietin Receptor Interactions\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000175967\" AND (n.identifier = \"N0000175967\" OR NOT n.name = \"Thrombopoietin Receptor Interactions\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds match the given InChI \"InChI=1S/C22H24ClN3O/c1-25-13-4-5-18(12-14-25)26-22(27)20-7-3-2-6-19(20)21(24-26)15-16-8-10-17(23)11-9-16/h2-3,6-11,18H,4-5,12-15H2,1H3\" and additionally either possess the InChIKey \"InChIKey=MBUVEWMHONZEQD-UHFFFAOYSA-N\" or have a different source than DrugBank?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C22H24ClN3O/c1-25-13-4-5-18(12-14-25)26-22(27)20-7-3-2-6-19(20)21(24-26)15-16-8-10-17(23)11-9-16/h2-3,6-11,18H,4-5,12-15H2,1H3\" AND (n.inchikey = \"InChIKey=MBUVEWMHONZEQD-UHFFFAOYSA-N\" OR NOT n.source = \"DrugBank\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the pharmacologic class where the URL and identifier are given, or the name isn't \"Sphingosine 1-Phosphate Receptor Modulators\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000181815\" AND (n.identifier = \"N0000181815\" OR NOT n.name = \"Sphingosine 1-Phosphate Receptor Modulators\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene entries described as \"anaplastic lymphoma receptor tyrosine kinase\" satisfy the criteria of having the URL \"http://identifiers.org/ncbigene/238\" or not having the name \"ALK\"?", "output": "MATCH (n:Gene) WHERE n.description = \"anaplastic lymphoma receptor tyrosine kinase\" AND (n.url = \"http://identifiers.org/ncbigene/238\" OR NOT n.name = \"ALK\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the genes with the description \"protein kinase C, zeta\" that either have the name \"PRKCZ\" or whose source isn't \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.description = \"protein kinase C, zeta\" AND (n.name = \"PRKCZ\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find diseases from the Disease Ontology that are linked either through a specific URL \"http://purl.obolibrary.org/obo/DOID_11612\" or have an identifier other than \"DOID:11612\"?", "output": "MATCH (n:Disease) WHERE n.source = \"Disease Ontology\" AND (n.url = \"http://purl.obolibrary.org/obo/DOID_11612\" OR NOT n.identifier = \"DOID:11612\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find all compounds with the \"CC BY-NC 4.0\" license that either have the specified InChIKey \"InChIKey=AOJJSUZBOXZQNB-VTZDEGQISA-N\" or whose name is not \"Epirubicin\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchikey = \"InChIKey=AOJJSUZBOXZQNB-VTZDEGQISA-N\" OR NOT n.name = \"Epirubicin\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all compounds that are licensed under \"CC BY-NC 4.0\" and are either from DrugBank or have an identifier different from \"DB00232\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.source = \"DrugBank\" OR NOT n.identifier = \"DB00232\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the anatomy node whose URL matches \"http://purl.obolibrary.org/obo/UBERON_0001003\" and which is either identified by \"UBERON:0001003\" or does not have \"BTO:0000404\" as its BTO ID.", "output": "MATCH (n:Anatomy) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0001003\" AND (n.identifier = \"UBERON:0001003\" OR NOT n.bto_id = \"BTO:0000404\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find diseases that are licensed under \"CC BY 3.0\" and are either not associated with the URL \"http://purl.obolibrary.org/obo/DOID_1793\" or come from \"Disease Ontology\".", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND (n.source = \"Disease Ontology\" OR NOT n.url = \"http://purl.obolibrary.org/obo/DOID_1793\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find genes that are licensed as \"CC0 1.0,\" where the description is either \"serine/arginine-rich splicing factor 2\" or their URL does not match \"http://identifiers.org/ncbigene/6427\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.description = \"serine/arginine-rich splicing factor 2\" OR NOT n.url = \"http://identifiers.org/ncbigene/6427\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the properties of the compound with the specific InChI identifier \"InChI=1S/C20H34O2/c1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20(21)22/h6-7,9-10,12-13H,2-5,8,11,14-19H2,1H3,(H,21,22)/b7-6-,10-9-,13-12-\" from the database, ensuring it either has the URL \"http://www.drugbank.ca/drugs/DB00154\" or its identifier is not \"DB00154\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C20H34O2/c1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20(21)22/h6-7,9-10,12-13H,2-5,8,11,14-19H2,1H3,(H,21,22)/b7-6-,10-9-,13-12-\" AND (n.url = \"http://www.drugbank.ca/drugs/DB00154\" OR NOT n.identifier = \"DB00154\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound has an InChI structure \"InChI=1S/C19H20N2O3S/c1-2-13-3-6-15(20-12-13)9-10-24-16-7-4-14(5-8-16)11-17-18(22)21-19(23)25-17/h3-8,12,17H,2,9-11H2,1H3,(H,21,22,23)\" while either being associated with the DrugBank URL \"http://www.drugbank.ca/drugs/DB01132\" or not named \"Pioglitazone\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C19H20N2O3S/c1-2-13-3-6-15(20-12-13)9-10-24-16-7-4-14(5-8-16)11-17-18(22)21-19(23)25-17/h3-8,12,17H,2,9-11H2,1H3,(H,21,22,23)\" AND (n.url = \"http://www.drugbank.ca/drugs/DB01132\" OR NOT n.name = \"Pioglitazone\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the compound linked to \"http://www.drugbank.ca/drugs/DB08877\" by its URL that also either has the identifier \"DB08877\" or is named something other than \"Ruxolitinib\"? ", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB08877\" AND (n.identifier = \"DB08877\" OR NOT n.name = \"Ruxolitinib\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds from DrugBank have either the URL \"http://www.drugbank.ca/drugs/DB01576\" or do not have the name \"Dextroamphetamine\"?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" AND (n.url = \"http://www.drugbank.ca/drugs/DB01576\" OR NOT n.name = \"Dextroamphetamine\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that have been licensed under \"CC BY 3.0\" and are either listed by \"Disease Ontology\" or are not called \"pancreatic cancer.\"", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND (n.source = \"Disease Ontology\" OR NOT n.name = \"pancreatic cancer\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the compounds with a license of \"CC BY-NC 4.0\" that either have the InChIKey \"InChIKey=HFNKQEVNSGCOJV-OAHLLOKOSA-N\" or whose source is not \"DrugBank\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchikey = \"InChIKey=HFNKQEVNSGCOJV-OAHLLOKOSA-N\" OR NOT n.source = \"DrugBank\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find diseases in the database that are labeled with the Disease Ontology source that either have a URL \"http://purl.obolibrary.org/obo/DOID_10871\" or that do not have the identifier \"DOID:10871\"?", "output": "MATCH (n:Disease) WHERE n.source = \"Disease Ontology\" AND (n.url = \"http://purl.obolibrary.org/obo/DOID_10871\" OR NOT n.identifier = \"DOID:10871\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the anatomy entities with a \"CC BY 3.0\" license and having either the specific MeSH ID \"D011467\" or a different web address than \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND (n.mesh_id = \"D011467\" OR NOT n.url = \"http://purl.obolibrary.org/obo/UBERON_0002367\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pharmacologic classes with the classification of \"Mechanism of Action\" that have met the criteria of possessing the \"CC BY 4.0\" license or a URL not equal to \"http://purl.bioontology.org/ontology/NDFRT/N0000000125\".", "output": "MATCH (n:PharmacologicClass) WHERE n.class_type = \"Mechanism of Action\" AND (n.license = \"CC BY 4.0\" OR NOT n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000000125\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the information for compounds that have the InChIKey \"InChIKey=HAWPXGHAZFHHAD-UHFFFAOYSA-N\" and are linked to DrugBank or do not have the name \"Mechlorethamine\".", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=HAWPXGHAZFHHAD-UHFFFAOYSA-N\" AND (n.source = \"DrugBank\" OR NOT n.name = \"Mechlorethamine\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases carry a license of \"CC BY 3.0\" and have the identifier \"DOID:1793\", or are not named \"pancreatic cancer\"?", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND (n.identifier = \"DOID:1793\" OR NOT n.name = \"pancreatic cancer\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound matches the InChIKey \"InChIKey=SIGSPDASOTUPFS-XUDSTZEESA-N\" and has a URL set as \"http://www.drugbank.ca/drugs/DB06730\" or is not called \"Gestodene\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=SIGSPDASOTUPFS-XUDSTZEESA-N\" AND (n.url = \"http://www.drugbank.ca/drugs/DB06730\" OR NOT n.name = \"Gestodene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find a compound that matches the InChIKey \"SLFGIOIONGJGRT-UHFFFAOYNA-N\", and either has the URL \"http://www.drugbank.ca/drugs/DB09000\" or does not have the name \"Cyamemazine\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=SLFGIOIONGJGRT-UHFFFAOYNA-N\" AND (n.url = \"http://www.drugbank.ca/drugs/DB09000\" OR NOT n.name = \"Cyamemazine\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of compounds that have a license of \"CC BY-NC 4.0,\" are sourced from DrugBank, or do not have the specific DrugBank URL \"http://www.drugbank.ca/drugs/DB06589\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.source = \"DrugBank\" OR NOT n.url = \"http://www.drugbank.ca/drugs/DB06589\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify any compounds where the InChI matches \"InChI=1S/C17H18N6/c18-7-5-15(12-3-1-2-4-12)23-10-13(9-22-23)16-14-6-8-19-17(14)21-11-20-16/h6,8-12,15H,1-5H2,(H,19,20,21)/t15-/m1/s1\" and either the InChIKey is \"InChIKey=HFNKQEVNSGCOJV-OAHLLOKOSA-N\" or the identifier is not \"DB08877\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C17H18N6/c18-7-5-15(12-3-1-2-4-12)23-10-13(9-22-23)16-14-6-8-19-17(14)21-11-20-16/h6,8-12,15H,1-5H2,(H,19,20,21)/t15-/m1/s1\" AND (n.inchikey = \"InChIKey=HFNKQEVNSGCOJV-OAHLLOKOSA-N\" OR NOT n.identifier = \"DB08877\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all anatomy nodes that hold the \"CC BY 3.0\" license and are either not named \"prostate gland\" or derived from Uberon.", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND (n.source = \"Uberon\" OR NOT n.name = \"prostate gland\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the genes located on chromosome 17 that either have the description \"DEAD (Asp-Glu-Ala-Asp) box helicase 5\" or do not have the name \"DDX5\"?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"17\" AND (n.description = \"DEAD (Asp-Glu-Ala-Asp) box helicase 5\" OR NOT n.name = \"DDX5\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy data points with a mesh_id of \"D011467\", which are either linked to the Uberon source or are not identified as \"UBERON:0002367\".", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D011467\" AND (n.source = \"Uberon\" OR NOT n.identifier = \"UBERON:0002367\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes on chromosome 16 whose description is \"cylindromatosis (turban tumor syndrome)\" or do not bear the name \"CYLD\".", "output": "MATCH (n:Gene) WHERE n.chromosome = \"16\" AND (n.description = \"cylindromatosis (turban tumor syndrome)\" OR NOT n.name = \"CYLD\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the compound with the specific URL \"http://www.drugbank.ca/drugs/DB00887\" that, besides having the identifier \"DB00887\", could also not be named \"Bumetanide\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00887\" AND (n.identifier = \"DB00887\" OR NOT n.name = \"Bumetanide\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all anatomy entities that are associated with the license \"CC BY 3.0\" and have a mesh ID of \"D010159\" or lack a bto_id of \"BTO:0001779\"?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND (n.mesh_id = \"D010159\" OR NOT n.bto_id = \"BTO:0001779\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene which has the URL \"http://identifiers.org/ncbigene/7007\" and either carries the name \"TECTA\" or belongs to a source apart from \"Entrez Gene.\"", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/7007\" AND (n.name = \"TECTA\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find details of a compound with the InChIKey \"XAXMYHMKTCNRRZ-UHFFFAOYSA-N\" if it originates from \"DrugBank\" or its URL is not \"http://www.drugbank.ca/drugs/DB01594\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=XAXMYHMKTCNRRZ-UHFFFAOYSA-N\" AND (n.source = \"DrugBank\" OR NOT n.url = \"http://www.drugbank.ca/drugs/DB01594\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information can we find about the disease node with the URL \"http://purl.obolibrary.org/obo/DOID_11612\" that either has the identifier \"DOID:11612\" or is not named \"polycystic ovary syndrome\"?", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_11612\" AND (n.identifier = \"DOID:11612\" OR NOT n.name = \"polycystic ovary syndrome\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the anatomy entities that are licensed under \"CC BY 3.0\" and either match the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\" or have a different identifier than \"UBERON:0002367\"?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND (n.url = \"http://purl.obolibrary.org/obo/UBERON_0002367\" OR NOT n.identifier = \"UBERON:0002367\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find anatomy entities from the \"Uberon\" source that either have the identifier \"UBERON:0002367\" or lack the BTO identifier \"BTO:0001129\"?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" AND (n.identifier = \"UBERON:0002367\" OR NOT n.bto_id = \"BTO:0001129\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find compounds with an InChI of \"InChI=1S/C22H25NO6/c1-12(24)23-16-8-6-13-10-19(27-3)21(28-4)22(29-5)20(13)14-7-9-18(26-2)17(25)11-15(14)16/h7,9-11,16H,6,8H2,1-5H3,(H,23,24)\" that are either from the \"DrugBank\" source or have a name other than \"Colchicine\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C22H25NO6/c1-12(24)23-16-8-6-13-10-19(27-3)21(28-4)22(29-5)20(13)14-7-9-18(26-2)17(25)11-15(14)16/h7,9-11,16H,6,8H2,1-5H3,(H,23,24)\" AND (n.source = \"DrugBank\" OR NOT n.name = \"Colchicine\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many compounds have the license \"CC BY-NC 4.0\" and match the criterion of having the InChIKey \"InChIKey=VSZGPKBBMSAYNT-RRFJBIMHSA-N\" or not having the identifier \"DB00198\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchikey = \"InChIKey=VSZGPKBBMSAYNT-RRFJBIMHSA-N\" OR NOT n.identifier = \"DB00198\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes on chromosome 10 that are either called \"conserved helix-loop-helix ubiquitous kinase\" or come from a source other than \"Entrez Gene.\"", "output": "MATCH (n:Gene) WHERE n.chromosome = \"10\" AND (n.description = \"conserved helix-loop-helix ubiquitous kinase\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the genes described as \"DDB1 and CUL4 associated factor 8\" with a URL of \"http://identifiers.org/ncbigene/50717\" or whose name is not \"DCAF8\"?", "output": "MATCH (n:Gene) WHERE n.description = \"DDB1 and CUL4 associated factor 8\" AND (n.url = \"http://identifiers.org/ncbigene/50717\" OR NOT n.name = \"DCAF8\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the diseases that have a license of \"CC BY 3.0\", are either from \"Disease Ontology\", or do not have the specified URL?", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND (n.source = \"Disease Ontology\" OR NOT n.url = \"http://purl.obolibrary.org/obo/DOID_0050156\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases have a license of \"CC BY 3.0\" and either have a URL of \"http://purl.obolibrary.org/obo/DOID_8778\" or are not named \"Crohn's disease\"?", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND (n.url = \"http://purl.obolibrary.org/obo/DOID_8778\" OR NOT n.name = \"Crohn's disease\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the pharmacologic classes with a class type of \"Mechanism of Action\", where the URL is \"http://purl.bioontology.org/ontology/NDFRT/N0000000236\" or the identifier is not \"N0000000236\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.class_type = \"Mechanism of Action\" AND (n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000000236\" OR NOT n.identifier = \"N0000000236\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the genes with a licensing of CC0 1.0 whose URL is either \"http://identifiers.org/ncbigene/81930\" or have a different name than \"KIF18A.\"", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.url = \"http://identifiers.org/ncbigene/81930\" OR NOT n.name = \"KIF18A\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve compounds that are licensed as \"CC BY-NC 4.0\" where the InChIKey is \"InChIKey=AAKJLRGGTJKAMG-UHFFFAOYSA-N\" or the identifier differs from \"DB00530\".", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchikey = \"InChIKey=AAKJLRGGTJKAMG-UHFFFAOYSA-N\" OR NOT n.identifier = \"DB00530\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the anatomy node labeled as \"prostate gland\" that either has the identifier \"UBERON:0002367\" or does not possess the BTO ID \"BTO:0001129\"?", "output": "MATCH (n:Anatomy) WHERE n.name = \"prostate gland\" AND (n.identifier = \"UBERON:0002367\" OR NOT n.bto_id = \"BTO:0001129\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical entities have the MeSH ID \"D011467\" and either have the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\" or are not named \"prostate gland\"?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D011467\" AND (n.url = \"http://purl.obolibrary.org/obo/UBERON_0002367\" OR NOT n.name = \"prostate gland\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What details can we find about the compound with the InChIKey \"CUIHSIWYWATEQL-UHFFFAOYSA-N\" if it's sourced from DrugBank or doesn't have the identifier \"DB06589\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=CUIHSIWYWATEQL-UHFFFAOYSA-N\" AND (n.source = \"DrugBank\" OR NOT n.identifier = \"DB06589\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds in the DrugBank source either match the identifier \"DB00500\" or have names other than \"Tolmetin\"?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" AND (n.identifier = \"DB00500\" OR NOT n.name = \"Tolmetin\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the pharmacologic classes sourced from the FDA through DrugCentral, and either have the specified URL or do not have the identifier N0000000109?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" AND (n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000000109\" OR NOT n.identifier = \"N0000000109\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are described by the InChI formula \"InChI=1S/C15H25NO3/c1-12(2)16-10-14(17)11-19-15-6-4-13(5-7-15)8-9-18-3/h4-7,12,14,16-17H,8-11H2,1-3H3\" and have an InChIKey of \"InChIKey=IUBSYMUCCVWXPE-UHFFFAOYSA-N\" or a different identifier than \"DB00264\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C15H25NO3/c1-12(2)16-10-14(17)11-19-15-6-4-13(5-7-15)8-9-18-3/h4-7,12,14,16-17H,8-11H2,1-3H3\" AND (n.inchikey = \"InChIKey=IUBSYMUCCVWXPE-UHFFFAOYSA-N\" OR NOT n.identifier = \"DB00264\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify genes with a CC0 1.0 license that have the name SERINC3 or are not from the source \"Entrez Gene.\"", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.name = \"SERINC3\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes have the license \"CC0 1.0\" and either have the URL \"http://identifiers.org/ncbigene/200909\" or are not sourced from \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.url = \"http://identifiers.org/ncbigene/200909\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find genes with a CC0 1.0 license that either have the description \"betacellulin\" or do not have the name \"BTC\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.description = \"betacellulin\" OR NOT n.name = \"BTC\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all compounds with the \"CC BY-NC 4.0\" license that possess the InChIKey \"FNKQXYHWGSIFBK-UHFFFAOYSA-N\" or have an identifier other than \"DB00360\"?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND (n.inchikey = \"InChIKey=FNKQXYHWGSIFBK-UHFFFAOYSA-N\" OR NOT n.identifier = \"DB00360\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find genes that are licensed under \"CC0 1.0\" and either have a specific URL of \"http://identifiers.org/ncbigene/2326\" or are linked to a source that is not \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.url = \"http://identifiers.org/ncbigene/2326\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which 'Gene' entities have the description \"growth factor receptor-bound protein 2\", are either called 'GRB2', or come from a source other than 'Entrez Gene'?", "output": "MATCH (n:Gene) WHERE n.description = \"growth factor receptor-bound protein 2\" AND (n.name = \"GRB2\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all genes with a \"CC0 1.0\" license where the chromosome is specifically 5 or the source is different from \"Entrez Gene.\"", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.chromosome = \"5\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve diseases listed in the Disease Ontology where their URL matches a given link, or their identifier is not \"DOID:1793\"?", "output": "MATCH (n:Disease) WHERE n.source = \"Disease Ontology\" AND (n.url = \"http://purl.obolibrary.org/obo/DOID_1793\" OR NOT n.identifier = \"DOID:1793\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of genes that possess a \"CC0 1.0\" license, and either have a description matching \"DEAD (Asp-Glu-Ala-Asp) box helicase 5\" or whose source is not \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND (n.description = \"DEAD (Asp-Glu-Ala-Asp) box helicase 5\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pharmacologic classes that are licensed under CC BY 4.0, and are either sourced from the FDA via DrugCentral or do not match the specific URL \"http://purl.bioontology.org/ontology/NDFRT/N0000175976\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" AND (n.source = \"FDA via DrugCentral\" OR NOT n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000175976\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes located on chromosome 11 either have the description of \"succinate dehydrogenase complex assembly factor 2\" or originate from sources other than \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"11\" AND (n.description = \"succinate dehydrogenase complex assembly factor 2\" OR NOT n.source = \"Entrez Gene\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find anatomy entities with the mesh identifier \"D004817\" where they are identified as \"UBERON:0001003\" or do not carry the bto_id \"BTO:0000404\"?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D004817\" AND (n.identifier = \"UBERON:0001003\" OR NOT n.bto_id = \"BTO:0000404\") RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find genes on chromosome 6 that have the URL \"http://identifiers.org/ncbigene/8342\" or come from a source other than \"Entrez Gene\"?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"6\" AND (n.url = \"http://identifiers.org/ncbigene/8342\" OR NOT n.source = \"Entrez Gene\") RETURN n"}]