[{"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers belong to pharmacologic classes with the class type \"Chemical/Ingredient\"?", "output": "MATCH (n:PharmacologicClass { class_type: \"Chemical/Ingredient\" }) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the identifier for a cellular component labeled as \"cell tip\"?", "output": "MATCH (n:CellularComponent { name: \"cell tip\" }) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular components have a CC BY 4.0 license, and what are their identifiers?", "output": "MATCH (n:CellularComponent { license: \"CC BY 4.0\" }) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are associated with the Gene Ontology as their source?", "output": "MATCH (n:CellularComponent { source: \"Gene Ontology\" }) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of biological processes sourced from the Gene Ontology?", "output": "MATCH (n:BiologicalProcess { source: \"Gene Ontology\" }) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifier for the pathway titled \"DNA Replication\"?", "output": "MATCH (n:Pathway { name: \"DNA Replication\" }) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the compound with the given InChI code \"InChI=1/C13H11N3O4/c14-7-3-1-2-6-10(7)13(20)16(12(6)19)8-4-5-9(17)15-11(8)18/h1-3,8H,4-5,14H2,(H,15,17,18)\" that shows binding to a gene.", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1/C13H11N3O4/c14-7-3-1-2-6-10(7)13(20)16(12(6)19)8-4-5-9(17)15-11(8)18/h1-3,8H,4-5,14H2,(H,15,17,18)\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene identifiers for genes that are described as \"STIP1 homology and U-box containing protein 1, E3 ubiquitin protein ligase\" and are participating in a cellular component.", "output": "MATCH (n:Gene) WHERE n.description = \"STIP1 homology and U-box containing protein 1, E3 ubiquitin protein ligase\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifier for the disease named \"type 2 diabetes mellitus\" that has any gene association via the \"ASSOCIATES_DaG\" relationship?", "output": "MATCH (n:Disease) WHERE n.name = \"type 2 diabetes mellitus\" AND EXISTS((n)-[:ASSOCIATES_DaG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound with the InChIKey equal to \"InChIKey=ZPEIMTDSQAKGNT-UHFFFAOYSA-N\" that downregulates any gene?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=ZPEIMTDSQAKGNT-UHFFFAOYSA-N\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify compounds, through their identifiers, that hold a \"CC BY-NC 4.0\" license and have an existing relationship with genes via the \"BINDS_CbG\" relationship.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifier of the compound named Ondansetron that is known to bind to genes?", "output": "MATCH (n:Compound) WHERE n.name = \"Ondansetron\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the gene called \"RIC8A\" that takes part in any pathway?", "output": "MATCH (n:Gene) WHERE n.name = \"RIC8A\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene associated with the URL \"http://identifiers.org/ncbigene/91133\" that is involved in a \"COVARIES_GcG\" relationship with a different gene, and return its identifier.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/91133\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the ID of the compound linked by a \"RESEMBLES_CrC\" relationship to another, that possesses the given InChI \"InChI=1S/C10H7N3S/c1-2-4-8-7(3-1)12-10(13-8)9-5-14-6-11-9/h1-6H,(H,12,13)\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C10H7N3S/c1-2-4-8-7(3-1)12-10(13-8)9-5-14-6-11-9/h1-6H,(H,12,13)\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the InChI identifier \"InChI=1S/C24H31NO/c1-23-11-9-18(26)14-17(23)5-6-19-21-8-7-20(16-4-3-13-25-15-16)24(21,2)12-10-22(19)23/h3-5,7,13,15,18-19,21-22,26H,6,8-12,14H2,1-2H3/t18-,19-,21-,22-,23-,24+/m0/s1\" that also has a relationship with a gene indicating it upregulates the gene?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C24H31NO/c1-23-11-9-18(26)14-17(23)5-6-19-21-8-7-20(16-4-3-13-25-15-16)24(21,2)12-10-22(19)23/h3-5,7,13,15,18-19,21-22,26H,6,8-12,14H2,1-2H3/t18-,19-,21-,22-,23-,24+/m0/s1\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifier does the compound with InChIKey \"InChIKey=XBPZXDSZHPDXQU-UHFFFAOYSA-N\" have, provided it is linked to another compound through a \"RESEMBLES_CrC\" relationship?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=XBPZXDSZHPDXQU-UHFFFAOYSA-N\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifier corresponds to the disease having the URL \"http://purl.obolibrary.org/obo/DOID_216\" that also has an ASSOCIATES_DaG connection to any gene?", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_216\" AND EXISTS((n)-[:ASSOCIATES_DaG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the compound associated with the InChIKey \"InChIKey=GIUYCYHIANZCFB-FJFJXFQQSA-N\" that also exhibits a binding interaction with a gene.", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=GIUYCYHIANZCFB-FJFJXFQQSA-N\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the gene with URL \"http://identifiers.org/ncbigene/5310\" that has a relationship indicating its participation in a cellular component.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/5310\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the name of the compound whose URL is \"http://www.drugbank.ca/drugs/DB01411\" and is involved in the palliation of a disease.", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB01411\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the compound with the name \"Miconazole\" that upregulates a gene.", "output": "MATCH (n:Compound) WHERE n.name = \"Miconazole\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers for genes described as \"transmembrane protein 14C\" that take part in any pathway?", "output": "MATCH (n:Gene) WHERE n.description = \"transmembrane protein 14C\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes having the description \"transmembrane protein 37\" that are part of pathways, and provide their identifiers.", "output": "MATCH (n:Gene) WHERE n.description = \"transmembrane protein 37\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compound, identified by the InChIKey \"InChIKey=NOYPYLRCIDNJJB-UHFFFAOYSA-N\", has a downregulation effect on a gene, and what is its corresponding identifier?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=NOYPYLRCIDNJJB-UHFFFAOYSA-N\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the disease with the specific URL \"http://purl.obolibrary.org/obo/DOID_10608\" that has a connection to a gene.", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_10608\" AND EXISTS((n)-[:ASSOCIATES_DaG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Fetch the identifier for the anatomy labeled as \"sweat gland\", given it has an expression connection to a gene. What would that be?", "output": "MATCH (n:Anatomy) WHERE n.name = \"sweat gland\" AND EXISTS((n)-[:EXPRESSES_AeG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of anatomy entities that have a \"CC BY 3.0\" license and have an influence on the expression of a gene?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND EXISTS((n)-[:UPREGULATES_AuG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the disease with the URL \"http://purl.obolibrary.org/obo/DOID_784\" that also upregulates at least one gene?", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_784\" AND EXISTS((n)-[:UPREGULATES_DuG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the gene labeled with the description \"regulatory factor X, 2 (influences HLA class II expression)\" that participates in a cellular component?", "output": "MATCH (n:Gene) WHERE n.description = \"regulatory factor X, 2 (influences HLA class II expression)\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the \"PTH\" gene that participates in any pathway?", "output": "MATCH (n:Gene) WHERE n.name = \"PTH\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the identifiers for compounds with a \"CC BY-NC 4.0\" license that have binding relationships with genes?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the URL \"http://www.drugbank.ca/drugs/DB06705\" that is known to palliate any disease?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB06705\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the anatomy entity that has a mesh_id of \"D017538\" and is involved in downregulating a gene?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D017538\" AND EXISTS((n)-[:DOWNREGULATES_AdG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier for the \"TMCC2\" gene that exerts regulatory influence over another gene?", "output": "MATCH (n:Gene) WHERE n.name = \"TMCC2\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all diseases with a \"CC BY 3.0\" license that are recorded as having connections to one or more symptoms.", "output": "MATCH (n:Disease) WHERE n.license = \"CC BY 3.0\" AND EXISTS((n)-[:PRESENTS_DpS]->(:Symptom)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes having the description \"sushi domain containing 6\" that also participate in at least one pathway?", "output": "MATCH (n:Gene) WHERE n.description = \"sushi domain containing 6\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound that has the InChI code \"InChI=1S/C66H103N17O16S/c1-9-35(6)52(69)66-81-48(32-100-66)63(97)76-43(26-34(4)5)59(93)74-42(22-23-50(85)86)58(92)83-53(36(7)10-2)64(98)75-40-20-15-16-25-71-55(89)46(29-49(68)84)78-62(96)47(30-51(87)88)79-61(95)45(28-39-31-70-33-72-39)77-60(94)44(27-38-18-13-12-14-19-38)80-65(99)54(37(8)11-3)82-57(91)41(21-17-24-67)73-56(40)90/h12-14,18-19,31,33-37,40-48,52-54H,9-11,15-17,20-30,32,67,69H2,1-8H3,(H2,68,84)(H,70,72)(H,71,89)(H,73,90)(H,74,93)(H,75,98)(H,76,97)(H,77,94)(H,78,96)(H,79,95)(H,80,99)(H,82,91)(H,83,92)(H,85,86)(H,87,88)/t35-,36-,37-,40-,41+,42+,43-,44+,45-,46-,47+,48-,52-,53-,54-/m0/s1\" and has a resemblance relationship to another compound?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C66H103N17O16S/c1-9-35(6)52(69)66-81-48(32-100-66)63(97)76-43(26-34(4)5)59(93)74-42(22-23-50(85)86)58(92)83-53(36(7)10-2)64(98)75-40-20-15-16-25-71-55(89)46(29-49(68)84)78-62(96)47(30-51(87)88)79-61(95)45(28-39-31-70-33-72-39)77-60(94)44(27-38-18-13-12-14-19-38)80-65(99)54(37(8)11-3)82-57(91)41(21-17-24-67)73-56(40)90/h12-14,18-19,31,33-37,40-48,52-54H,9-11,15-17,20-30,32,67,69H2,1-8H3,(H2,68,84)(H,70,72)(H,71,89)(H,73,90)(H,74,93)(H,75,98)(H,76,97)(H,77,94)(H,78,96)(H,79,95)(H,80,99)(H,82,91)(H,83,92)(H,85,86)(H,87,88)/t35-,36-,37-,40-,41+,42+,43-,44+,45-,46-,47+,48-,52-,53-,54-/m0/s1\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene identifiers do we have for genes located on chromosome 17 that regulate other genes through the \"REGULATES_GrG\" relationship?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"17\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers for genes that both come from the \"Entrez Gene\" source and regulate additional genes through the REGULATES_GrG relationship?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound with the URL \"http://www.drugbank.ca/drugs/DB00754\" that palliates at least one disease?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00754\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for any compound with the InChIKey \"InChIKey=GCKFUYQCUCGESZ-BPIQYHPVSA-N\" that is linked to another compound by a \"resembles\" relationship.", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=GCKFUYQCUCGESZ-BPIQYHPVSA-N\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifiers of compounds that possess a \"CC BY-NC 4.0\" license and are linked to other compounds through a resemblance relationship.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the gene with identifier \"221935\" that possesses a 'REGULATES_GrG' connection to any gene?", "output": "MATCH (n:Gene) WHERE n.identifier = \"221935\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that hold a \"CC BY-NC 4.0\" license and play a role in downregulating any gene.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the compound associated with the URL \"http://www.drugbank.ca/drugs/DB00499\" if it has any connections showing it treats diseases.", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00499\" AND EXISTS((n)-[:TREATS_CtD]->(:Disease)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases, sourced from the Disease Ontology, are known to upregulate any gene?", "output": "MATCH (n:Disease) WHERE n.source = \"Disease Ontology\" AND EXISTS((n)-[:UPREGULATES_DuG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the name of the compound with the ID \"DB01173\" that has a connection to a gene through a binding pathway.", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB01173\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the identifier \"DB00567\" that binds to a gene?", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB00567\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds whose license is \"CC BY-NC 4.0\" and who have a direct role in the upregulation of a gene.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier for the compound known as \"Isosorbide Mononitrate\" that has a binding relationship with any gene in the database?", "output": "MATCH (n:Compound) WHERE n.name = \"Isosorbide Mononitrate\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the identifier of the gene associated with the URL \"http://identifiers.org/ncbigene/400713\" that takes part in a pathway.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/400713\" AND EXISTS((n)-[:PARTICIPATES_GpPW]->(:Pathway)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes with a CC0 1.0 license that are part of cellular components and provide their names.", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier for the gene with the specified URL that is participating in some biological process?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/23053\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound with the identifier \"DB06335\" that is known to bind to any gene?", "output": "MATCH (n:Compound) WHERE n.identifier = \"DB06335\" AND EXISTS((n)-[:BINDS_CbG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the gene identifiers for \"Entrez Gene\" that have a participation relationship with any cellular component.", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound with the InChI \"InChI=1S/C14H13N5O5S2/c1-2-5-3-25-12-8(11(21)19(12)9(5)13(22)23)17-10(20)7(18-24)6-4-26-14(15)16-6/h2,4,8,12,24H,1,3H2,(H2,15,16)(H,17,20)(H,22,23)/b18-7-/t8-,12-/m1/s1\" that is known to treat any disease?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C14H13N5O5S2/c1-2-5-3-25-12-8(11(21)19(12)9(5)13(22)23)17-10(20)7(18-24)6-4-26-14(15)16-6/h2,4,8,12,24H,1,3H2,(H2,15,16)(H,17,20)(H,22,23)/b18-7-/t8-,12-/m1/s1\" AND EXISTS((n)-[:TREATS_CtD]->(:Disease)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that possess a CC BY-NC 4.0 license and have been established to treat diseases.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:TREATS_CtD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we find the identifier of \"GRID1\" that is involved in regulation of another gene within the database?", "output": "MATCH (n:Gene) WHERE n.name = \"GRID1\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of genes found on chromosome 17 that are associated with a biological process.", "output": "MATCH (n:Gene) WHERE n.chromosome = \"17\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifier of a compound that has an InChI equivalence of \"InChI=1S/C7H7NO3/c8-4-1-2-5(7(10)11)6(9)3-4/h1-3,9H,8H2,(H,10,11)\" and is linked to a side effect?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C7H7NO3/c8-4-1-2-5(7(10)11)6(9)3-4/h1-3,9H,8H2,(H,10,11)\" AND EXISTS((n)-[:CAUSES_CcSE]->(:SideEffect)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that are allowed to be used under the \"CC BY-NC 4.0\" license and are connected to disease palliation.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entities with a \"CC BY 3.0\" license are involved in downregulating any genes, and what are their identifiers?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" AND EXISTS((n)-[:DOWNREGULATES_AdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the \"TPST2\" gene that exhibits a genetic covariance relationship with any other gene.", "output": "MATCH (n:Gene) WHERE n.name = \"TPST2\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the \"Anatomy\" node with the mesh_id \"D020771\" that has an outgoing \"DOWNREGULATES_AdG\" relationship to a gene node?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D020771\" AND EXISTS((n)-[:DOWNREGULATES_AdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the identifiers of compounds that possess the \"CC BY-NC 4.0\" license and demonstrate a palliative relationship with any disease.", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For genes labeled with source 'Entrez Gene', which ones have associations via COVARIES_GcG with other genes, and what are their respective identifiers?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifiers of pharmacologic classes originating from \"FDA via DrugCentral\" that currently contain compounds?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" AND EXISTS((n)-[:INCLUDES_PCiC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the anatomy entity with the mesh ID \"D004728\" that is linked to a gene through a downregulation relationship?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D004728\" AND EXISTS((n)-[:DOWNREGULATES_AdG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the anatomical entity with MeSH ID \"D011150\" that is involved in upregulating any genes, and provide its name?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D011150\" AND EXISTS((n)-[:UPREGULATES_AuG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the compound with the URL \"http://www.drugbank.ca/drugs/DB01245\" that resembles another compound?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB01245\" AND EXISTS((n)-[:RESEMBLES_CrC]->(:Compound)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the database, what is the identifier for the compound with the URL \"http://www.drugbank.ca/drugs/DB01117\" that has interactions leading to gene downregulation?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB01117\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the unique identifier for a compound with the given InChI that interacts through downregulation with a gene?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C17H20N2O2/c1-2-19(12-14-8-10-18-11-9-14)17(21)16(13-20)15-6-4-3-5-7-15/h3-11,16,20H,2,12-13H2,1H3\" AND EXISTS((n)-[:DOWNREGULATES_CdG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the name of the disease corresponding to the URL \"http://purl.obolibrary.org/obo/DOID_11239\" that presents any symptoms.", "output": "MATCH (n:Disease) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_11239\" AND EXISTS((n)-[:PRESENTS_DpS]->(:Symptom)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the gene node that not only has a URL of \"http://identifiers.org/ncbigene/54991\" but also maintains a regulatory link with a different gene.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/54991\" AND EXISTS((n)-[:REGULATES_GrG]->(:Gene)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier for the gene at \"http://identifiers.org/ncbigene/105379433\" that takes part in any biological processes.", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/105379433\" AND EXISTS((n)-[:PARTICIPATES_GpBP]->(:BiologicalProcess)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the disease named \"lymphatic system cancer\" that is known to localize in any anatomical region?", "output": "MATCH (n:Disease) WHERE n.name = \"lymphatic system cancer\" AND EXISTS((n)-[:LOCALIZES_DlA]->(:Anatomy)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names can be found for those genes that have a \"CC0 1.0\" license and take part in cellular components?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names with a \"CC BY-NC 4.0\" license that have been identified to palliate diseases?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound that has the URL \"http://www.drugbank.ca/drugs/DB00450\" and is known to treat at least one disease?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00450\" AND EXISTS((n)-[:TREATS_CtD]->(:Disease)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the gene names from the \"Entrez Gene\" source that are linked by a COVARIES_GcG relationship to another gene?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" AND EXISTS((n)-[:COVARIES_GcG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of compounds that hold a \"CC BY-NC 4.0\" license and have a relationship of upregulating genes?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:UPREGULATES_CuG]->(:Gene)) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the gene with the provided URL that participates in any association with a cellular component and return its identifier?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/100288908\" AND EXISTS((n)-[:PARTICIPATES_GpCC]->(:CellularComponent)) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds with a \"CC BY-NC 4.0\" license that also have a palliative relationship with some disease?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" AND EXISTS((n)-[:PALLIATES_CpD]->(:Disease)) RETURN n.name"}]