[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with the identifier DB00530?", "output": "MATCH (:Compound{identifier: \"DB00530\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are upregulated by the compound with the identifier \"DB00846\"?", "output": "MATCH (:Compound{identifier: \"DB00846\"})-[:UPREGULATES_CuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of all compounds that negatively regulate the gene with the name HMG20B.", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"HMG20B\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene identified as COX8A?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"COX8A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene named \"LAP3\"?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"LAP3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene named \"PUF60\"?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"PUF60\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene named TIMM9?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"TIMM9\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of compounds that function to downregulate the gene \"ZFP36\"?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"ZFP36\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene called PSMD2?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"PSMD2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene named CCDC86?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"CCDC86\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene with the identifier ZNF395?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"ZNF395\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene EIF4EBP1?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"EIF4EBP1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene identified as \"CCNB2\"?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"CCNB2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds downregulate genes on chromosome 16, according to their names?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"16\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene HMGCS1?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"HMGCS1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to downregulate the gene named BRCA1?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"BRCA1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate genes located on the X chromosome?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"X\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene GDF15?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"GDF15\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What compounds are involved in the downregulation relationship with the gene with the name VPS28, and what are their names?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"VPS28\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene named PXN?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"PXN\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds downregulate genes on chromosome 17, and what are their names?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene DNAJB2?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"DNAJB2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate genes located on the X chromosome?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"X\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate genes located on chromosome 17?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene known as UGDH?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"UGDH\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate the gene TMED10?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"TMED10\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that downregulate the gene named HOMER2?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"HOMER2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate any gene located on the X chromosome?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"X\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds downregulate the gene with the name \"ALAS1\"?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"ALAS1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the names of compounds that are linked to the downregulation of the UBE2A gene?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{name: \"UBE2A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that downregulate genes located on the Y chromosome?", "output": "MATCH (d:Compound)-[:DOWNREGULATES_CdG]->(:Gene{chromosome: \"Y\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB01115\"?", "output": "MATCH (:Compound{identifier: \"DB01115\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB01064\"?", "output": "MATCH (:Compound{identifier: \"DB01064\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are returned when looking for those downregulated by the compound having the identifier \"DB00960\"?", "output": "MATCH (:Compound{identifier: \"DB00960\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB01394\"?", "output": "MATCH (:Compound{identifier: \"DB01394\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with identifier \"DB01076\"?", "output": "MATCH (:Compound{identifier: \"DB01076\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB01578\"?", "output": "MATCH (:Compound{identifier: \"DB01578\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are downregulated by the compound with the identifier \"DB00432\"?", "output": "MATCH (:Compound{identifier: \"DB00432\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00322\"?", "output": "MATCH (:Compound{identifier: \"DB00322\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with identifier \"DB00446\"?", "output": "MATCH (:Compound{identifier: \"DB00446\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00154\"?", "output": "MATCH (:Compound{identifier: \"DB00154\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00972\"?", "output": "MATCH (:Compound{identifier: \"DB00972\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00733\"?", "output": "MATCH (:Compound{identifier: \"DB00733\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes downregulated by the compound with the identifier \"DB01611\"?", "output": "MATCH (:Compound{identifier: \"DB01611\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the gene names that Dihomo-gamma-linolenic acid downregulates.", "output": "MATCH (:Compound{name: \"Dihomo-gamma-linolenic acid\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are downregulated by the compound with the identifier \"DB01165\"?", "output": "MATCH (:Compound{identifier: \"DB01165\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00530\"?", "output": "MATCH (:Compound{identifier: \"DB00530\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the identifier \"DB00748\"?", "output": "MATCH (:Compound{identifier: \"DB00748\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are downregulated by the compound with the identifier \"DB01158\"?", "output": "MATCH (:Compound{identifier: \"DB01158\"})-[:DOWNREGULATES_CdG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the compound names that have a relationship indicating they bind to the gene CYP2C18.", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP2C18\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"CYP11B1\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP11B1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"ABCC4\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"ABCC4\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have a binding relationship with the gene named GAA, and what are their names?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"GAA\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene called MAP3K3?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"MAP3K3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"GABRG1\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"GABRG1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named CYP2C9?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP2C9\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that have a binding relationship with the gene named NR3C1?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"NR3C1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named ABCC4?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"ABCC4\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"SLC22A6\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"SLC22A6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene KCNH2?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"KCNH2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that have a binding relationship with the gene \"VDAC1\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"VDAC1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that bind to the gene named SLC15A2?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"SLC15A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that bind to the gene named PDE5A?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"PDE5A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named CACNA1S?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CACNA1S\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that bind to the gene named CACNA1A?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CACNA1A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene ALDH1A2?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"ALDH1A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and name the compounds that bind to any gene residing on the third chromosome.", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{chromosome: \"3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"CYP2E1\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP2E1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to genes located on the X chromosome?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{chromosome: \"X\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene labeled as \"SLC22A2\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"SLC22A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have a binding interaction with the gene named SLC6A2.", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"SLC6A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named CYP2D6?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP2D6\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that have a binding interaction with the gene named HTR3A.", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"HTR3A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene \"ADORA2A\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"ADORA2A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that bind to the gene named \"CYP1A2\"?", "output": "MATCH (d:Compound)-[:BINDS_CbG]->(:Gene{name: \"CYP1A2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have a binding relationship with the compound with identifier \"DB01115.\"", "output": "MATCH (:Compound{identifier: \"DB01115\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of genes that have a binding relationship with the compound labeled \"DB00360\"?", "output": "MATCH (:Compound{identifier: \"DB00360\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind to the compound with identifier \"DB00455\"?", "output": "MATCH (:Compound{identifier: \"DB00455\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes that have a binding relationship with the compound \"DB00802.\"", "output": "MATCH (:Compound{identifier: \"DB00802\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names connected by a binding relationship to the compound with ID \"DB00841.\"", "output": "MATCH (:Compound{identifier: \"DB00841\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that bind to the compound with the identifier \"DB00852\"?", "output": "MATCH (:Compound{identifier: \"DB00852\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have a binding relationship with the compound marked by the identifier \"DB00133\".", "output": "MATCH (:Compound{identifier: \"DB00133\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that bind to the compound with the identifier \"DB01076\"?", "output": "MATCH (:Compound{identifier: \"DB01076\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind to the compound with the identifier \"DB08877\"?", "output": "MATCH (:Compound{identifier: \"DB08877\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that form a binding connection with the compound whose identifier is \"DB00853\".", "output": "MATCH (:Compound{identifier: \"DB00853\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are linked through a binding relationship to the compound with identifier \"DB00732\"?", "output": "MATCH (:Compound{identifier: \"DB00732\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are associated with the compound having the identifier \"DB01173\" through a binding relationship?", "output": "MATCH (:Compound{identifier: \"DB01173\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the compound with identifier \"DB00549\" can bind to?", "output": "MATCH (:Compound{identifier: \"DB00549\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names can be retrieved from the gene-compound binding relationship for the compound \"DB01148\"?", "output": "MATCH (:Compound{identifier: \"DB01148\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind with the compound named \"Tretinoin\"?", "output": "MATCH (:Compound{name: \"Tretinoin\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind with the compound identified as \"DB01165\"?", "output": "MATCH (:Compound{identifier: \"DB01165\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are returned when finding genes bound to the compound L-Glutamine?", "output": "MATCH (:Compound{name: \"L-Glutamine\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are linked to the compound with the identifier \"DB00993\" through a binding relationship.", "output": "MATCH (:Compound{identifier: \"DB00993\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have a binding relationship with the compound known as Azelastine.", "output": "MATCH (:Compound{name: \"Azelastine\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that the compound with the identifier \"DB01064\" binds to in the database?", "output": "MATCH (:Compound{identifier: \"DB01064\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene names that have a binding relationship with the compound named Ticlopidine?", "output": "MATCH (:Compound{name: \"Ticlopidine\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind with the compound identified as \"DB00972\"?", "output": "MATCH (:Compound{identifier: \"DB00972\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind with the compound identified as \"DB00198\"?", "output": "MATCH (:Compound{identifier: \"DB00198\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are bound by the compound with the identifier \"DB00246\"?", "output": "MATCH (:Compound{identifier: \"DB00246\"})-[:BINDS_CbG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect known as hepatic steatosis?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Hepatic steatosis\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the compound names that are linked to side effects, specifically the one with identifier \"C0853750\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0853750\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect identified as a duodenal ulcer?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Duodenal ulcer\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to cause atrial fibrillation as a side effect?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Atrial fibrillation\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of compounds result in the adverse effect known as photosensitivity reaction?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Photosensitivity reaction\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are known to cause the side effect called Hypogeusia?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Hypogeusia\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect with the identifier \"C0013390\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0013390\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that can cause the side effect of Tachycardia?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Tachycardia\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the compounds that result in the side effect associated with the identifier \"C0042571\".", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0042571\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect known as 'Hepatic necrosis'?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Hepatic necrosis\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that lead to the side effect with the identifier \"C0151905\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0151905\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that result in the side effect known as \"Muscle spasms\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Muscle spasms\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect with the identifier \"C0497156\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0497156\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds that trigger the side effect termed as mental disability.", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Mental disability\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect of increased blood lactate dehydrogenase?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Blood lactate dehydrogenase increased\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that cause the side effect with the identifier \"C0262977\"?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{identifier: \"C0262977\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are linked to causing posterior reversible encephalopathy syndrome?", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Posterior reversible encephalopathy syndrome\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all compounds that are associated with the occurrence of the side effect \"Diarrhoea.\"", "output": "MATCH (d:Compound)-[:CAUSES_CcSE]->(:SideEffect{name: \"Diarrhoea\"}) RETURN d.name"}]