[{"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers linked by an \"EXPRESSES_AeG\" relationship from anatomy nodes not associated with the \"Uber\" source? ", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.source <> \"Uber\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of unique diseases linked to compounds through the PALLIATES_CpD relationship, where the compound's name isn't \"Acet\"?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.name <> \"Acet\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct diseases linked by a \"RESEMBLES_DrD\" relationship to another disease, where the originating disease does not have an identifier of \"DOID\"?", "output": "MATCH (n:Disease)-[r1:RESEMBLES_DrD]->(m:Disease) WHERE n.identifier <> \"DOID\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique disease identifiers are connected to compounds through the relationship 'PALLIATES_CpD', excluding compounds with the source labeled as 'Drug'?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.source <> \"Drug\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene names are there that are connected to genes located on chromosomes other than chromosome 7 through a \"COVARIES_GcG\" relationship?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.chromosome <> \"7\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of unique gene identifiers linked via the ASSOCIATES_DaG relationship to diseases that lack a \"CC B\" license?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene names are associated with any compound through the BINDS_CbG relationship, given that the compound's InChI identifier is not exactly \"InCh\"?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.inchi <> \"InCh\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct anatomy identifiers are associated with diseases that do not come from the \"Dise\" source via the LOCALIZES_DlA relationship?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.source <> \"Dise\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique molecular function identifiers are associated with genes that have a URL other than \"http\" through the PARTICIPATES_GpMF relationship?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct disease identifiers are linked to compounds with a license other than \"CC B\" through the TREATS_CtD relationship?", "output": "MATCH (n:Compound)-[r1:TREATS_CtD]->(m:Disease) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique gene names that are regulated through 'REGULATES_GrG' relationships by genes positioned on chromosomes other than the X chromosome?", "output": "MATCH (n:Gene)-[r1:REGULATES_GrG]->(m:Gene) WHERE n.chromosome <> \"X\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene names associated with upregulation by diseases, ignoring diseases with the identifier \"DOID\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.identifier <> \"DOID\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What's the total number of distinct gene identifiers affected by the DOWNREGULATES_CdG relationship, when not considering the compound \"DB00\"?", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct genes that are upregulated by diseases, considering only diseases that do not have a URL equal to \"http\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct anatomy entities localized by diseases, excluding those where the disease's URL is \"http\"?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the unique genes that have an \"UPREGULATES_AuG\" relationship from anatomy nodes, provided those anatomy nodes do not have a BTO ID of \"BTO:\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.bto_id <> \"BTO:\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers linked to anatomy nodes, where the source does not equal Uber?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.source <> \"Uber\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct genes are expressed by anatomy entities that do not have a URL tagged as \"http\"?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene identifiers are upregulated by anatomy nodes that do not have the MeSH ID \"D011\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.mesh_id <> \"D011\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique names of genes that are upregulated by anatomical parts not labeled with the identifier \"UBER\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.identifier <> \"UBER\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinctive anatomy identifiers involved in disease localization, considering only those diseases with licenses other than \"CC B\"?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique genes are expressed by anatomical elements, with the condition that the anatomy identifier is not \"UBER\"?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.identifier <> \"UBER\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene identifiers that are downregulated by diseases, excluding those named \"panc\"?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name <> \"panc\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct identifiers for genes that take part in interactions with other genes, excluding those where the interacting gene's source is \"Entr\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.source <> \"Entr\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct identifiers for genes that are bound by compounds with a license other than CC B?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct anatomy names linked to diseases holding a license other than \"CC B\"?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct cellular component identifiers that are connected to genes excluding those whose description is \"heat\"?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.description <> \"heat\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the unique identifiers of genes that are downregulated by any disease not holding a \"CC B\" license?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of unique anatomy entities where diseases, excluding those with the identifier \"DOID,\" are localized?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.identifier <> \"DOID\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique identifiers for diseases that have a resemblance relationship, where the original disease's license is not \"CC B\"?", "output": "MATCH (n:Disease)-[r1:RESEMBLES_DrD]->(m:Disease) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct genes affected by diseases, excluding the one specifically named \"panc,\" via upregulation connections?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.name <> \"panc\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the unique count of interacting gene names associated with genes that do not belong to chromosome 17?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.chromosome <> \"17\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct anatomy identifiers connected to diseases from sources other than \"Dise\" through the localization relationship?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.source <> \"Dise\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you determine the count of unique genes whose identifiers are upregulated by any disease except the one identified as \"DOID\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.identifier <> \"DOID\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct symptom identifiers linked to diseases excluding those with a \"CC B\" license?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you count the number of different genes that are subject to downregulation by anatomical structures whose BTO ID is not \"BTO:\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.bto_id <> \"BTO:\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene names influenced by downregulation from anatomy nodes, excluding those with a MeSH ID of \"D011\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.mesh_id <> \"D011\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of different genes that participate in a COVARIES_GcG relationship with gene nodes other than \"ZSCA\"?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.name <> \"ZSCA\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers affected by diseases with names other than \"panc\" through downregulation?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name <> \"panc\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers that have interactions with any gene except \"DDX5\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.name <> \"DDX5\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene names does the \"IL2\" gene co-vary with through the \"COVARIES_GcG\" relationship?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.name <> \"IL2\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique genes expressed by anatomy items that do not have a BTO ID matching \"BTO:\"?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.bto_id <> \"BTO:\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct genes downregulated by any compound, as long as the compound's identifier is not \"DB00\"?", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique compound names that are connected through a 'RESEMBLES_CrC' relationship to compounds with an InChI key different from \"InCh\"?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.inchikey <> \"InCh\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct disease identifiers treated by compounds when the compound's URL is not \"http\"?", "output": "MATCH (n:Compound)-[r1:TREATS_CtD]->(m:Disease) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you determine the number of different anatomy names that are localized by diseases, provided the disease name isn't \"vasc\"?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.name <> \"vasc\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many distinct gene identifiers are there which are downregulated by anatomical entities, excluding those entities with a Mesh ID equal to \"D011\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.mesh_id <> \"D011\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique gene names connected through interactions with genes excluding those described as \"golg\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.description <> \"golg\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct compound identifiers found in pharmacologic classes excluding those with a \"CC B\" license?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of different anatomy names linked to diseases where the disease's URL is not \"http\"?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct genes that are downregulated due to relationships with anatomy items excluding those with a CC B license?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene identifiers are there for genes that are upregulated by anatomical entities, with the constraint that the source of those entities is not 'Uber'?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.source <> \"Uber\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene names are upregulated by diseases with a license other than \"CC B\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct symptom identifiers linked to diseases where the URL does not match \"http\"?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique gene identifiers that compounds with a license different from \"CC B\" have an effect on through downregulation?", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers for genes that are upregulated by any compound except those labeled as \"Drug\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.source <> \"Drug\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique genes that are downregulated by diseases which are not sourced from \"Dise\"?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.source <> \"Dise\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene names that have interactions with genes excluding those with the URL \"http\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of different gene names downregulated by anatomical nodes, considering only those anatomical nodes without the URL \"http\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct pathway identifiers for pathways linked to genes that do not have a \"CC0\" license?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.license <> \"CC0 \" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique cellular component identifiers to which genes are related, given that the gene description does not equal \"zinc\"?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.description <> \"zinc\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique gene identifiers are regulated in an upregulating manner by anatomical entries excluding those with a \"CC B\" license?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the number of different genes influenced by anatomy nodes, given that the license is not \"CC B\", using the \"UPREGULATES_AuG\" relation?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of unique disease names associated with compounds that have a non-\"Drug\" source and provide palliative effects?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.source <> \"Drug\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct genes that are bound by any compound, except the one with the identifier \"DB00\"?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct pathway names associated with genes that do not have the CC0 license?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.license <> \"CC0 \" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers regulated positively by anatomy nodes excluding those identified as \"UBER\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.identifier <> \"UBER\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers upregulated by compounds, other than the compound identified as \"DB00\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique genes that are upregulated by any anatomical component, provided the component's name is not \"pros\"?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) WHERE n.name <> \"pros\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct gene identifiers that are regulated by other genes, excluding those with the description \"auto\"?", "output": "MATCH (n:Gene)-[r1:REGULATES_GrG]->(m:Gene) WHERE n.description <> \"auto\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct symptoms presented by diseases that are not named 'spin'?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.name <> \"spin\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct gene names expressed in anatomical nodes that are not named \"pros\"?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) WHERE n.name <> \"pros\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the number of distinct gene identifiers that are upregulated by compounds where the URL is not equal to \"http\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you calculate the number of unique compound identifiers that belong to pharmacologic classes with a URL not equal to \"http\"?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.url <> \"http\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total count of distinct pathway identifiers associated with genes other than the one named CRK?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.name <> \"CRK\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct biological process identifiers associated with genes whose name is not RIPK?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) WHERE n.name <> \"RIPK\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of unique compound identifiers associated with pharmacologic classes that do not have the identifier \"N000\"?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.identifier <> \"N000\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of unique genes that are upregulated by any compound with an InChIKey not equal to \"InCh\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.inchikey <> \"InCh\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of distinct identifiers for compounds that resemble other compounds, excluding those compounds with a \"CC B\" license?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.license <> \"CC B\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique disease identifiers are treated by compounds that do not have the identifier \"DB00\"?", "output": "MATCH (n:Compound)-[r1:TREATS_CtD]->(m:Disease) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many unique disease identifiers are there in the network of palliative connections with compounds, excluding those associated with the compound \"Cele\"?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.name <> \"Cele\" RETURN COUNT(DISTINCT(m.identifier))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the total number of distinct gene names upregulated through interactions with compounds excluding those with the identifier \"DB00\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.identifier <> \"DB00\" RETURN COUNT(DISTINCT(m.name))"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the license detail for each symptom entered in our database?", "output": "MATCH (n:Symptom) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the license assigned to each of the BiologicalProcess entities in the database?", "output": "MATCH (n:BiologicalProcess) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find out the license attribute for every disease entity stored?", "output": "MATCH (n:Disease) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifier for every Pathway record within the database?", "output": "MATCH (n:Pathway) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of all symptoms stored in the database?", "output": "MATCH (n:Symptom) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the license values for all nodes labeled with 'CellularComponent'?", "output": "MATCH (n:CellularComponent) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the class_type values of all nodes labeled as PharmacologicClass?", "output": "MATCH (n:PharmacologicClass) RETURN n.class_type"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifiers for every cellular component in this database?", "output": "MATCH (n:CellularComponent) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the license details for each Anatomy node?", "output": "MATCH (n:Anatomy) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the license attributes for all nodes labeled as \"Compound\"?", "output": "MATCH (n:Compound) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the license field from all \"Gene\" nodes?", "output": "MATCH (n:Gene) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the URL property for every 'Pathway' entity in the database?", "output": "MATCH (n:Pathway) RETURN n.url"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the names of each biological process in the dataset?", "output": "MATCH (n:BiologicalProcess) RETURN n.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the source information for every gene node within the dataset.", "output": "MATCH (n:Gene) RETURN n.source"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the licenses for all pharmacologic classes?", "output": "MATCH (n:PharmacologicClass) RETURN n.license"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier property of every PharmacologicClass type node?", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the chromosome information for each gene?", "output": "MATCH (n:Gene) RETURN n.chromosome"}]