[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct names of cellular components that the gene with the description \"chromosome 2 open reading frame 42\" is involved with, sorted in descending order?", "output": "MATCH (n:Gene { description: \"chromosome 2 open reading frame 42\" })-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct gene names that experience downregulation from the Anatomy entity with the identifier \"BTO:0001129\", and how are these names arranged in reverse alphabetical order?", "output": "MATCH (n:Anatomy { bto_id: \"BTO:0001129\" })-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of all unique compounds associated with the pharmacologic class at \"http://purl.bioontology.org/ontology/NDFRT/N0000185607\", and display them in descending order.", "output": "MATCH (n:PharmacologicClass { url: \"http://purl.bioontology.org/ontology/NDFRT/N0000185607\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique compound identifiers are related to the pharmacologic class with the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000175976\", when ordered in descending order?", "output": "MATCH (n:PharmacologicClass { url: \"http://purl.bioontology.org/ontology/NDFRT/N0000175976\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of the genes that are distinctively upregulated by the anatomy entity with the identifier BTO:0001129, ordered highest to lowest?", "output": "MATCH (n:Anatomy { bto_id: \"BTO:0001129\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes whose identifiers appear in descending order due to being upregulated by the compound located at the URL \"http://www.drugbank.ca/drugs/DB00305\".", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB00305\" })-[r:UPREGULATES_CuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct gene identifiers are shown when querying for expressions linked to the anatomy node with a BTO ID of \"BTO:0000122\", with the results sorted in reverse order?", "output": "MATCH (n:Anatomy { bto_id: \"BTO:0000122\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the collection of distinct compound names linked to the Neurokinin 1 Antagonists class, with the names organized in descending order?", "output": "MATCH (n:PharmacologicClass { name: \"Neurokinin 1 Antagonists\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of pathways associated with genes located on chromosome 5, listed in descending order?", "output": "MATCH (n:Gene { chromosome: \"5\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of pathways that genes located on chromosome 9 are involved in, listed in descending order?", "output": "MATCH (n:Gene { chromosome: \"9\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names can be found among those palliated by compounds coming from DrugBank, presented in reverse alphabetical order?", "output": "MATCH (n:Compound { source: \"DrugBank\" })-[r:PALLIATES_CpD]->(m:Disease) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find, in reverse alphabetical order, the names of genes that the anatomy entity having mesh_id \"D011467\" acts to downregulate?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" })-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve up to five pathway names ordered in ascending alphabetical order?", "output": "MATCH (n:Pathway) RETURN n.name ORDER BY n.name ASC LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve and order the initial nine identifiers for nodes labeled as CellularComponent?", "output": "MATCH (n:CellularComponent) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the top five anatomical nodes when sorted in descending order by name?", "output": "MATCH (n:Anatomy) RETURN n.name ORDER BY n.name DESC LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you extract and display the identifiers of the final seven diseases if sorted by their identifiers in decreasing order?", "output": "MATCH (n:Disease) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the identifier of the Anatomy node with the highest value when ordered in descending order?", "output": "MATCH (n:Anatomy) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the first four identifiers of MolecularFunction nodes starting from the largest in reverse alphabetical order?", "output": "MATCH (n:MolecularFunction) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of up to nine pharmacologic class nodes arranged alphabetically?", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which three anatomy node identifiers come first when sorted in alphabetical order?", "output": "MATCH (n:Anatomy) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which four disease nodes have the smallest identifiers when ordered from smallest to largest?", "output": "MATCH (n:Disease) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway identifiers appear among the last ten when sorted in descending order?", "output": "MATCH (n:Pathway) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which 10 cellular component identifiers appear last when sorted in descending order?", "output": "MATCH (n:CellularComponent) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the identifiers of the first ten genes when sorted in ascending order?", "output": "MATCH (n:Gene) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic class names appear first when sorted in ascending order, and what are they?", "output": "MATCH (n:PharmacologicClass) RETURN n.name ORDER BY n.name ASC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the six genes that come first when sorted in descending order by name?", "output": "MATCH (n:Gene) RETURN n.name ORDER BY n.name DESC LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the first four anatomy nodes when ordered alphabetically?", "output": "MATCH (n:Anatomy) RETURN n.name ORDER BY n.name ASC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers of the top seven pharmacologic classes based on descending order?", "output": "MATCH (n:PharmacologicClass) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which six cellular component names come last when sorted in reverse alphabetical order?", "output": "MATCH (n:CellularComponent) RETURN n.name ORDER BY n.name DESC LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which five gene identifiers come first if we arrange them from highest to lowest?", "output": "MATCH (n:Gene) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of seven molecular function names when sorted in descending order by their names?", "output": "MATCH (n:MolecularFunction) RETURN n.name ORDER BY n.name DESC LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the identifiers of four pathways sorted by their identifiers, starting from the lowest?", "output": "MATCH (n:Pathway) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of pharmacologic classes are returned when ordered from Z to A, limited to three results?", "output": "MATCH (n:PharmacologicClass) RETURN n.name ORDER BY n.name DESC LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the last six biological process names sorted alphabetically in reverse order?", "output": "MATCH (n:BiologicalProcess) RETURN n.name ORDER BY n.name DESC LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which three symptom names appear first when ordering all symptom names in reverse alphabetical order?", "output": "MATCH (n:Symptom) RETURN n.name ORDER BY n.name DESC LIMIT 3"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the ordered list of the first four disease names when sorted from A to Z?", "output": "MATCH (n:Disease) RETURN n.name ORDER BY n.name ASC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the first cellular component's name in alphabetical order according to this database?", "output": "MATCH (n:CellularComponent) RETURN n.name ORDER BY n.name ASC LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which seven symptoms come first when you arrange all symptom names in ascending order?", "output": "MATCH (n:Symptom) RETURN n.name ORDER BY n.name ASC LIMIT 7"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function has the smallest identifier when the identifiers are sorted in ascending order?", "output": "MATCH (n:MolecularFunction) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which six compound identifiers appear first if sorted in descending order?", "output": "MATCH (n:Compound) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 6"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the first couple of gene names when ordered from least to greatest by name?", "output": "MATCH (n:Gene) RETURN n.name ORDER BY n.name ASC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we obtain the identifiers of the four latest symptoms listed from highest to lowest?", "output": "MATCH (n:Symptom) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which names represent the initial two molecular functions when ordered by name in ascending order?", "output": "MATCH (n:MolecularFunction) RETURN n.name ORDER BY n.name ASC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the top eight pathways when listed in descending alphabetical order?", "output": "MATCH (n:Pathway) RETURN n.name ORDER BY n.name DESC LIMIT 8"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which two biological process identifiers appear last when ordered in descending order?", "output": "MATCH (n:BiologicalProcess) RETURN n.identifier ORDER BY n.identifier DESC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological process appears first when sorting the processes by name in ascending order?", "output": "MATCH (n:BiologicalProcess) RETURN n.name ORDER BY n.name ASC LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the first ten compound identifiers sorted by ascending alphabetical order?", "output": "MATCH (n:Compound) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the last two compound names when sorted in descending order by name?", "output": "MATCH (n:Compound) RETURN n.name ORDER BY n.name DESC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you tell me the identifier of the symptom that comes first when identifiers are sorted from smallest to largest?", "output": "MATCH (n:Symptom) RETURN n.identifier ORDER BY n.identifier ASC LIMIT 1"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the last two diseases when listed in descending alphabetical order?", "output": "MATCH (n:Disease) RETURN n.name ORDER BY n.name DESC LIMIT 2"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the first four side effect nodes when their names are ordered alphabetically?", "output": "MATCH (n:SideEffect) RETURN n.name ORDER BY n.name ASC LIMIT 4"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nine compound names appear first when ordered alphabetically?", "output": "MATCH (n:Compound) RETURN n.name ORDER BY n.name ASC LIMIT 9"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs of compounds and the corresponding count of genes they downregulate, with the results ranked from the most to the least number of genes downregulated?", "output": "MATCH (d:Compound)-[r:DOWNREGULATES_CdG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each compound license, how many times does a compound resemble another via the \u201cRESEMBLES_CrC\u201d relationship, and can you provide this count in descending order?", "output": "MATCH (d:Compound)-[r:RESEMBLES_CrC]->(s:Compound) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we find and rank disease URLs based on the number of genes each disease upregulates, and what is the count of these genes for each disease in descending order?", "output": "MATCH (d:Disease)-[r:UPREGULATES_DuG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list disease URLs based on the number of symptoms they present, ranking them by the number of symptoms from highest to lowest?", "output": "MATCH (d:Disease)-[r:PRESENTS_DpS]->(s:Symptom) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list gene descriptions ordered by the number of pathways they are involved in, starting with the gene with the highest participation?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.description, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the list of pharmacologic class licenses and the count of associated compounds they include, ordered descending by compound count?", "output": "MATCH (d:PharmacologicClass)-[r:INCLUDES_PCiC]->(s:Compound) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find diseases and count the number of symptoms they present, ordering the results by the highest number of symptoms first?", "output": "MATCH (d:Disease)-[r:PRESENTS_DpS]->(s:Symptom) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the URLs of genes that connect to other genes through \"COVARIES_GcG\" relationships, sorted by the number of these connections in descending order.", "output": "MATCH (d:Gene)-[r:COVARIES_GcG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have URLs, and how many genes does each disease downregulate according to their relationship count, sorted in descending order?", "output": "MATCH (d:Disease)-[r:DOWNREGULATES_DdG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the number of pathways each gene, grouped by license, participates in, sorted by the highest count first?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I list genes grouped by their licenses, organized by the number of molecular functions they are involved in?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpMF]->(s:MolecularFunction) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the URLs for diseases along with a count of their associated genes, sorted by the highest number of gene associations?", "output": "MATCH (d:Disease)-[r:ASSOCIATES_DaG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the URL of each disease along with the number of resembling diseases, sorted by the number of resemblances in descending order. ", "output": "MATCH (d:Disease)-[r:RESEMBLES_DrD]->(s:Disease) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of chromosomes sorted by the number of genes they regulate in descending order?", "output": "MATCH (d:Gene)-[r:REGULATES_GrG]->(s:Gene) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of disease licenses along with the count of anatomical structures they localize to, sorted in descending order by the number of localizations?", "output": "MATCH (d:Disease)-[r:LOCALIZES_DlA]->(s:Anatomy) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each anatomy license, how many genes do they upregulate, and how do these counts compare when sorted from highest to lowest?", "output": "MATCH (d:Anatomy)-[r:UPREGULATES_AuG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of diseases palliated by each compound, and which compound identifiers are linked to them, sorted in descending order?", "output": "MATCH (d:Compound)-[r:PALLIATES_CpD]->(s:Disease) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifier names of genes and their corresponding count of connections to other genes based on the COVARIES_GcG relationship, sorted with the most connected gene first?", "output": "MATCH (d:Gene)-[r:COVARIES_GcG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the mesh IDs of anatomy entities and count how many genes each entity upregulates, ordering the results by this count in descending order?", "output": "MATCH (d:Anatomy)-[r:UPREGULATES_AuG]->(s:Gene) RETURN d.mesh_id, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many cellular components are linked to each gene via the PARTICIPATES_GpCC relationship, and what is the URL for each gene? Please order the results by the number of components in descending order.", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the gene identifiers associated with the highest number of pathways and display this information sorted from most to fewest pathways?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which chromosomes have the most gene associations based on the COVARIES_GcG relationship, and how do the counts compare?", "output": "MATCH (d:Gene)-[r:COVARIES_GcG]->(s:Gene) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene description, how many cellular components are they connected to, and can you sort the results by the decreasing order of component count?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.description, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the gene URLs along with the count of pathways they are part of, sorted by the highest number of associated pathways?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify genes by their identifiers and count the cellular components they participate in, with results sorted from the greatest to the least number of components?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the count of pathways associated with genes from each chromosome, sorted by the highest pathway participation?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpPW]->(s:Pathway) RETURN d.chromosome, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the URLs of compounds that have the ability to upregulate genes, along with the number of genes affected by each in descending order of gene count?", "output": "MATCH (d:Compound)-[r:UPREGULATES_CuG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs of diseases and their associated count of anatomical locations, sorted by the highest number of locations?", "output": "MATCH (d:Disease)-[r:LOCALIZES_DlA]->(s:Anatomy) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entities have URLs, and how many genes do they upregulate, sorted by the number of genes they affect in descending order?", "output": "MATCH (d:Anatomy)-[r:UPREGULATES_AuG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list compounds by their identifiers along with the count of genes they bind to, arranged in decreasing order of the count?", "output": "MATCH (d:Compound)-[r:BINDS_CbG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs of anatomy nodes sorted by the number of associated expressed genes, from most to fewest?", "output": "MATCH (d:Anatomy)-[r:EXPRESSES_AeG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the BTO IDs of anatomy nodes alongside the count of genes they upregulate, sorted from the highest to lowest gene count?", "output": "MATCH (d:Anatomy)-[r:UPREGULATES_AuG]->(s:Gene) RETURN d.bto_id, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a ranked list of pharmacologic class identifiers based on the number of compounds included in each, from highest to lowest?", "output": "MATCH (d:PharmacologicClass)-[r:INCLUDES_PCiC]->(s:Compound) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the licenses of diseases along with the number of other diseases they resemble, sorting the results by the resemblance count in descending order?", "output": "MATCH (d:Disease)-[r:RESEMBLES_DrD]->(s:Disease) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the URLs of genes based on the number of their interactions with other genes, sorted from the highest to the lowest interaction count.", "output": "MATCH (d:Gene)-[r:INTERACTS_GiG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many genes are downregulated by each disease, and what are the identifiers of these diseases, sorted in descending order of gene count?", "output": "MATCH (d:Disease)-[r:DOWNREGULATES_DdG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many genes are bound by each compound based on their InChI, sorted from the compound binding the most genes to the least?", "output": "MATCH (d:Compound)-[r:BINDS_CbG]->(s:Gene) RETURN d.inchi, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the relationship between diseases' licenses and the number of genes they downregulate, presented in descending order of gene counts?", "output": "MATCH (d:Disease)-[r:DOWNREGULATES_DdG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which sources of anatomy express genes and what is the count of genes expressed by each, displayed in descending order of gene count?", "output": "MATCH (d:Anatomy)-[r:EXPRESSES_AeG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the URLs of compounds ordered by how many genes they bind to, in descending order of the count?", "output": "MATCH (d:Compound)-[r:BINDS_CbG]->(s:Gene) RETURN d.url, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the sources of diseases along with their respective counts of associated genes, sorted by the highest number of associations first?", "output": "MATCH (d:Disease)-[r:ASSOCIATES_DaG]->(s:Gene) RETURN d.source, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide a ranking of compound licenses based on the number of genes they bind within the database, showing the most bound genes at the top.", "output": "MATCH (d:Compound)-[r:BINDS_CbG]->(s:Gene) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of diseases and their corresponding number of anatomical localizations, sorted from highest to lowest localization count?", "output": "MATCH (d:Disease)-[r:LOCALIZES_DlA]->(s:Anatomy) RETURN d.name, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the distribution of cellular component participation by gene licenses, listed in descending order of component count?", "output": "MATCH (d:Gene)-[r:PARTICIPATES_GpCC]->(s:CellularComponent) RETURN d.license, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the InChIKey for compounds that cause gene downregulation and the respective count of downregulated genes, with the results sorted by descending order of the count?", "output": "MATCH (d:Compound)-[r:DOWNREGULATES_CdG]->(s:Gene) RETURN d.inchikey, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the diseases along with the count of genes each one upregulates, sorted by the highest count of genes?", "output": "MATCH (d:Disease)-[r:UPREGULATES_DuG]->(s:Gene) RETURN d.identifier, COUNT(s) AS sCount ORDER BY sCount DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the InChIKey of each compound and how many genes does each one bind to, sorted in descending order by the number of genes?", "output": "MATCH (d:Compound)-[r:BINDS_CbG]->(s:Gene) RETURN d.inchikey, COUNT(s) AS sCount ORDER BY sCount DESC"}]