[{"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are linked to a 'SideEffect' node with a \"CC BY-NC-SA 4.0\" license in a graph?", "output": "MATCH path=(:SideEffect {license:\"CC BY-NC-SA 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the relationships from nodes with the \"CC BY 4.0\" license within the PharmacologicClass category?", "output": "MATCH path=(:PharmacologicClass {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the nodes and relationships that are directly linked to the BiologicalProcess node identified as \"GO:0046503\"?", "output": "MATCH path=(:BiologicalProcess {identifier:\"GO:0046503\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly connected to the cellular component node identified as \"GO:0009295\"?", "output": "MATCH path=(:CellularComponent {identifier:\"GO:0009295\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes and relationships are directly linked to the \"VN1R5\" gene?", "output": "MATCH path=(:Gene {name:\"VN1R5\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve all the direct connections originating from the gene with the name \"CNTN6\"?", "output": "MATCH path=(:Gene {name:\"CNTN6\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many and what types of nodes are directly connected to the compound with the URL \"http://www.drugbank.ca/drugs/DB01181\"?", "output": "MATCH path=(:Compound {url:\"http://www.drugbank.ca/drugs/DB01181\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths originate from the pathway node with the identifier \"PC7_3326\"?", "output": "MATCH path=(:Pathway {identifier:\"PC7_3326\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return all nodes and relationships that are directly linked to the BiologicalProcess identified by the URL \"http://purl.obolibrary.org/obo/GO_0048387\"?", "output": "MATCH path=(:BiologicalProcess {url:\"http://purl.obolibrary.org/obo/GO_0048387\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are connected to the biological process node with the identifier \"GO:0071108\"?", "output": "MATCH path=(:BiologicalProcess {identifier:\"GO:0071108\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and list all the neighboring nodes directly linked to the gene identified by \"http://identifiers.org/ncbigene/152518\"?", "output": "MATCH path=(:Gene {url:\"http://identifiers.org/ncbigene/152518\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways start from the source 'Reactome via Pathway Commons' and extend to an adjacent node?", "output": "MATCH path=(:Pathway {source:\"Reactome via Pathway Commons\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the immediate neighbors or nodes connected to the compound with the specified InChIKey \"InChIKey=BFYIZQONLCFLEV-DAELLWKTSA-N\"?", "output": "MATCH path=(:Compound {inchikey:\"InChIKey=BFYIZQONLCFLEV-DAELLWKTSA-N\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the nodes directly connected to the 'CellularComponent' labeled with \"GO:0000110\"?", "output": "MATCH path=(:CellularComponent {identifier:\"GO:0000110\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify all outgoing paths from the node representing the gene with identifier \"9703\"?", "output": "MATCH path=(:Gene {identifier:\"9703\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly related to the node representing the molecular function with ID \"GO:0070061\"?", "output": "MATCH path=(:MolecularFunction {identifier:\"GO:0070061\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the paths from cellular component nodes labeled with the license \"CC BY 4.0\" to other nodes they are directly connected to?", "output": "MATCH path=(:CellularComponent {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes and relationships are directly linked to the gene with the URL \"http://identifiers.org/ncbigene/388951\"?", "output": "MATCH path=(:Gene {url:\"http://identifiers.org/ncbigene/388951\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths from the disease with identifier \"DOID:90\" to its directly connected nodes?", "output": "MATCH path=(:Disease {identifier:\"DOID:90\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths originating from the cellular component with the identifier \"GO:1902495\" leading to any connected nodes?", "output": "MATCH path=(:CellularComponent {identifier:\"GO:1902495\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show all nodes and their connecting relationships stemming from the \"ATF4 activates genes\" pathway?", "output": "MATCH path=(:Pathway {name:\"ATF4 activates genes\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What connections exist from the anatomy node labeled as \"sacro-iliac joint\" to other nodes?", "output": "MATCH path=(:Anatomy {name:\"sacro-iliac joint\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the anatomy nodes that have the \"CC BY 3.0\" license connected to other nodes in the graph?", "output": "MATCH path=(:Anatomy {license:\"CC BY 3.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are nodes under 'PharmacologicClass' from the source \"FDA via DrugCentral\" connected to additional nodes in the database?", "output": "MATCH path=(:PharmacologicClass {source:\"FDA via DrugCentral\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are immediately connected to the \"CDC42EP4\" gene, and what are their pathways?", "output": "MATCH path=(:Gene {name:\"CDC42EP4\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are one relationship away from the \"Benazepril\" compound?", "output": "MATCH path=(:Compound {name:\"Benazepril\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are immediately connected to the anatomy node that has the bto_id \"BTO:0001499\", and what paths involve these connections?", "output": "MATCH path=(:Anatomy {bto_id:\"BTO:0001499\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the paths that start from a gene with a \"CC0 1.0\" license and go out to any neighboring nodes?", "output": "MATCH path=(:Gene {license:\"CC0 1.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return all the paths that start with a node labeled as Cellular Component sourced from Gene Ontology and traverse to any connected nodes?", "output": "MATCH path=(:CellularComponent {source:\"Gene Ontology\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What outgoing paths exist from any nodes labeled as pathways with the \"CC0 1.0\" license?", "output": "MATCH path=(:Pathway {license:\"CC0 1.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly related to the \"sternoclavicular joint\" anatomy node, and what paths do they form?", "output": "MATCH path=(:Anatomy {name:\"sternoclavicular joint\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list all nodes that have a direct connection to the disease identified by \"DOID:14268\"?", "output": "MATCH path=(:Disease {identifier:\"DOID:14268\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we trace the network of connections starting from SideEffect nodes that are licensed under 'CC BY-NC-SA 4.0'?", "output": "MATCH path=(:SideEffect {license:\"CC BY-NC-SA 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist from the symptom labeled \"Pain, Referred\" to any other node in the graph?", "output": "MATCH path=(:Symptom {name:\"Pain, Referred\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all connections from a node representing a biological process with the license \"CC BY 4.0\" to other nodes in the graph?", "output": "MATCH path=(:BiologicalProcess {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the paths starting from any cellular component with a license of \"CC BY 4.0\" to any directly connected node?", "output": "MATCH path=(:CellularComponent {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are nodes connected to the CellularComponent node with the identifier \"GO:0030659\" in the graph?", "output": "MATCH path=(:CellularComponent {identifier:\"GO:0030659\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all paths that start from a 'CellularComponent' node with the \"CC BY 4.0\" license and lead to any other node?", "output": "MATCH path=(:CellularComponent {license:\"CC BY 4.0\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths starting from nodes labeled as 'CellularComponent' with the 'source' property set to 'Gene Ontology'?", "output": "MATCH path=(:CellularComponent {source:\"Gene Ontology\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist starting from the node representing the biological process called \"bacterial-type flagellum-dependent cell motility\"?", "output": "MATCH path=(:BiologicalProcess {name:\"bacterial-type flagellum-dependent cell motility\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes are directly linked to genes that are found on chromosome 9?", "output": "MATCH path=(:Gene {chromosome:\"9\"})-->() RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the paths that connect any pathway node to symptom nodes?", "output": "MATCH path = (n:Pathway)-[*]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths that connect nodes labeled as 'PharmacologicClass' with nodes labeled as 'Gene'?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Gene) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all relationships and nodes along paths between Pathway and Gene nodes?", "output": "MATCH path = (n:Pathway)-[*]-(m:Gene) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I list all the paths that connect nodes labeled as Pathway with nodes labeled as PharmacologicClass in the graph?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the paths connecting nodes labeled as \"MolecularFunction\" with nodes labeled as \"Disease\" in the graph?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all relationships or paths between nodes labeled as CellularComponent and SideEffect?", "output": "MATCH path = (n:CellularComponent)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the network paths that traverse between \"Anatomy\" nodes and \"PharmacologicClass\" nodes?", "output": "MATCH path = (n:Anatomy)-[*]-(m:PharmacologicClass) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all possible connection paths between nodes labeled as 'PharmacologicClass' and nodes labeled as 'CellularComponent' in the graph?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve all the interconnected paths involving nodes labeled 'Pathway' and 'Anatomy'?", "output": "MATCH path = (n:Pathway)-[*]-(m:Anatomy) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths link 'Pathway' nodes with 'Compound' nodes, including all intermediate nodes and relationships?", "output": "MATCH path = (n:Pathway)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths or relationships exist that connect nodes labeled as PharmacologicClass to nodes labeled as Compound?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the complete set of paths between MolecularFunction and SideEffect nodes, including all intermediate nodes and relationships?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find every path that involves a node labeled \"Pathway\" and a node labeled \"BiologicalProcess\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths connecting anatomy nodes to disease nodes in the graph database?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all possible routes connecting `Anatomy` nodes to `Gene` nodes?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Gene) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths connecting any 'Pathway' node to any 'CellularComponent' node in the graph?", "output": "MATCH path = (n:Pathway)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the possible relationship paths between symptom nodes and cellular component nodes?", "output": "MATCH path = (n:Symptom)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths connecting nodes with the MolecularFunction label to nodes with the Pathway label in the graph?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Pathway) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths connecting any MolecularFunction node and any Anatomy node in the graph?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Anatomy) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths connecting any gene nodes to compound nodes in the graph?", "output": "MATCH path = (n:Gene)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What network paths can be identified that connect nodes representing pharmacologic classes to those representing diseases?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide all paths of any length that link any Disease node to any Compound node in the graph?", "output": "MATCH path = (n:Disease)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all possible paths in the database that connect nodes labeled as 'Anatomy' to nodes labeled as 'Compound'?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify all linked paths that involve nodes tagged as pharmacologic class and symptom?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find every possible way Anatomy nodes are linked to CellularComponent nodes?", "output": "MATCH path = (n:Anatomy)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the paths that exist between nodes labeled as Anatomy and those labeled as Symptom?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve all the relationships and nodes along any path between nodes labeled as BiologicalProcess and those labeled as SideEffect?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the links between nodes labeled as MolecularFunction and nodes labeled as PharmacologicClass?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:PharmacologicClass) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify and return every possible relationship path between nodes labeled as \"MolecularFunction\" and nodes labeled as \"Gene\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Gene) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve all paths, regardless of length, that involve both Gene and SideEffect nodes?", "output": "MATCH path = (n:Gene)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve all the relationships between nodes labeled as `MolecularFunction` and `BiologicalProcess`?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve all paths linking any 'Pathway' nodes to 'Disease' nodes through any number of hops?", "output": "MATCH path = (n:Pathway)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the paths that connect any nodes labeled as 'Disease' to those labeled as 'CellularComponent'?", "output": "MATCH path = (n:Disease)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve all relationships and nodes that exist between any symptom and any disease?", "output": "MATCH path = (n:Symptom)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths connecting 'Pathway' nodes to 'SideEffect' nodes in the database?", "output": "MATCH path = (n:Pathway)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths between nodes labeled as Anatomy and nodes labeled as BiologicalProcess in the database?", "output": "MATCH path = (n:Anatomy)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all paths connecting pharmacologic classes to biological processes in the database?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths between nodes labeled as \"MolecularFunction\" and nodes labeled as \"CellularComponent\" in the database?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the possible relationships and paths existing between nodes labeled as \"Symptom\" and \"SideEffect\"?", "output": "MATCH path = (n:Symptom)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all possible connections between nodes labeled as Symptom and nodes labeled as Compound?", "output": "MATCH path = (n:Symptom)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathways exist between nodes labeled as Gene and nodes labeled as BiologicalProcess?", "output": "MATCH path = (n:Gene)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths that connect any node labeled as a Biological Process with any node labeled as a Cellular Component in the graph?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you show me the different routes linking molecular function nodes to compound nodes?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Compound) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the routes that connect any symptom node to any biological process node?", "output": "MATCH path = (n:Symptom)-[*]-(m:BiologicalProcess) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you display all the interconnected paths that involve both disease and side effect nodes?", "output": "MATCH path = (n:Disease)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all the paths that connect molecular functions with symptoms in the database?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the complete set of connections and intermediaries between gene nodes and disease nodes?", "output": "MATCH path = (n:Gene)-[*]-(m:Disease) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths that connect nodes labeled as Compound with those labeled as SideEffect?", "output": "MATCH path = (n:Compound)-[*]-(m:SideEffect) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths that connect any gene to any symptom in the database?", "output": "MATCH path = (n:Gene)-[*]-(m:Symptom) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show me the pathways between any node labeled as Gene and any node labeled as CellularComponent?", "output": "MATCH path = (n:Gene)-[*]-(m:CellularComponent) RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the genes that are connected within one to three hops from any pharmacologic class in the database?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:Gene) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find diseases that are directly or indirectly associated with pharmacologic classes within a maximum of three node hops?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are related to diseases within a distance of one to three hops?", "output": "MATCH (n:Gene)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find pathway nodes and their associated cellular components if they are linked by one, two, or three hops?", "output": "MATCH (n:Pathway)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For each gene, can you identify any associated compounds that are reachable within one, two, or three hops?", "output": "MATCH (n:Gene)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are associated with pathways through a relationship spanning up to three hops?", "output": "MATCH (n:Pathway)-[*1..3]-(m:Symptom) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find diseases that are directly or indirectly associated with cellular components, with a maximum separation of three hops?", "output": "MATCH (n:Disease)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all anatomy nodes that are linked to disease nodes by up to three hops?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are Pathway nodes related to PharmacologicClass nodes within a connection distance of one to three hops?", "output": "MATCH (n:Pathway)-[*1..3]-(m:PharmacologicClass) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are pharmacologic classes related to biological processes by a connection path that ranges from one to three hops?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the molecular functions that are connected to compounds within one to three relationship hops?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are molecular functions related to diseases with up to three hops in the network?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all nodes representing Pathways and Genes that are within up to three steps of each other in the graph.", "output": "MATCH (n:Pathway)-[*1..3]-(m:Gene) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the Anatomy components and their related PharmacologicClass categories that are linked through up to three relationships?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:PharmacologicClass) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the relationships between anatomy nodes and compound nodes that span one to three hops?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the molecular functions and symptoms that have a maximum of three hop connections between them?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Symptom) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all pathways that are connected to biological processes within up to three steps in the graph database?", "output": "MATCH (n:Pathway)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the anatomy and cellular component pairs that are connected through up to three hops in the graph?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all pathways and compounds that have a connection path consisting of one to three hops between them?", "output": "MATCH (n:Pathway)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve pathways and anatomies that are at most three steps apart in the network graph?", "output": "MATCH (n:Pathway)-[*1..3]-(m:Anatomy) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pharmacologic classes have any type of connection to cellular components, involving one to three intermediary relationships?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all pathways that are directly or indirectly connected to diseases within three degrees of separation?", "output": "MATCH (n:Pathway)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we list all symptoms along with diseases they are linked to within three relationship steps?", "output": "MATCH (n:Symptom)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Show all symptom-Compound pairs that are linked by a chain of one to three relationships.", "output": "MATCH (n:Symptom)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are molecular functions related to cellular components in paths that span between one to three hops?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:CellularComponent) RETURN n, m"}]