[{"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all pharmacologic class names provided by the source \"FDA via DrugCentral\" and sort them alphabetically?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the Gene Ontology-named molecular functions, sorted by name in ascending order?", "output": "MATCH (n:MolecularFunction) WHERE n.source = \"Gene Ontology\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all biological processes identified from the \"Gene Ontology\" source, sorted in ascending alphabetical order?", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and list the identifiers of the gene labeled \"SMPD1\" in a sequential order?", "output": "MATCH (n:Gene) WHERE n.name = \"SMPD1\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain an ordered list of names for molecular functions that come from the Gene Ontology?", "output": "MATCH (n:MolecularFunction) WHERE n.source = \"Gene Ontology\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of all the pharmacologic classes with a \"CC BY 4.0\" license, sorted alphabetically?", "output": "MATCH (n:PharmacologicClass) WHERE n.license = \"CC BY 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the unique names of genes associated with the \"ZSCAN9\" gene through a \"COVARIES_GcG\" type relationship, sorted in descending alphabetical order.", "output": "MATCH (n:Gene { name: \"ZSCAN9\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers of diseases connected by a \"RESEMBLES_DrD\" relationship to diseases with the license \"CC BY 3.0\", sorted in reverse order?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:RESEMBLES_DrD]->(m:Disease) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the unique biological process names linked to the gene via PARTICIPATES_GpBP from the URL \"http://identifiers.org/ncbigene/3091,\" listed in descending order by name.", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/3091\" })-[r:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene identifiers connected by the \"COVARIES_GcG\" relationship to the gene at \"http://identifiers.org/ncbigene/7746\", and sort these identifiers in descending order.", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/7746\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and sort in descending order the identifiers of pathways linked to the gene described as \"adenylate cyclase activating polypeptide 1 (pituitary)\".", "output": "MATCH (n:Gene { description: \"adenylate cyclase activating polypeptide 1 (pituitary)\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify and return the names of all unique genes that have a \"COVARIES_GcG\" connection with the \"IL2\" gene, sorted by name in descending order.", "output": "MATCH (n:Gene { name: \"IL2\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of genes upregulated by the anatomy with mesh ID \"D011467,\" sorted in descending order?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct identifiers of genes influenced by the regulatory actions of the \"autophagy related 16-like 1 (S. cerevisiae)\" gene, sorted in reverse order.", "output": "MATCH (n:Gene { description: \"autophagy related 16-like 1 (S. cerevisiae)\" })-[r:REGULATES_GrG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the distinct identifiers of diseases that resemble the disease identified by \"DOID:5875\", sorted by identifier in reverse order?", "output": "MATCH (n:Disease { identifier: \"DOID:5875\" })-[r:RESEMBLES_DrD]->(m:Disease) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene names that are sorted in reverse alphabetical order and have a COVARIES_GcG relationship with genes located on chromosome 7.", "output": "MATCH (n:Gene { chromosome: \"7\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds connected by a \"RESEMBLES_CrC\" relationship to the compound identified by \"InChIKey=VRQVVMDWGGWHTJ-CQSZACIVSA-N\", and arrange these names in descending order.", "output": "MATCH (n:Compound { inchikey: \"InChIKey=VRQVVMDWGGWHTJ-CQSZACIVSA-N\" })-[r:RESEMBLES_CrC]->(m:Compound) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique gene names are linked to \"CC BY-NC 4.0\" licensed compounds via a BINDS_CbG relationship, and what is their order when sorted alphabetically from last to first?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" })-[r:BINDS_CbG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct names of genes that interact with the gene having the description \"golgi brefeldin A resistant guanine nucleotide exchange factor 1,\" listed in descending order?", "output": "MATCH (n:Gene { description: \"golgi brefeldin A resistant guanine nucleotide exchange factor 1\" })-[r:INTERACTS_GiG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique symptom identifiers are related to diseases with a \"CC BY 3.0\" license, and how are they ordered in descending order by identifier?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:PRESENTS_DpS]->(m:Symptom) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct identifiers of genes that are upregulated by anatomy entities with a \"CC BY 3.0\" license, sorted in descending order?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique symptoms that are associated with the disease named \"spinal cancer\", sorted in descending order by symptom name?", "output": "MATCH (n:Disease { name: \"spinal cancer\" })-[r:PRESENTS_DpS]->(m:Symptom) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the disease known as \"pancreatic cancer,\" ordered in descending alphabetical order?", "output": "MATCH (n:Disease { name: \"pancreatic cancer\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all unique identifiers of diseases that are treated by the compound with the identifier \"DB00227\" and sort them from greatest to least.", "output": "MATCH (n:Compound { identifier: \"DB00227\" })-[r:TREATS_CtD]->(m:Disease) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the unique identifiers of genes that the disease with identifier \"DOID:0050742\" upregulates, with the sequence arranged in decreasing order?", "output": "MATCH (n:Disease { identifier: \"DOID:0050742\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the unique identifiers of genes that have a \"COVARIES_GcG\" connection from the gene identified by the URL \"http://identifiers.org/ncbigene/84254\", sorted from highest to lowest identifier?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/84254\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct identifiers of genes that are downregulated by any compound carrying the \"CC BY-NC 4.0\" license, with results ordered in descending order.", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" })-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of genes that are upregulated by the disease with the URL \"http://purl.obolibrary.org/obo/DOID_1793,\" and how are these names ordered in descending order?", "output": "MATCH (n:Disease { url: \"http://purl.obolibrary.org/obo/DOID_1793\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are connected to the gene with the URL \"http://identifiers.org/ncbigene/6632\" via the 'COVARIES_GcG' relationship, and what is their order when sorted from highest to lowest?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/6632\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the disease identified by DOID:11612, which are the unique genes it upregulates and how are these gene names sorted from highest to lowest alphabetically?", "output": "MATCH (n:Disease { identifier: \"DOID:11612\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the list of unique gene identifiers that are influenced by the \"DOWNREGULATES_AdG\" relationship from the anatomy node with mesh_id \"D011467,\" sorted from highest to lowest.", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\" })-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the unique identifiers of pathways where genes licensed as CC0 1.0 participate, and arrange them in reverse order.", "output": "MATCH (n:Gene { license: \"CC0 1.0\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene identifiers that are related to the gene \"interleukin 26\" by covariance, listing them in reverse alphabetical order.", "output": "MATCH (n:Gene { description: \"interleukin 26\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers of genes that are connected via 'COVARIES_GcG' relationships to genes licensed under CC0 1.0, sorted by identifier in descending order?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the unique gene IDs that are upregulated by anatomy nodes specified by Uberon, ordering the results starting with the highest identifier.", "output": "MATCH (n:Anatomy { source: \"Uberon\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases, represented by their unique identifiers, are palliated by Celecoxib, and how are these identifiers sorted in descending order?", "output": "MATCH (n:Compound { name: \"Celecoxib\" })-[r:PALLIATES_CpD]->(m:Disease) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have unique identifiers and are downregulated by pancreatic cancer, with the results arranged in descending order by identifier?", "output": "MATCH (n:Disease { name: \"pancreatic cancer\" })-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the unique compound identifiers that are part of the pharmacologic class linked to the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\", and arrange them in descending order.", "output": "MATCH (n:PharmacologicClass { url: \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that resemble DrugBank compounds according to the RESEMBLES_CrC relationship, in descending order?", "output": "MATCH (n:Compound { source: \"DrugBank\" })-[r:RESEMBLES_CrC]->(m:Compound) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct gene names expressed by the anatomy labeled as the prostate gland, sorted in descending order?", "output": "MATCH (n:Anatomy { name: \"prostate gland\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What descending list of unique pathway IDs is associated with the gene HIST1H3B through the PARTICIPATES_GpPW relationship?", "output": "MATCH (n:Gene { name: \"HIST1H3B\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular components, identified by unique identifiers, are linked to genes on chromosome 12 through the PARTICIPATES_GpCC relationship, arranged in descending order?", "output": "MATCH (n:Gene { chromosome: \"12\" })-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of genes expressed in anatomy entities from the Uberon source, sorted in descending order?", "output": "MATCH (n:Anatomy { source: \"Uberon\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve unique compound identifiers linked to pharmacologic classes by the mechanism of action, arranged in descending order?", "output": "MATCH (n:PharmacologicClass { class_type: \"Mechanism of Action\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct identifiers of pathways involving the \"CRK\" gene, ordered by identifier from largest to smallest.", "output": "MATCH (n:Gene { name: \"CRK\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the anatomy identified by \"UBERON:0002367\", what are the unique names of genes linked via an \"EXPRESSES_AeG\" relationship, sorted alphabetically in reverse order?", "output": "MATCH (n:Anatomy { identifier: \"UBERON:0002367\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct anatomy identifiers where diseases documented in the Disease Ontology localize, sorted in reverse order?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of cellular components, shown in descending order, that have a distinct participation relationship with the gene described as \"zinc finger, FYVE domain containing 27\"?", "output": "MATCH (n:Gene { description: \"zinc finger, FYVE domain containing 27\" })-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound named \"Acetophenazine\" is used to palliate, ordered in descending order?", "output": "MATCH (n:Compound { name: \"Acetophenazine\" })-[r:PALLIATES_CpD]->(m:Disease) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique cellular component identifiers are linked to the gene with the description \"heat shock 70kDa protein 1-like\" through the PARTICIPATES_GpCC relationship?", "output": "MATCH (n:Gene { description: \"heat shock 70kDa protein 1-like\" })-[r:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct pathway identifiers where genes labeled with a CC0 1.0 license participate, sorted from highest to lowest?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathway IDs are associated with genes on chromosome 11, with the results sorted from highest to lowest identifier?", "output": "MATCH (n:Gene { chromosome: \"11\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct symptom identifiers are presented by the disease with the URL \"http://purl.obolibrary.org/obo/DOID_1826\", and how are they organized in descending order?", "output": "MATCH (n:Disease { url: \"http://purl.obolibrary.org/obo/DOID_1826\" })-[r:PRESENTS_DpS]->(m:Symptom) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the unique identifiers for each gene that has an interaction with the gene \"DDX5,\" and list these identifiers in decreasing order.", "output": "MATCH (n:Gene { name: \"DDX5\" })-[r:INTERACTS_GiG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the unique names of genes that experience a downregulation interaction from diseases noted within the Disease Ontology, and sort these names in descending sequence.", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list distinct gene identifiers that are connected to diseases with a \"CC BY 3.0\" license, specifically through a \"DOWNREGULATES_DdG\" relationship, in reverse alphabetical order?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:DOWNREGULATES_DdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names, linked to diseases from the Disease Ontology, are returned uniquely and sorted alphabetically in reverse order?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene identifiers that are upregulated due to an interaction with the compound having the InChIKey \"SLAYUXIURFNXPG-CRAIPNDOSA-N\", and sort these identifiers in descending order.", "output": "MATCH (n:Compound { inchikey: \"InChIKey=SLAYUXIURFNXPG-CRAIPNDOSA-N\" })-[r:UPREGULATES_CuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct genes whose expression is increased by diseases with the specified license \"CC BY 3.0,\" and display their names sorted from highest to lowest alphabetically.", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are upregulated by diseases licensed under \"CC BY 3.0\", and how are they listed when sorted in descending order?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:UPREGULATES_DuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct gene names are influenced by downregulation through the anatomy specified by the URL \"http://purl.obolibrary.org/obo/UBERON_0002367,\" sorted in reverse alphabetical order?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0002367\" })-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What set of unique gene names are associated with 'COVARIES_GcG' relationships originating from genes under the CC0 1.0 license, sorted alphabetically backwards?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" })-[r:COVARIES_GcG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct genes have identifiers that are influenced by the prostate gland through upregulation, and how are these identifiers ordered?", "output": "MATCH (n:Anatomy { name: \"prostate gland\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the distinct gene identifiers that are downregulated by compound \"DB00432\", and list them in descending order.", "output": "MATCH (n:Compound { identifier: \"DB00432\" })-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the unique identifiers of genes connected to diseases licensed with CC BY 3.0, ensuring the list is ordered in descending order.", "output": "MATCH (n:Disease { license: \"CC BY 3.0\" })-[r:ASSOCIATES_DaG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve the unique IDs of anatomical sites linked to diseases in the Disease Ontology, with the results displayed in descending order?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are uniquely upregulated by anatomical items with a \"CC BY 3.0\" license, and how are they sorted alphabetically in reverse?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique gene identifiers upregulated by compounds sourced from DrugBank, ordered in descending order?", "output": "MATCH (n:Compound { source: \"DrugBank\" })-[r:UPREGULATES_CuG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene identifiers that are linked to being downregulated by anatomical entities licensed as \"CC BY 3.0,\" sorted by identifier in descending order.", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" })-[r:DOWNREGULATES_AdG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are uniquely upregulated by the specific compound \"DB00661\", with the results sorted in decreasing order?", "output": "MATCH (n:Compound { identifier: \"DB00661\" })-[r:UPREGULATES_CuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of genes that are expressed in anatomy parts sourced from Uberon, ordered in descending order?", "output": "MATCH (n:Anatomy { source: \"Uberon\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have distinct names and are associated with the compound characterized by the InChI code \"InChI=1S/C14H10Cl4/c15-10-7-5-9(6-8-10)13(14(17)18)11-3-1-2-4-12(11)16/h1-8,13-14H\" through a BINDS_CbG relationship?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C14H10Cl4/c15-10-7-5-9(6-8-10)13(14(17)18)11-3-1-2-4-12(11)16/h1-8,13-14H\" })-[r:BINDS_CbG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique gene names that are upregulated by the anatomical entity with the identifier \"UBERON:0002367\", and how are these names ordered in descending alphabetical order?", "output": "MATCH (n:Anatomy { identifier: \"UBERON:0002367\" })-[r:UPREGULATES_AuG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the distinct set of gene identifiers that are linked to compounds with the specific license \"CC BY-NC 4.0\", organizing them from the largest to the smallest identifier?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" })-[r:BINDS_CbG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the ordered list of unique gene names that interact with the specific gene associated with the URL \"http://identifiers.org/ncbigene/2563\", starting from the end of the alphabet.", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/2563\" })-[r:INTERACTS_GiG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers of genes that have an interaction with genes having the \"Entrez Gene\" source, sorting the results by identifier in reverse order?", "output": "MATCH (n:Gene { source: \"Entrez Gene\" })-[r:INTERACTS_GiG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct compound identifiers associated with pharmacologic classes licensed under \"CC BY 4.0\", sorted from highest to lowest?", "output": "MATCH (n:PharmacologicClass { license: \"CC BY 4.0\" })-[r:INCLUDES_PCiC]->(m:Compound) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the distinct identifiers for anatomical locations associated with diseases sourced from the Disease Ontology, sorted by identifier from highest to lowest?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique gene identifiers are present for genes linked to the anatomical entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0001003\", and how are they ordered if descending?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0001003\" })-[r:EXPRESSES_AeG]->(m:Gene) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct anatomy identifiers that diseases from the Disease Ontology localize to, presented in descending order according to their identifier?", "output": "MATCH (n:Disease { source: \"Disease Ontology\" })-[r:LOCALIZES_DlA]->(m:Anatomy) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct pathway identifiers where genes from chromosome 2 participate, and how are they sorted starting from the largest?", "output": "MATCH (n:Gene { chromosome: \"2\" })-[r:PARTICIPATES_GpPW]->(m:Pathway) RETURN DISTINCT m.identifier ORDER BY m.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of all unique genes that are affected by downregulation due to compound DB00748, sorted in reverse alphabetical order.", "output": "MATCH (n:Compound { identifier: \"DB00748\" })-[r:DOWNREGULATES_CdG]->(m:Gene) RETURN DISTINCT m.name ORDER BY m.name DESC"}]