[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are downregulated by the anatomical entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (n:Anatomy)-[r1:DOWNREGULATES_AdG]->(m:Gene) WHERE n.url = \"http://purl.obolibrary.org/obo/UBERON_0002367\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of diseases that compounds from DrugBank are known to palliate?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.source = \"DrugBank\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of anatomical entities where diseases labeled with a \"CC BY 3.0\" license are known to localize?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct compound identifiers that are part of pharmacologic classes licensed as \"CC BY 4.0.\"", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.license = \"CC BY 4.0\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers for genes that compounds sourced from DrugBank upregulate?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.source = \"DrugBank\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are upregulated by the disease named \"pancreatic cancer\"?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.name = \"pancreatic cancer\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of genes upregulated by the compound \"Dihomo-gamma-linolenic acid\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.name = \"Dihomo-gamma-linolenic acid\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the molecular function names connected to the \"AK1\" gene through the PARTICIPATES_GpMF relationship?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) WHERE n.name = \"AK1\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique identifiers of genes are upregulated by the compound with the InChIKey \"InChIKey=SLAYUXIURFNXPG-CRAIPNDOSA-N\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.inchikey = \"InChIKey=SLAYUXIURFNXPG-CRAIPNDOSA-N\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all diseases that the compound 'Acetophenazine' helps to palliate?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.name = \"Acetophenazine\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct diseases have a palliative relationship with compounds sourced from DrugBank according to the database?", "output": "MATCH (n:Compound)-[r1:PALLIATES_CpD]->(m:Disease) WHERE n.source = \"DrugBank\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds have unique identifiers and are similar to compounds with a \"CC BY-NC 4.0\" license?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the different gene identifiers impacted by the downregulation relationship from pancreatic cancer.", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name = \"pancreatic cancer\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique names of genes that the compound with the identifier \"DB00661\" upregulates?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.identifier = \"DB00661\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of distinct compound identifiers that belong to the pharmacologic class identified by the specific URL?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000185607\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are uniquely associated with genes interacting with \"DDX5\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.name = \"DDX5\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names do we retrieve for compounds that resemble those listed under DrugBank according to our database?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) WHERE n.source = \"DrugBank\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the distinct gene identifiers that are related to the disease \"age related macular degeneration\".", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) WHERE n.name = \"age related macular degeneration\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are uniquely upregulated by the compound with the identifier \"DB00543\"?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) WHERE n.identifier = \"DB00543\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the distinct names of cellular components that the gene with the description \"chromosome 2 open reading frame 42\" participates in?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.description = \"chromosome 2 open reading frame 42\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct gene names associated with diseases that have the \"CC BY 3.0\" license and upregulate genes?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.license = \"CC BY 3.0\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the distinct identifiers for compounds associated with the pharmacologic class identified by the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\"?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000191267\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are uniquely upregulated by the disease identified as DOID:0050742?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) WHERE n.identifier = \"DOID:0050742\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathways, by their unique identifiers, that include participation of genes with the \"CC0 1.0\" license.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.license = \"CC0 1.0\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What distinct gene names are associated with the compound that possesses the InChI string \"InChI=1S/C14H10Cl4/c15-10-7-5-9(6-8-10)13(14(17)18)11-3-1-2-4-12(11)16/h1-8,13-14H\"?", "output": "MATCH (n:Compound)-[r1:BINDS_CbG]->(m:Gene) WHERE n.inchi = \"InChI=1S/C14H10Cl4/c15-10-7-5-9(6-8-10)13(14(17)18)11-3-1-2-4-12(11)16/h1-8,13-14H\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that co-vary with the gene named \"IL2\" according to the COVARIES_GcG relationship?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) WHERE n.name = \"IL2\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which unique symptom identifiers are presented by diseases with a licensing agreement set to \"CC BY 3.0\"?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.license = \"CC BY 3.0\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the distinct identifiers for symptoms that are presented by the disease having the URL \"http://purl.obolibrary.org/obo/DOID_1826\"?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) WHERE n.url = \"http://purl.obolibrary.org/obo/DOID_1826\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of distinct identifiers for genes that pancreatic cancer downregulates?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) WHERE n.name = \"pancreatic cancer\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular component identifiers can be found from the participation of genes that have \"Entrez Gene\" as their source?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) WHERE n.source = \"Entrez Gene\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which distinct gene names are returned for genes that interact with the gene specified by the URL \"http://identifiers.org/ncbigene/2563\"?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/2563\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the unique anatomical sites where the disease with identifier DOID:10871 is known to localize?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) WHERE n.identifier = \"DOID:10871\" RETURN DISTINCT m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the unique identifiers of compounds included in the pharmacologic class with the identifier \"N0000007151\"?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) WHERE n.identifier = \"N0000007151\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all unique pathway identifiers where genes on chromosome 11 are participants.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) WHERE n.chromosome = \"11\" RETURN DISTINCT m.identifier"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve identifiers of diseases that downregulate certain genes, after ignoring the initial seven matches, and limit the display to ten results?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN n.identifier SKIP 7 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifiers for five diseases that present with symptoms, skipping over the first three entries in the result set?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) RETURN n.identifier SKIP 3 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find 15 identifiers of pharmacologic classes associated with compounds, ignoring the initial 10 identifiers in the result list?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier SKIP 10 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the identifiers of 15 diseases that resemble different diseases, ignoring the first 7 entries in the results?", "output": "MATCH (n:Disease)-[r1:RESEMBLES_DrD]->(m:Disease) RETURN n.identifier SKIP 7 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers appear among specific cellular components after bypassing the first six results and selecting only the next five?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN n.identifier SKIP 6 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the identifiers of diseases associated with genes, while ignoring the first match and only capturing the next 15?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN n.identifier SKIP 1 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do the identifiers of genes participating in cellular components appear when the query outputs from the eleventh result onwards, stopping after ten entries?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN n.identifier SKIP 10 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of genes, which are part of any pathway, can be retrieved if you skip the first result and limit the number of gene names to fifteen? ", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.name SKIP 1 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound identifiers are returned if we skip the first eight and limit the results to 15, where the compounds upregulate specific genes?", "output": "MATCH (n:Compound)-[r1:UPREGULATES_CuG]->(m:Gene) RETURN n.identifier SKIP 8 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the names of genes that have interactions with any other gene, omitting the first two results and limiting the output to fifteen?", "output": "MATCH (n:Gene)-[r1:INTERACTS_GiG]->(m:Gene) RETURN n.name SKIP 2 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show the names of pharmacologic classes, related to compounds, by skipping the first 8 entries and returning the next 15?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.name SKIP 8 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of diseases that downregulate genes, but begin the list after skipping the initial six entries and return up to five entries.", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN n.identifier SKIP 6 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of genes participating in any molecular function, but ignore the first two and show only the next ten results.", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.identifier SKIP 2 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical entity names are retrieved after skipping the first five that have an expression relationship with genes, with a maximum of ten results displayed?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) RETURN n.name SKIP 5 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers, from those participating in pathways, are listed when skipping the first ten entries and limiting the results to five?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.identifier SKIP 10 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease identifiers are similar to other diseases, with the results skipping the first one and limiting to five diseases in total?", "output": "MATCH (n:Disease)-[r1:RESEMBLES_DrD]->(m:Disease) RETURN n.identifier SKIP 1 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find 15 disease names that are linked to genes, skipping the first 6, and show me those results.", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN n.name SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifiers of anatomy nodes that express a specific range of genes, skipping the first six matches and displaying the next ten?", "output": "MATCH (n:Anatomy)-[r1:EXPRESSES_AeG]->(m:Gene) RETURN n.identifier SKIP 6 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the names of five genes that participate in some molecular functions after ignoring the first nine matches?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.name SKIP 9 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the pharmacologic classes that incorporate compounds, with results starting after the first 10 and fetching five classes only?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.name SKIP 10 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve identifiers for fifteen compounds, after skipping six, that exert a downregulating effect on genes?", "output": "MATCH (n:Compound)-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN n.identifier SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we obtain the identifiers of diseases linked to specific anatomical parts, while skipping the first three entries and limiting the results to ten?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.identifier SKIP 3 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers from the pharmacologic classes that include compounds can be found after omitting the first five results, limited to ten?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier SKIP 5 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the disease identifiers associated with symptoms, ignoring the first eight and displaying the following five results?", "output": "MATCH (n:Disease)-[r1:PRESENTS_DpS]->(m:Symptom) RETURN n.identifier SKIP 8 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are participating in some cellular component, with a display starting after the first 10 and limiting the results to 5?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN n.name SKIP 10 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of the diseases localized in anatomical areas, excluding the first eight we come across, and limiting the output to the next ten?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.identifier SKIP 8 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you display the names of pharmacologic classes that contain a compound, beginning from the tenth result and listing up to ten classes?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.name SKIP 9 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Show me five disease identifiers after skipping the first eight, each disease known for upregulating some gene.", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) RETURN n.identifier SKIP 8 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "After skipping the first ten results, which compound names appear as being analogous to another compound in the next five results?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) RETURN n.name SKIP 10 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of diseases linked to anatomy, omitting the first eight and returning only ten results thereafter?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.name SKIP 8 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names can be retrieved by skipping the first and limiting to the next 15 genes participating in biological processes?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN n.name SKIP 1 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases are known to upregulate genes in the database, and can you provide the names of these diseases after skipping the first eight found, with a limit of fifteen?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) RETURN n.name SKIP 8 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease identifiers, connected to genes, are retrieved if the first three matches are omitted and only ten are shown?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN n.identifier SKIP 3 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the disease identifiers that have a localization relationship with instances of anatomy, skipping the first five results and showing the next fifteen?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.identifier SKIP 5 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain gene identifiers for the next 15 genes involved in pathways after bypassing the first six?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.identifier SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifiers correspond to pharmacologic classes linked to compounds, omitting the first three entries and retrieving up to five?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier SKIP 3 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "After skipping the first six entries, what are the next 15 pharmacologic class identifiers that have a specific association with compounds?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find up to 15 gene identifiers that take part in pathways, starting from the seventh result onward?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.identifier SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find five gene identifiers involved in pathways when we exclude the first seven results from the list?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.identifier SKIP 7 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify ten disease names linked to genes, excluding the first five entries from the list?", "output": "MATCH (n:Disease)-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN n.name SKIP 5 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we find the identifiers of genes, starting from the fourth result, that have a participation role in any molecular function and limit the results to five?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.identifier SKIP 3 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for the diseases linked to anatomical structures, bypassing the first 9 entries and returning the next 15.", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.identifier SKIP 9 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "From the set of diseases linked to anatomical entities, which ones, starting after the third, are limited to just fifteen in this query's results?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.name SKIP 3 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Among diseases affecting gene expression by downregulation, what are the identifiers of the five diseases after skipping the first six results?", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN n.identifier SKIP 6 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of five gene identifiers engaged in biological processes, after bypassing the first ten in the result set?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN n.identifier SKIP 10 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers can be found that take part in some pathways, when we skip the first seven records and then retrieve the following 15?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN n.identifier SKIP 7 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of ten compounds that resemble other compounds, omitting the first four in the retrieval?", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) RETURN n.name SKIP 4 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve the identifiers of genes from a list of gene pairs linked by 'COVARIES_GcG,' considering only those pairs after the first 9 found?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) RETURN n.identifier SKIP 9 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of the pharmacologic classes that include compounds, skipping the first three results and returning five?", "output": "MATCH (n:PharmacologicClass)-[r1:INCLUDES_PCiC]->(m:Compound) RETURN n.identifier SKIP 3 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are involved in biological processes, and display only the names, beginning from the fifth entry and returning a maximum of 15?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpBP]->(m:BiologicalProcess) RETURN n.name SKIP 4 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of gene names that regulate other genes, displaying only the results from the 10th to the 24th in the sequence?", "output": "MATCH (n:Gene)-[r1:REGULATES_GrG]->(m:Gene) RETURN n.name SKIP 9 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of genes that are linked to other genes via the 'COVARIES_GcG' relationship, while skipping the first match and limiting the results to 15?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) RETURN n.identifier SKIP 1 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which five disease names come after the first nine when looking at diseases that upregulate genes?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) RETURN n.name SKIP 9 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for compounds linked by the 'RESEMBLES_CrC' relationship, but ignore the first five and limit the output to 15 results.", "output": "MATCH (n:Compound)-[r1:RESEMBLES_CrC]->(m:Compound) RETURN n.identifier SKIP 5 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the disease names that are localizing to anatomy parts after skipping seven results and displaying up to fifteen?", "output": "MATCH (n:Disease)-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN n.name SKIP 7 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of ten diseases that act to downregulate genes, omitting the initial two entries.", "output": "MATCH (n:Disease)-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN n.name SKIP 2 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are covaried with other genes, skipping the first six results and showing the next five?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) RETURN n.name SKIP 6 LIMIT 5"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we find the names of genes, specifying to ignore the first six in sequence, associated with another gene through the 'COVARIES_GcG' relationship, only listing up to 15?", "output": "MATCH (n:Gene)-[r1:COVARIES_GcG]->(m:Gene) RETURN n.name SKIP 6 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What identifiers correspond to genes involved with cellular components if we skip the first seven and only show 15 results?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN n.identifier SKIP 7 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the identifiers for anatomy entities that upregulate genes, but only starting from the 10th after skipping the initial 9?", "output": "MATCH (n:Anatomy)-[r1:UPREGULATES_AuG]->(m:Gene) RETURN n.identifier SKIP 9 LIMIT 10"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene identifiers are linked to molecular functions, ignoring the initial nine matches and displaying no more than 15?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.identifier SKIP 9 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of disease names that influence the upregulation of genes, skipping the first four and showing up to 15 results?", "output": "MATCH (n:Disease)-[r1:UPREGULATES_DuG]->(m:Gene) RETURN n.name SKIP 4 LIMIT 15"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "After skipping six results, what are the names of 15 genes that engage in any type of molecular function?", "output": "MATCH (n:Gene)-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN n.name SKIP 6 LIMIT 15"}]