[{"instruction": "Convert the following natural language into Cypher query.", "input": "What is the method to fetch disease identifiers and names from the database, sorting them primarily by the identifier and secondarily by the name?", "output": "MATCH (n:Disease) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names and descending identifiers of diseases, sorted by their names?", "output": "MATCH (n:Disease) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the names and identifiers of cellular components, sorted by name from A to Z and identifiers in descending order?", "output": "MATCH (n:CellularComponent) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the names and identifiers of Biological Process entities, sorted first by their names in ascending order and then by their identifiers in descending order?", "output": "MATCH (n:BiologicalProcess) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What query can I use to obtain symptom identifiers and names, ordered by identifier alphabetically, with names sorted in reverse alphabetical order?", "output": "MATCH (n:Symptom) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the gene identifiers and names, sorted alphabetically by identifier and by name in descending sequence?", "output": "MATCH (n:Gene) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifiers and names of all BiologicalProcess nodes with the list sorted ascending by identifier and descending by name?", "output": "MATCH (n:BiologicalProcess) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the names and identifiers of molecular functions ordered by name and identifier in ascending order?", "output": "MATCH (n:MolecularFunction) RETURN n.name, n.identifier ORDER BY n.name, n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve a list of gene names and their corresponding identifiers, arranged in ascending order?", "output": "MATCH (n:Gene) RETURN n.name, n.identifier ORDER BY n.name, n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do I retrieve a sorted list of gene identifiers and names from the database?", "output": "MATCH (n:Gene) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of anatomy nodes with their identifiers and names, sorted by identifier first and name in descending order?", "output": "MATCH (n:Anatomy) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the identifier and name for each Pathway from the database, sorted by identifier first and then by name in reverse order?", "output": "MATCH (n:Pathway) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve the names and unique identifiers of 'Anatomy' nodes, sorted alphabetically by their names, with identifiers arranged in descending order?", "output": "MATCH (n:Anatomy) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve and sort all compounds by their identifiers and names in an ascending sequence?", "output": "MATCH (n:Compound) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names and identifiers of all pharmacologic classes, sorted in ascending order?", "output": "MATCH (n:PharmacologicClass) RETURN n.name, n.identifier ORDER BY n.name, n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve and order the identifiers and names of all 'Anatomy' nodes alphabetically?", "output": "MATCH (n:Anatomy) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What query would you use to get the names and identifiers of cellular components in ascending order?", "output": "MATCH (n:CellularComponent) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get all anatomy node names and their identifiers sorted alphabetically?", "output": "MATCH (n:Anatomy) RETURN n.name, n.identifier ORDER BY n.name, n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve the names and identifiers of molecular functions, arranged alphabetically by name and by identifier in descending order?", "output": "MATCH (n:MolecularFunction) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the genes sorted by name and identifier, specifically ordering the names alphabetically and identifiers in reverse order, presented in the database?", "output": "MATCH (n:Gene) RETURN n.name, n.identifier ORDER BY n.name, n.identifier DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve and order the identifiers and names of all symptoms?", "output": "MATCH (n:Symptom) RETURN n.identifier, n.name ORDER BY n.identifier, n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers and names of compounds, arranged by identifier in increasing order, but with names sorted from Z to A?", "output": "MATCH (n:Compound) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do I obtain the identifiers and names of each side effect, sorted initially by identifier and then in descending order by name?", "output": "MATCH (n:SideEffect) RETURN n.identifier, n.name ORDER BY n.identifier, n.name DESC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifier of the BiologicalProcess whose URL attribute is set to \"http://purl.obolibrary.org/obo/GO_0086065\", sorting the results in alphabetical order.", "output": "MATCH (n:BiologicalProcess) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0086065\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do we retrieve and sort in ascending order the gene identifiers for genes labeled with the description \"family with sequence similarity 227, member A\"?", "output": "MATCH (n:Gene) WHERE n.description = \"family with sequence similarity 227, member A\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the pharmacologic class name linked to the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000187063,\" and how is it sorted alphabetically?", "output": "MATCH (n:PharmacologicClass) WHERE n.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000187063\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names that match the InChI \"InChI=1S/Mg.H2O4S/c;1-5(2,3)4/h;(H2,1,2,3,4)/q+2;/p-2\", and sort them in ascending order?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/Mg.H2O4S/c;1-5(2,3)4/h;(H2,1,2,3,4)/q+2;/p-2\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and list the identifiers in alphabetical order for genes described as \"RAB24, member RAS oncogene family\"?", "output": "MATCH (n:Gene) WHERE n.description = \"RAB24, member RAS oncogene family\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of biological process identifiers, sourced from the Gene Ontology, sorted in alphabetical order?", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve and sort alphabetically the names of all pathways with a license type of \"CC BY 3.0\".", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 3.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve a sorted list of cellular component names that have the license \"CC BY 4.0\"?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and list the identifier for the compound whose URL is \"http://www.drugbank.ca/drugs/DB00563\" in ascending order?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00563\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the name of the symptom linked to the URL \"http://identifiers.org/mesh/D001836\" and sort it by name?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D001836\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers of cellular components that have the \"CC BY 4.0\" license, sorted from lowest to highest.", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound identifiers are returned when searching for a compound with the InChI \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\" in ascending order of their identifiers?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H13N3/c1-2-16-13-5-11-9-3-8(6-14-7-9)10(11)4-12(13)15-1/h1-2,4-5,8-9,14H,3,6-7H2/t8-,9+\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and sort by name all of the pathways that have \"PID via Pathway Commons\" as their data source.", "output": "MATCH (n:Pathway) WHERE n.source = \"PID via Pathway Commons\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all pathways whose source is \"Reactome via Pathway Commons\" in ascending alphabetical order.", "output": "MATCH (n:Pathway) WHERE n.source = \"Reactome via Pathway Commons\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and sort alphabetically the identifiers of all cellular components named 'eukaryotic translation initiation factor 2B complex'?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"eukaryotic translation initiation factor 2B complex\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the identifiers for all pathways that have been licensed under \"CC BY 4.0\" and display them in alphabetical order.", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and sort alphabetically the names of molecular functions which have a \"CC BY 4.0\" license?", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the name of the gene that has the specific URL \"http://identifiers.org/ncbigene/158067\" from the gene data set, and sort the results alphabetically?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/158067\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide the identifiers of the pharmacologic class with the name \"Increased Hematopoietic Stem Cell Mobilization,\" sorting them from lowest to highest?", "output": "MATCH (n:PharmacologicClass) WHERE n.name = \"Increased Hematopoietic Stem Cell Mobilization\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of genes associated with Treacher Collins-Franceschetti syndrome 1, listed in ascending order?", "output": "MATCH (n:Gene) WHERE n.description = \"Treacher Collins-Franceschetti syndrome 1\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "If a compound has an InChI value of \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\", what is its name, and how would the names be ordered in an alphabetical list?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C11H11F3N2O3/c1-6(2)10(17)15-7-3-4-9(16(18)19)8(5-7)11(12,13)14/h3-6H,1-2H3,(H,15,17)\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the name of the compound linked to the URL \"http://www.drugbank.ca/drugs/DB00962\" and sort it in ascending order?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00962\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifier of the compound that corresponds to the InChIKey \"HNDVDQJCIGZPNO-YFKPBYRVSA-N\" and sort it alphabetically?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=HNDVDQJCIGZPNO-YFKPBYRVSA-N\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the identifiers for molecular functions whose license is \"CC BY 4.0\", sorted from A to Z?", "output": "MATCH (n:MolecularFunction) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve and sort by ascending order the identifiers of all symptoms whose license is \"CC0 1.0\"?", "output": "MATCH (n:Symptom) WHERE n.license = \"CC0 1.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve and sort the identifiers for anatomy entries whose source is Uberon in an ascending sequence?", "output": "MATCH (n:Anatomy) WHERE n.source = \"Uberon\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the alphabetical list of compound names that have an InChI attribute equal to \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C23H29ClFN3O4/c1-30-21-13-19(26)18(24)12-17(21)23(29)27-20-8-10-28(14-22(20)31-2)9-3-11-32-16-6-4-15(25)5-7-16/h4-7,12-13,20,22H,3,8-11,14,26H2,1-2H3,(H,27,29)/t20-,22+/m1/s1\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the name of the pathway identified by \"PC7_2523\" and display it in ascending order?", "output": "MATCH (n:Pathway) WHERE n.identifier = \"PC7_2523\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and order the identifiers for all pathways with the name \"DNA Replication\" alphabetically in ascent order?", "output": "MATCH (n:Pathway) WHERE n.name = \"DNA Replication\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the identifiers of biological processes licensed as \"CC BY 4.0,\" with results displayed in ascending order by identifier?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you find and sort the identifiers of a MolecularFunction entity that has the URL \"http://purl.obolibrary.org/obo/GO_0032934\"?", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0032934\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the disease name whose identifier is \"DOID:175\" and list it in alphabetical order.", "output": "MATCH (n:Disease) WHERE n.identifier = \"DOID:175\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve and sort in ascending order the identifier of the gene with the URL \"http://identifiers.org/ncbigene/23568\"?", "output": "MATCH (n:Gene) WHERE n.url = \"http://identifiers.org/ncbigene/23568\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of identifiers for symptoms specifically named \"Psychomotor Agitation,\" sorted from smallest to largest?", "output": "MATCH (n:Symptom) WHERE n.name = \"Psychomotor Agitation\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve and alphabetically sort the names of symptoms that use the URL \"http://identifiers.org/mesh/D019080\"?", "output": "MATCH (n:Symptom) WHERE n.url = \"http://identifiers.org/mesh/D019080\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of all genes located on chromosome 5, sorted in ascending order?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"5\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the identifiers of cellular components associated with the Gene Ontology, and ensure they're in ascending order?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve an alphabetically ordered list of symptom names that come from the \"MeSH\" source?", "output": "MATCH (n:Symptom) WHERE n.source = \"MeSH\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and list, in ascending order, the identifiers of compounds that have the exact InChI code \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\"?", "output": "MATCH (n:Compound) WHERE n.inchi = \"InChI=1S/C13H6Cl6O2/c14-6-2-8(16)12(20)4(10(6)18)1-5-11(19)7(15)3-9(17)13(5)21/h2-3,20-21H,1H2\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and alphabetically sort the names of biological processes that originate from the Gene Ontology source?", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you retrieve and rank in ascending order the identifiers of pharmacologic classes with a source labeled \"FDA via DrugCentral\"?", "output": "MATCH (n:PharmacologicClass) WHERE n.source = \"FDA via DrugCentral\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we extract and sort the identifiers of genes that carry a \"CC0 1.0\" license in ascending sequence?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of all genes on chromosome 5, ordered by name in ascending order?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"5\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get an ordered list of names for anatomy items that are associated with the \"CC BY 3.0\" license?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of MolecularFunction entities where their source is \"Gene Ontology,\" sorted alphabetically by their identifier?", "output": "MATCH (n:MolecularFunction) WHERE n.source = \"Gene Ontology\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which cellular component identifiers, with the license \"CC BY 4.0\", exist in the database, sorted alphabetically?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the ordered name (ascending) of the compound that matches the URL \"http://www.drugbank.ca/drugs/DB00464\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00464\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of compound identifiers from the DrugBank source, presented in increasing order?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the identifiers of the Anatomy entities whose mesh_id is \"D017536,\" sorted from lowest to highest?", "output": "MATCH (n:Anatomy) WHERE n.mesh_id = \"D017536\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find and sort the identifiers for the compound at \"http://www.drugbank.ca/drugs/DB00936\"?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00936\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the ordered list of identifiers for the compound with the name \"Metixene\"?", "output": "MATCH (n:Compound) WHERE n.name = \"Metixene\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the identifiers for genes that are licensed under \"CC0 1.0\" and sort them in increasing order?", "output": "MATCH (n:Gene) WHERE n.license = \"CC0 1.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components listed in the database that are sourced from the Gene Ontology, sorted in alphabetical order?", "output": "MATCH (n:CellularComponent) WHERE n.source = \"Gene Ontology\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compound identifiers from DrugBank do we have, sorted in ascending order?", "output": "MATCH (n:Compound) WHERE n.source = \"DrugBank\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the process to obtain the gene identifiers of 'LECT1', sorted from lowest to highest?", "output": "MATCH (n:Gene) WHERE n.name = \"LECT1\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the cellular components with the \"CC BY 4.0\" license sorted alphabetically by name?", "output": "MATCH (n:CellularComponent) WHERE n.license = \"CC BY 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I get the identifiers of 'cell tip' cellular components, sorted in alphabetical order?", "output": "MATCH (n:CellularComponent) WHERE n.name = \"cell tip\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show me a list of identifiers for biological processes that have the \"CC BY 4.0\" license, sorted alphabetically by identifier?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the ordered identifiers of the compound with the given InChIKey \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\"?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=XAUDJQYHKZQPEU-KVQBGUIXSA-N\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of pathway names, licensed as \"CC BY 4.0\", arranged in ascending alphabetical order?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the identifiers of biological processes sourced from the Gene Ontology, sorted in ascending order?", "output": "MATCH (n:BiologicalProcess) WHERE n.source = \"Gene Ontology\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve and sort the identifiers of genes found specifically on chromosome 3?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"3\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the names of anatomy nodes with the license \"CC BY 3.0\", displayed in ascending order?", "output": "MATCH (n:Anatomy) WHERE n.license = \"CC BY 3.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds with a \"CC BY-NC 4.0\" license have their names sorted in ascending order?", "output": "MATCH (n:Compound) WHERE n.license = \"CC BY-NC 4.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the name of the molecular function where its URL equals \"http://purl.obolibrary.org/obo/GO_0005010\", and list it alphabetically.", "output": "MATCH (n:MolecularFunction) WHERE n.url = \"http://purl.obolibrary.org/obo/GO_0005010\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List all the gene names on chromosome 1 and arrange them in ascending order.", "output": "MATCH (n:Gene) WHERE n.chromosome = \"1\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the compound found using the DrugBank URL \"http://www.drugbank.ca/drugs/DB00348\", and how is it displayed in ascending order?", "output": "MATCH (n:Compound) WHERE n.url = \"http://www.drugbank.ca/drugs/DB00348\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of pathways licensed under \"CC0 1.0\", sorted in ascending alphabetical order?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC0 1.0\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes can be found on chromosome 5, and how are they ordered by name?", "output": "MATCH (n:Gene) WHERE n.chromosome = \"5\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain a list of identifiers for Pathway nodes with the \"CC BY 3.0\" license, organized from the lowest to highest identifier?", "output": "MATCH (n:Pathway) WHERE n.license = \"CC BY 3.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What biological process identifiers are retrieved when filtering for a CC BY 4.0 license, with the results organized in ascending order?", "output": "MATCH (n:BiologicalProcess) WHERE n.license = \"CC BY 4.0\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I obtain the identifiers of all biological process entries labeled \"pore complex assembly,\" displayed in an ascending sequence?", "output": "MATCH (n:BiologicalProcess) WHERE n.name = \"pore complex assembly\" RETURN n.identifier ORDER BY n.identifier ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are the names of genes from \"Entrez Gene\" organized if sorted ascendingly?", "output": "MATCH (n:Gene) WHERE n.source = \"Entrez Gene\" RETURN n.name ORDER BY n.name ASC"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which identifier corresponds to the compound associated with the InChIKey \"InChIKey=ATEBXHFBFRCZMA-VXTBVIBXSA-N\", and can it be ordered in ascending order?", "output": "MATCH (n:Compound) WHERE n.inchikey = \"InChIKey=ATEBXHFBFRCZMA-VXTBVIBXSA-N\" RETURN n.identifier ORDER BY n.identifier ASC"}]