[{"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that interact with the compound characterized by the license \"CC BY-NC 4.0\" and the specific InChIKey \"InChIKey=GJSLOMWRLALDCT-UHFFFAOYSA-N\".", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", inchikey: \"InChIKey=GJSLOMWRLALDCT-UHFFFAOYSA-N\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are linked by a \"COVARIES_GcG\" relationship with the specified gene \"cytochrome P450, family 11, subfamily A, polypeptide 1\", according to \"Entrez Gene\".", "output": "MATCH (n:Gene { description: \"cytochrome P450, family 11, subfamily A, polypeptide 1\", source: \"Entrez Gene\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular components linked through the PARTICIPATES_GpCC relationship to the gene with the description \"ATPase, Na+/K+ transporting, alpha 2 polypeptide\" and a CC0 1.0 license.", "output": "MATCH (n:Gene { license: \"CC0 1.0\", description: \"ATPase, Na+/K+ transporting, alpha 2 polypeptide\" })-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of molecular functions connected to the gene node labeled \"Gene\" with the URL \"http://identifiers.org/ncbigene/1592\" and \"CC0 1.0\" license through a PARTICIPATES_GpMF relationship.", "output": "MATCH (n:Gene { license: \"CC0 1.0\", url: \"http://identifiers.org/ncbigene/1592\" })-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list gene names that have a COVARIES_GcG relationship with the gene identified by the description \"solute carrier family 22, member 17\" and the URL \"http://identifiers.org/ncbigene/51310\"?", "output": "MATCH (n:Gene { description: \"solute carrier family 22, member 17\", url: \"http://identifiers.org/ncbigene/51310\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that interact with the compound \"Methylphenobarbital\" through a binding relationship, given it is licensed as \"CC BY-NC 4.0.\"", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", name: \"Methylphenobarbital\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the gene that is related to the gene \"butyrophilin, subfamily 2, member A2\" with the specific URL \"http://identifiers.org/ncbigene/10385\" through the COVARIES_GcG relationship?", "output": "MATCH (n:Gene { description: \"butyrophilin, subfamily 2, member A2\", url: \"http://identifiers.org/ncbigene/10385\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names that are regulated by the gene described as \"autophagy related 16-like 1 (S. cerevisiae)\" in the Entrez Gene source.", "output": "MATCH (n:Gene { description: \"autophagy related 16-like 1 (S. cerevisiae)\", source: \"Entrez Gene\" })-[r1:REGULATES_GrG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are similar to the compound with the license \"CC BY-NC 4.0\" and the URL \"http://www.drugbank.ca/drugs/DB01395\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", url: \"http://www.drugbank.ca/drugs/DB01395\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compound names connected to DrugBank compounds licensed with \"CC BY-NC 4.0\" via a 'RESEMBLES_CrC' relationship?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", source: \"DrugBank\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the anatomy entity with the specific URL \"http://purl.obolibrary.org/obo/UBERON_0002367\" and identifier \"UBERON:0002367\"?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0002367\", identifier: \"UBERON:0002367\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the anatomy entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\" and identifier \"UBERON:0002367\"?", "output": "MATCH (n:Anatomy { url: \"http://purl.obolibrary.org/obo/UBERON_0002367\", identifier: \"UBERON:0002367\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Provide the names of diseases that are treated by the compound with specific license \"CC BY-NC 4.0\" and URL address \"http://www.drugbank.ca/drugs/DB00361\".", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", url: \"http://www.drugbank.ca/drugs/DB00361\" })-[r1:TREATS_CtD]->(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are upregulated by a disease from the Disease Ontology, specifically associated with the URL \"http://purl.obolibrary.org/obo/DOID_11612\"?", "output": "MATCH (n:Disease { source: \"Disease Ontology\", url: \"http://purl.obolibrary.org/obo/DOID_11612\" })-[r1:UPREGULATES_DuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes that interact with the compound having the unique InChI identifier \"InChI=1S/C22H24ClN3O/c1-25-13-4-5-18(12-14-25)26-22(27)20-7-3-2-6-19(20)21(24-26)15-16-8-10-17(23)11-9-16/h2-3,6-11,18H,4-5,12-15H2,1H3\" from DrugBank.", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C22H24ClN3O/c1-25-13-4-5-18(12-14-25)26-22(27)20-7-3-2-6-19(20)21(24-26)15-16-8-10-17(23)11-9-16/h2-3,6-11,18H,4-5,12-15H2,1H3\", source: \"DrugBank\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that have a COVARIES_GcG association with the gene marked as \"vascular endothelial growth factor A\" in the Entrez Gene database.", "output": "MATCH (n:Gene { description: \"vascular endothelial growth factor A\", source: \"Entrez Gene\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the prostate gland, identified by UBERON:0002367, in the database?", "output": "MATCH (n:Anatomy { name: \"prostate gland\", identifier: \"UBERON:0002367\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names affected by the downregulation from a compound with the license \"CC BY-NC 4.0\" and InChI identifier \"InChI=1S/C9H11FN2O5/c10-4-2-12(9(16)11-8(4)15)7-1-5(14)6(3-13)17-7/h2,5-7,13-14H,1,3H2,(H,11,15,16)/t5-,6+,7+/m0/s1\".", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", inchi: \"InChI=1S/C9H11FN2O5/c10-4-2-12(9(16)11-8(4)15)7-1-5(14)6(3-13)17-7/h2,5-7,13-14H,1,3H2,(H,11,15,16)/t5-,6+,7+/m0/s1\" })-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the gene that the compound with InChI value \"InChI=1S/C22H25NO6/c1-12(24)23-16-8-6-13-10-19(27-3)21(28-4)22(29-5)20(13)14-7-9-18(26-2)17(25)11-15(14)16/h7,9-11,16H,6,8H2,1-5H3,(H,23,24)\" and identifier \"DB01394\" binds to?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C22H25NO6/c1-12(24)23-16-8-6-13-10-19(27-3)21(28-4)22(29-5)20(13)14-7-9-18(26-2)17(25)11-15(14)16/h7,9-11,16H,6,8H2,1-5H3,(H,23,24)\", identifier: \"DB01394\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the compounds that are linked by the \"RESEMBLES_CrC\" relationship to the compound named \"Dyclonine\" with the license \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", name: \"Dyclonine\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the genes that experience downregulation interactions with the disease whose license is \"CC BY 3.0\" and corresponds to the URL \"http://purl.obolibrary.org/obo/DOID_1793\"?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", url: \"http://purl.obolibrary.org/obo/DOID_1793\" })-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the anatomy entity with mesh_id \"D011467\" and bto_id \"BTO:0001129\" upregulates according to the database?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", bto_id: \"BTO:0001129\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are regulated downward by the anatomy entity tagged with Uberon source and given URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (n:Anatomy { source: \"Uberon\", url: \"http://purl.obolibrary.org/obo/UBERON_0002367\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy entities associated with diseases that have a \"CC BY 3.0\" license and are sourced from the Disease Ontology?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", source: \"Disease Ontology\" })-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical structures where the disease with the URL \"http://purl.obolibrary.org/obo/DOID_13241\" and identifier \"DOID:13241\" localizes?", "output": "MATCH (n:Disease { url: \"http://purl.obolibrary.org/obo/DOID_13241\", identifier: \"DOID:13241\" })-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the disease \"pancreatic cancer\" downregulates according to the specified URL?", "output": "MATCH (n:Disease { url: \"http://purl.obolibrary.org/obo/DOID_1793\", name: \"pancreatic cancer\" })-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the pathway names where the gene \"argonaute RISC catalytic component 1\" from Entrez Gene is a participant?", "output": "MATCH (n:Gene { description: \"argonaute RISC catalytic component 1\", source: \"Entrez Gene\" })-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of compounds that are deemed similar to the compound identified by \"DB00748\" under the \"CC BY-NC 4.0\" license.", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", identifier: \"DB00748\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of genes connected to the gene with chromosome 6 and description \"zinc finger and SCAN domain containing 9\" via a COVARIES_GcG relationship?", "output": "MATCH (n:Gene { chromosome: \"6\", description: \"zinc finger and SCAN domain containing 9\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that are bound by the compound with the InChIKey \"PJVWKTKQMONHTI-UHFFFAOYNA-N\" and the license \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", inchikey: \"InChIKey=PJVWKTKQMONHTI-UHFFFAOYNA-N\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes associated with the disease that has the license \"CC BY 3.0\" and the URL \"http://purl.obolibrary.org/obo/DOID_2377\"?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", url: \"http://purl.obolibrary.org/obo/DOID_2377\" })-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the prostate gland according to the Uberon source?", "output": "MATCH (n:Anatomy { source: \"Uberon\", name: \"prostate gland\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are expressed by the anatomy labeled as \"prostate gland\" with the BTO identifier \"BTO:0001129\"?", "output": "MATCH (n:Anatomy { name: \"prostate gland\", bto_id: \"BTO:0001129\" })-[r1:EXPRESSES_AeG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the pathways by name where the gene with URL \"http://identifiers.org/ncbigene/8361\", originating from Entrez Gene, takes part.", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/8361\", source: \"Entrez Gene\" })-[r1:PARTICIPATES_GpPW]->(m:Pathway) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that have a 'COVARIES_GcG' relationship with the 'KRT15' gene from the Entrez Gene source?", "output": "MATCH (n:Gene { name: \"KRT15\", source: \"Entrez Gene\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes share a \"COVARIES_GcG\" connection with the gene labeled \"PRMT1,\" which has the URL \"http://identifiers.org/ncbigene/3276\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/3276\", name: \"PRMT1\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds included in the pharmacologic class identified as Nucleoside Reverse Transcriptase Inhibitors, with the identifier N0000009947?", "output": "MATCH (n:PharmacologicClass { identifier: \"N0000009947\", name: \"Nucleoside Reverse Transcriptase Inhibitors\" })-[r1:INCLUDES_PCiC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the compound names that belong to pharmacologic classes with the physiologic effect class type and a CC BY 4.0 license?", "output": "MATCH (n:PharmacologicClass { class_type: \"Physiologic Effect\", license: \"CC BY 4.0\" })-[r1:INCLUDES_PCiC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical areas mentioned where the disease from the Disease Ontology with the URL \"http://purl.obolibrary.org/obo/DOID_1826\" is known to localize.", "output": "MATCH (n:Disease { source: \"Disease Ontology\", url: \"http://purl.obolibrary.org/obo/DOID_1826\" })-[r1:LOCALIZES_DlA]->(m:Anatomy) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene names that are downregulated by the anatomy node with the specific identifiers mesh ID \"D011467\" and UBERON ID \"0002367\".", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", identifier: \"UBERON:0002367\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the disease names that have a palliative relationship with the compound Risperidone as per its entry with URL \"http://www.drugbank.ca/drugs/DB00734\"?", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB00734\", name: \"Risperidone\" })-[r1:PALLIATES_CpD]->(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list cellular component names associated with the gene identified by \"phosphatidylinositol-4-phosphate 5-kinase, type I, gamma\" at \"http://identifiers.org/ncbigene/23396\"?", "output": "MATCH (n:Gene { description: \"phosphatidylinositol-4-phosphate 5-kinase, type I, gamma\", url: \"http://identifiers.org/ncbigene/23396\" })-[r1:PARTICIPATES_GpCC]->(m:CellularComponent) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are returned for the compound Apraclonidine, matching a specific InChI code, that bind through the BINDS_CbG relationship?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C9H10Cl2N4/c10-6-3-5(12)4-7(11)8(6)15-9-13-1-2-14-9/h3-4H,1-2,12H2,(H2,13,14,15)\", name: \"Apraclonidine\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the anatomy entity with the identifier \"UBERON:0002367\" and licensed under \"CC BY 3.0\"?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\", identifier: \"UBERON:0002367\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes downregulated by the disease with the identifier \"DOID:11612\" and a license of \"CC BY 3.0\"?  ", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", identifier: \"DOID:11612\" })-[r1:DOWNREGULATES_DdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of any compound that resembles the compound with a license \"CC BY-NC 4.0\" and an InChIKey of \"CMHHMUWAYWTMGS-UHFFFAOYSA-N\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", inchikey: \"InChIKey=CMHHMUWAYWTMGS-UHFFFAOYSA-N\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are being upregulated by the Uberon anatomy component with identifier \"UBERON:0002367\" through the UPREGULATES_AuG relationship?", "output": "MATCH (n:Anatomy { source: \"Uberon\", identifier: \"UBERON:0002367\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the compound with InChIKey \"SHGAZHPCJJPHSC-YCNIQYBTSA-N\" from DrugBank?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=SHGAZHPCJJPHSC-YCNIQYBTSA-N\", source: \"DrugBank\" })-[r1:UPREGULATES_CuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the symptoms that are linked to the Disease Ontology disease identified by DOID:5612.", "output": "MATCH (n:Disease { source: \"Disease Ontology\", identifier: \"DOID:5612\" })-[r1:PRESENTS_DpS]->(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are reported to be downregulated by the compound associated with the DrugBank URL for Pindolol?", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB00960\", name: \"Pindolol\" })-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound names that are linked by resemblance to DrugBank compounds with a specified CC BY-NC 4.0 license?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", source: \"DrugBank\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the InChIKey \"JWBOIMRXGHLCPP-UHFFFAOYSA-N\" and a license of \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", inchikey: \"InChIKey=JWBOIMRXGHLCPP-UHFFFAOYSA-N\" })-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the gene names linked by a downregulation relationship from the anatomy node with Mesh ID \"D011467\" and source specified as \"Uberon\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", source: \"Uberon\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are linked to the prostate gland through the EXPRESSES_AeG relationship in the dataset where the prostate gland has the mesh ID \"D011467\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", name: \"prostate gland\" })-[r1:EXPRESSES_AeG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For the gene on chromosome 6 with the URL \"http://identifiers.org/ncbigene/7919\", what are the names of the molecular functions it is involved in?", "output": "MATCH (n:Gene { chromosome: \"6\", url: \"http://identifiers.org/ncbigene/7919\" })-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are associated with CAMKK1, identified by the URL \"http://identifiers.org/ncbigene/84254\", through the \"COVARIES_GcG\" relationship?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/84254\", name: \"CAMKK1\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are linked to being upregulated by the prostate gland, identified by BTO:0001129, through the UPREGULATES_AuG relationship?", "output": "MATCH (n:Anatomy { name: \"prostate gland\", bto_id: \"BTO:0001129\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by compounds with a \"CC BY-NC 4.0\" license from DrugBank?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", source: \"DrugBank\" })-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are influenced by the gene called NAA25 on chromosome 12 according to the \"REGULATES_GrG\" relationship?", "output": "MATCH (n:Gene { chromosome: \"12\", name: \"NAA25\" })-[r1:REGULATES_GrG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are linked to the disease with identifier \"DOID:10608\" in the source 'Disease Ontology'?", "output": "MATCH (n:Disease { source: \"Disease Ontology\", identifier: \"DOID:10608\" })-[r1:PRESENTS_DpS]->(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the anatomy part with mesh ID \"D011467\" and BTO ID \"BTO:0001129\"?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", bto_id: \"BTO:0001129\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that covary with the gene identified as solute carrier family 22, member 17 and have a CC0 1.0 license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\", description: \"solute carrier family 22, member 17\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the \"VTN\" gene, obtained from the \"Entrez Gene\" source, covaries with, according to the GcG relationship?", "output": "MATCH (n:Gene { name: \"VTN\", source: \"Entrez Gene\" })-[r1:COVARIES_GcG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the compound Carbinoxamine, identified by the URL \"http://www.drugbank.ca/drugs/DB00748\", is known to upregulate?", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB00748\", name: \"Carbinoxamine\" })-[r1:UPREGULATES_CuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are connected to the disease with a license type of \"CC BY 3.0\" and the specific URL \"http://purl.obolibrary.org/obo/DOID_8778\"?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", url: \"http://purl.obolibrary.org/obo/DOID_8778\" })-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the molecular functions linked to the gene labeled with the URL http://identifiers.org/ncbigene/7345 and the license type CC0 1.0.", "output": "MATCH (n:Gene { license: \"CC0 1.0\", url: \"http://identifiers.org/ncbigene/7345\" })-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are downregulated by the compound with the InChIKey 'NWIBSHFKIJFRCO-WUDYKRTCSA-N' and URL 'http://www.drugbank.ca/drugs/DB00305'?", "output": "MATCH (n:Compound { inchikey: \"InChIKey=NWIBSHFKIJFRCO-WUDYKRTCSA-N\", url: \"http://www.drugbank.ca/drugs/DB00305\" })-[r1:DOWNREGULATES_CdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that interact with the gene described as \"tumor protein p73\" and named \"TP73\"?", "output": "MATCH (n:Gene { description: \"tumor protein p73\", name: \"TP73\" })-[r1:INTERACTS_GiG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes that interact with the gene named \"DDX5\" which has the URL \"http://identifiers.org/ncbigene/1655\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/1655\", name: \"DDX5\" })-[r1:INTERACTS_GiG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptom names are presented by diseases that are licensed under \"CC BY 3.0\" and obtained from the disease ontology?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", source: \"Disease Ontology\" })-[r1:PRESENTS_DpS]->(m:Symptom) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the name of the molecular function that the gene described as \"solute carrier family 43 (amino acid system L transporter), member 1\" from the Entrez Gene source participates in?", "output": "MATCH (n:Gene { description: \"solute carrier family 43 (amino acid system L transporter), member 1\", source: \"Entrez Gene\" })-[r1:PARTICIPATES_GpMF]->(m:MolecularFunction) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of compounds that belong to the pharmacologic class with the specific license \"CC BY 4.0\" and URL \"http://purl.bioontology.org/ontology/NDFRT/N0000175833\"?", "output": "MATCH (n:PharmacologicClass { license: \"CC BY 4.0\", url: \"http://purl.bioontology.org/ontology/NDFRT/N0000175833\" })-[r1:INCLUDES_PCiC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the gene names that are upregulated by the anatomy entity with the identifier \"UBERON:0002367\" within the Uberon dataset?", "output": "MATCH (n:Anatomy { source: \"Uberon\", identifier: \"UBERON:0002367\" })-[r1:UPREGULATES_AuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes connected to the disease specified by the URL \"http://purl.obolibrary.org/obo/DOID_10871\" and possessing the license \"CC BY 3.0\"?", "output": "MATCH (n:Disease { license: \"CC BY 3.0\", url: \"http://purl.obolibrary.org/obo/DOID_10871\" })-[r1:ASSOCIATES_DaG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that the anatomy entity with the mesh ID \"D011467\" and a license of \"CC BY 3.0\" downregulates?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\", mesh_id: \"D011467\" })-[r1:DOWNREGULATES_AdG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are regulated by genes located on chromosome 3 from the \"Entrez Gene\" source?", "output": "MATCH (n:Gene { chromosome: \"3\", source: \"Entrez Gene\" })-[r1:REGULATES_GrG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases are treated by the compound with the license \"CC BY-NC 4.0\" and identifier \"DB00445\" according to the database?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", identifier: \"DB00445\" })-[r1:TREATS_CtD]->(m:Disease) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are enhanced by the compound having the identifier \"DB00264\" and the license \"CC BY-NC 4.0\"?", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\", identifier: \"DB00264\" })-[r1:UPREGULATES_CuG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are identified as resembling the compound with URL \"http://www.drugbank.ca/drugs/DB01165\", and what are their respective names?", "output": "MATCH (n:Compound { url: \"http://www.drugbank.ca/drugs/DB01165\", identifier: \"DB01165\" })-[r1:RESEMBLES_CrC]->(m:Compound) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of genes that are linked to the anatomy with mesh_id \"D011467\" and bto_id \"BTO:0001129\" through the relationship 'EXPRESSES_AeG'?", "output": "MATCH (n:Anatomy { mesh_id: \"D011467\", bto_id: \"BTO:0001129\" })-[r1:EXPRESSES_AeG]->(m:Gene) RETURN m.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that bind with a compound identified by the InChI \"InChI=1S/C17H16ClN3O/c18-12-5-6-15-13(11-12)17(21-9-7-19-8-10-21)20-14-3-1-2-4-16(14)22-15/h1-6,11,19H,7-10H2\" in the DrugBank database?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C17H16ClN3O/c18-12-5-6-15-13(11-12)17(21-9-7-19-8-10-21)20-14-3-1-2-4-16(14)22-15/h1-6,11,19H,7-10H2\", source: \"DrugBank\" })-[r1:BINDS_CbG]->(m:Gene) RETURN m.name"}]