[{"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are used to palliate attention deficit hyperactivity disorder?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"attention deficit hyperactivity disorder\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of compounds that are known to palliate the disease having the identifier DOID:10763?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:10763\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the names of compounds that are connected to the palliation of the disease referred to as \"DOID:3312\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:3312\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all compounds that are linked to palliating the condition known as restless legs syndrome.", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"restless legs syndrome\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compounds that palliate the disease with the identifier \"DOID:594\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:594\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of compounds that have a palliation relationship with the disease migraine?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"migraine\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to palliate attention deficit hyperactivity disorder?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{name: \"attention deficit hyperactivity disorder\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which compounds are known to palliate the disease associated with the identifier DOID:2531?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:2531\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the compounds that are known to palliate the disease linked to the identifier \"DOID:1595\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:1595\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you tell me the names of compounds that help palliate the disease with the identifier \"DOID:0050741\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:0050741\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of compounds that have been linked to palliate the disease with the identifier \"DOID:2377\"?", "output": "MATCH (c:Compound)-[:PALLIATES_CpD]->(:Disease{identifier: \"DOID:2377\"}) RETURN c.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that are palliated by the compound with the identifier \"DB00564.\"", "output": "MATCH (:Compound{identifier: \"DB00564\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that can be palliated by the compound with identifier \"DB01234\"?", "output": "MATCH (:Compound{identifier: \"DB01234\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are palliated by the compound with the identifier \"DB00977\"?", "output": "MATCH (:Compound{identifier: \"DB00977\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are palliated by the compound with the identifier \"DB01020\"?  ", "output": "MATCH (:Compound{identifier: \"DB01020\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that can be palliated by the compound with identifier \"DB00734\"?", "output": "MATCH (:Compound{identifier: \"DB00734\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the diseases that are palliated by the compound known as \"DB08866.\"", "output": "MATCH (:Compound{identifier: \"DB08866\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of diseases that are palliated by the compound specified by the identifier \"DB00500\"?", "output": "MATCH (:Compound{identifier: \"DB00500\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that are palliated by the chemical compound with the identifier \"DB01166\".", "output": "MATCH (:Compound{identifier: \"DB01166\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find the disease names that are alleviated by the compound with the identifier \"DB00742\"?", "output": "MATCH (:Compound{identifier: \"DB00742\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "For the compound with identifier DB00215, what are the names of the diseases it palliates?", "output": "MATCH (:Compound{identifier: \"DB00215\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases can be palliated by the compound with the identifier \"DB01394\"?", "output": "MATCH (:Compound{identifier: \"DB01394\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB00458\" is known to alleviate?", "output": "MATCH (:Compound{identifier: \"DB00458\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are alleviated by the compound with the identifier \"DB00343\"?", "output": "MATCH (:Compound{identifier: \"DB00343\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of diseases that are mitigated by the compound identified as \"DB01435\".", "output": "MATCH (:Compound{identifier: \"DB01435\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that can be alleviated by the compound with the identifier \"DB01085\"?", "output": "MATCH (:Compound{identifier: \"DB01085\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are alleviated by the compound with the identifier \"DB00813\"?", "output": "MATCH (:Compound{identifier: \"DB00813\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases which the compound with identifier \"DB00320\" helps to alleviate?", "output": "MATCH (:Compound{identifier: \"DB00320\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the diseases that are palliated by the compound with the identifier \"DB01142\"?", "output": "MATCH (:Compound{identifier: \"DB01142\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you provide a list of diseases that are palliated by the compound with the identifier \"DB00852\"?", "output": "MATCH (:Compound{identifier: \"DB00852\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with the identifier \"DB01240\" is used to alleviate?", "output": "MATCH (:Compound{identifier: \"DB01240\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases can be palliated by the compound with the identifier \"DB00741\" according to this database?", "output": "MATCH (:Compound{identifier: \"DB00741\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that the compound with identifier \"DB01401\" helps alleviate?", "output": "MATCH (:Compound{identifier: \"DB01401\"})-[:PALLIATES_CpD]->(d:Disease) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that downregulate the gene known as PDE4DIP?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"PDE4DIP\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy entities that downregulate the gene named DUPD1?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"DUPD1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that downregulate the gene PTBP3?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"PTBP3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the anatomy names that are responsible for downregulating the gene called \"DCC\".", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"DCC\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that downregulate the gene named \"RUNX3\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"RUNX3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of Anatomy entities that downregulate the gene named SRP19?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"SRP19\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names appear to downregulate the gene named CTAG1A?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"CTAG1A\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names are associated with the downregulation of genes that reside on chromosome 17?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"17\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that downregulate the gene named TDGF1?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"TDGF1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical parts that downregulate the gene \"KLHL3\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"KLHL3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that downregulate the gene named LIPE?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"LIPE\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical structures that downregulate the gene called SOCS3?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"SOCS3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the set of anatomical names linked to the downregulation of the gene \"SLC15A3\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"SLC15A3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that are involved in downregulating the gene RNASE9?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"RNASE9\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical names that are associated with the downregulation of genes found on chromosome 16.", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"16\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the anatomical names involved in downregulating those genes that reside on chromosome 8?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"8\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy entities that downregulate the gene named PURG?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"PURG\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy entities that exhibit a downregulating effect on the gene called \"TSPAN16\".", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"TSPAN16\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical structures that downregulate the gene named \"XKR9\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"XKR9\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names are linked to the downregulation of the gene named CCDC179?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"CCDC179\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomical entities are involved in the downregulation of the gene named TUBA3C?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"TUBA3C\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that downregulate genes located on the X chromosome?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"X\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that downregulate the gene known as \"C1orf101\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"C1orf101\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that downregulate the gene named \"SLC4A1\"?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"SLC4A1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that downregulate the gene BTG4?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{name: \"BTG4\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names are linked to downregulating gene expression on chromosome 9?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"9\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the anatomical names connected to the downregulation of genes on chromosome 3?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list anatomy names that are involved in the downregulation of any gene on chromosome 3?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical entities by name that play a role in the downregulation of any gene on chromosome 11.", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"11\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that downregulate any gene on the 13th chromosome?", "output": "MATCH (a:Anatomy)-[:DOWNREGULATES_AdG]->(:Gene{chromosome: \"13\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are upregulated by the anatomy entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0002367\"})-[:UPREGULATES_AuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are upregulated by the specified anatomy with identifier \"UBERON:0002367\"?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0002367\"})-[:UPREGULATES_AuG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that upregulate the gene named \"NEDD4L\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"NEDD4L\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that upregulate the gene named \"SCN7A\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"SCN7A\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy elements that are known to upregulate the gene with the name \"ZC3H7A\".", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"ZC3H7A\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical structures that upregulate the gene named PLA2G7?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"PLA2G7\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical parts that are linked to upregulating the gene with the name AQP3.", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"AQP3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical structures that upregulate the gene named \"KLRC2\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"KLRC2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomy entities that upregulate the gene CACNA2D1?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"CACNA2D1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that upregulate the gene named \"SH3RF1\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"SH3RF1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that upregulate the gene SALL3?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"SALL3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that influence the upregulation of genes on chromosome 11 through a regulatory action?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"11\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that upregulate the gene identified as PCDHGA6?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"PCDHGA6\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that upregulate the gene ABCB5?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"ABCB5\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomies are associated with the upregulation of genes on chromosome 4, specifically by their names?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"4\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomical structures are known to upregulate the gene named COQ4?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"COQ4\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy entities that have a connection of upregulation to the gene named \"COL4A6.\"", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"COL4A6\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomies are responsible for the upregulation of the gene named ZNF649?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"ZNF649\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomy names linked to the upregulation of genes that are specifically on chromosome 3.", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the anatomical names that have a role in upregulating the gene identified as RRNAD1.", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"RRNAD1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you list the names of anatomies that have a role in upregulating the \"TCTA\" gene?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"TCTA\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities that upregulate the gene named \"ACTN1\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"ACTN1\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that upregulate the gene named \"FRMPD2\"?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"FRMPD2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy names that serve to upregulate the gene identified as CHRM2?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"CHRM2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of anatomy names involved in upregulating the gene PRPS2?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"PRPS2\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical names are associated with upregulating genes on the fifth chromosome?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"5\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that upregulate genes located on the X chromosome?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"X\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical entities that increase the expression of the gene TBX20?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"TBX20\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical structures that upregulate the gene ZNF606?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"ZNF606\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomical terms are associated with upregulating genes whose chromosome is X?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{chromosome: \"X\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical entities associated with the upregulation of the gene \"EPN3\".", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"EPN3\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomical components that upregulate the gene labeled as SPATS2L?", "output": "MATCH (a:Anatomy)-[:UPREGULATES_AuG]->(:Gene{name: \"SPATS2L\"}) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of compounds associated with the pharmacologic class having the identifier \"N0000190113\"?", "output": "MATCH (:PharmacologicClass{identifier: \"N0000190113\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that are included in the pharmacologic class known as \"Chemokine Co-receptor 5 Antagonists\"?", "output": "MATCH (:PharmacologicClass{name: \"Chemokine Co-receptor 5 Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound names included in the pharmacologic class known as \"Serotonin Uptake Inhibitors\"?", "output": "MATCH (:PharmacologicClass{name: \"Serotonin Uptake Inhibitors\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that belong to the pharmacologic class known as \"Angiotensin 2 Receptor Antagonists\"?", "output": "MATCH (:PharmacologicClass{name: \"Angiotensin 2 Receptor Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "If the pharmacologic class has the identifier \"N0000175375\", what are the names of the compounds it includes?", "output": "MATCH (:PharmacologicClass{identifier: \"N0000175375\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of compounds that belong to the pharmacologic class labeled as \"Sodium-Glucose Transporter 2 Inhibitors\"?", "output": "MATCH (:PharmacologicClass{name: \"Sodium-Glucose Transporter 2 Inhibitors\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of compounds that are part of the pharmacologic class specified by the identifier \"N0000175087\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000175087\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of compounds that are part of the \"Aminoglycosides\" pharmacologic class.", "output": "MATCH (:PharmacologicClass{name: \"Aminoglycosides\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the compounds that are classified under the Pharmacologic Class named \"Corticosteroid Hormone Receptor Agonists\"?", "output": "MATCH (:PharmacologicClass{name: \"Corticosteroid Hormone Receptor Agonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that belong to the pharmacologic class with X-Ray Contrast Activity?", "output": "MATCH (:PharmacologicClass{name: \"X-Ray Contrast Activity\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that belong to the pharmacologic class known as Microsomal Triglyceride Transfer Protein Inhibitors?", "output": "MATCH (:PharmacologicClass{name: \"Microsomal Triglyceride Transfer Protein Inhibitors\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds that belong to the pharmacologic class with the name \"Decreased Protein Synthesis\"?", "output": "MATCH (:PharmacologicClass{name: \"Decreased Protein Synthesis\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of compounds associated with the pharmacologic class whose identifier is \"N0000175732\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000175732\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of all compounds that fall under the pharmacologic class having the identifier \"N0000009948\".", "output": "MATCH (:PharmacologicClass{identifier: \"N0000009948\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of compounds included in the pharmacologic class \"Cytochrome P450 3A Inhibitors\"?", "output": "MATCH (:PharmacologicClass{name: \"Cytochrome P450 3A Inhibitors\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of compound names that are associated with the pharmacologic class called \"Cholinergic Muscarinic Antagonists\"?", "output": "MATCH (:PharmacologicClass{name: \"Cholinergic Muscarinic Antagonists\"})-[:INCLUDES_PCiC]->(g:Compound) RETURN g.name"}]