[{"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular component names are linked to genes specifically from chromosome 17?", "output": "MATCH (:Gene{chromosome: \"17\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components in which the NDUFS1 gene is involved?", "output": "MATCH (:Gene{name: \"NDUFS1\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components associated with the gene BRIP1?", "output": "MATCH (:Gene{name: \"BRIP1\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular components by name that genes from chromosome 4 are associated with?", "output": "MATCH (:Gene{chromosome: \"4\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular component names linked to the participation of the gene \"MRPS18C\".", "output": "MATCH (:Gene{name: \"MRPS18C\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of cellular components associated with the gene HSD17B8?", "output": "MATCH (:Gene{name: \"HSD17B8\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of cellular components that have associations with genes on chromosome 19.", "output": "MATCH (:Gene{chromosome: \"19\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the cellular components that have a participation relationship with the PLCB3 gene.", "output": "MATCH (:Gene{name: \"PLCB3\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the cellular components that genes located on chromosome 19 participate in?", "output": "MATCH (:Gene{chromosome: \"19\"})-[:PARTICIPATES_GpCC]->(cc:CellularComponent) RETURN cc.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the myenteric nerve plexus?", "output": "MATCH (:Anatomy{name: \"myenteric nerve plexus\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the anatomy entity with the URL \"http://purl.obolibrary.org/obo/UBERON_0001003\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0001003\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed in the myenteric nerve plexus?", "output": "MATCH (:Anatomy{name: \"myenteric nerve plexus\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are found to be expressed by the skin epidermis in this query?", "output": "MATCH (:Anatomy{name: \"skin epidermis\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the anatomy with the URL \"http://purl.obolibrary.org/obo/UBERON_0002367\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0002367\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by anatomy with the identifier \"UBERON:0002367\"?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0002367\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the names of genes that are expressed in the anatomy specified by \"UBERON:0001003\"?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0001003\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the anatomical structure with the URL \"http://purl.obolibrary.org/obo/UBERON_0002394\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0002394\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed in the anatomical structure associated with the URL \"http://purl.obolibrary.org/obo/UBERON_0002512\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0002512\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes linked to the anatomy entity with identifier \"UBERON:0001003\" through expression?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0001003\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the anatomical structure with the URL \"http://purl.obolibrary.org/obo/UBERON_0001088\"?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0001088\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes expressed by the anatomy entity with the identifier \"UBERON:0001088\"?", "output": "MATCH (:Anatomy{identifier: \"UBERON:0001088\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are associated with the anatomical structure that has the URL \"http://purl.obolibrary.org/obo/UBERON_0001003\" through an expression relationship?", "output": "MATCH (:Anatomy{url: \"http://purl.obolibrary.org/obo/UBERON_0001003\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are expressed by the anatomy part known as the prostate gland?", "output": "MATCH (:Anatomy{name: \"prostate gland\"})-[:EXPRESSES_AeG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of anatomy names connected to the disease having the identifier \"DOID:1612\"?", "output": "MATCH (:Disease{identifier: \"DOID:1612\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy entities participate in the disease having the identifier DOID:10608, and what are their names?", "output": "MATCH (:Disease{identifier: \"DOID:10608\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of anatomy parts linked to the disease with the identifier of \"DOID:10763.\"", "output": "MATCH (:Disease{identifier: \"DOID:10763\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names are linked to the disease with the identifier \"DOID:11934\" through a participation relationship?", "output": "MATCH (:Disease{identifier: \"DOID:11934\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of all anatomical entities linked to the disease with the identifier DOID:1793?", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names are linked to the disease represented by identifier \"DOID:10871\"?", "output": "MATCH (:Disease{identifier: \"DOID:10871\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the anatomical names that participate in connection with the disease having identifier \"DOID:9970\".", "output": "MATCH (:Disease{identifier: \"DOID:9970\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of anatomy names that participate in the disease with ID DOID:10763?", "output": "MATCH (:Disease{identifier: \"DOID:10763\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy entities linked to the disease with the identifier \"DOID:13241\"?", "output": "MATCH (:Disease{identifier: \"DOID:13241\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomical names correspond to the anatomy that participates with the disease having the identifier \"DOID:1936\"?", "output": "MATCH (:Disease{identifier: \"DOID:1936\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy entities that are associated through participation with the disease coded as \"DOID:11949\"?", "output": "MATCH (:Disease{identifier: \"DOID:11949\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy names are involved with the disease having the identifier \"DOID:5041\"?", "output": "MATCH (:Disease{identifier: \"DOID:5041\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of anatomical entities related to the disease with the identifier \"DOID:7693\"?", "output": "MATCH (:Disease{identifier: \"DOID:7693\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "In the case of abdominal aortic aneurysm, what are the related anatomy names returned by the database?", "output": "MATCH (:Disease{name: \"abdominal aortic aneurysm\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the anatomy names associated with the disease whose identifier is \"DOID:184\"?", "output": "MATCH (:Disease{identifier: \"DOID:184\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names are involved with the disease coded as DOID:10763?", "output": "MATCH (:Disease{identifier: \"DOID:10763\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What anatomy is related to the specific disease with the identifier DOID:184?", "output": "MATCH (:Disease{identifier: \"DOID:184\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of anatomy parts that play a role in the disease denoted by the identifier \"DOID:8850\"?", "output": "MATCH (:Disease{identifier: \"DOID:8850\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which anatomy names are relevant to the disease specified by the identifier DOID:8778?", "output": "MATCH (:Disease{identifier: \"DOID:8778\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the anatomy entities that have a participation relationship with the disease identified by DOID:11934?", "output": "MATCH (:Disease{identifier: \"DOID:11934\"})-[:PARTICIPATES_GpCC]->(a:Anatomy) RETURN a.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of diseases are found to involve the clavicle bone according to the given dataset?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"clavicle bone\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names can be found linked to the anterior vena cava in the database?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"anterior vena cava\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve the anatomy identified as the central retinal vein?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"central retinal vein\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve participation in the femoral vein according to this database?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"femoral vein\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of diseases that participate in the collecting duct of the renal tubule?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"collecting duct of renal tubule\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the corneal endothelium?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"corneal endothelium\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the anatomy known as the rectus abdominis muscle?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"rectus abdominis muscle\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve the anatomy part named \"vertebral bone 2\"?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"vertebral bone 2\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are involved with the ethmoid bone through anatomical participation?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"ethmoid bone\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases associated with the superior mesenteric artery through the PARTICIPATES_GpCC relationship?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"superior mesenteric artery\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve the adrenal cortex as part of their anatomical association?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"adrenal cortex\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the cranial nerve II according to the database?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"cranial nerve II\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve the adrenal cortex as part of their pathology?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"adrenal cortex\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of diseases that participate in the anatomical category identified as \"UBERON:0001833\".", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0001833\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are connected to the endocrine gland through participation?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"endocrine gland\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases linked to the hepatic vein anatomy?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"hepatic vein\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of diseases connected to the anatomical structure with the ID \"UBERON:0001969\".", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0001969\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that involve the popliteal artery?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"popliteal artery\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that have a participation relationship with the cranial nerve?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"cranial nerve\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that show a connection to the lymph node as per the data?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"lymph node\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are connected to the anatomical component denoted by the identifier \"UBERON:0001619\"?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0001619\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that interact with or are related to the juxtaglomerular apparatus structure?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"juxtaglomerular apparatus\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify diseases that are connected to the lower jaw region through participation.", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"lower jaw region\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names correspond to those involving the anatomical structure with identifier \"UBERON:0001771\"?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0001771\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases linked to the anatomical structure with the identifier UBERON:0002363.", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0002363\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the anatomy called \"lymphoid tissue\"?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"lymphoid tissue\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What names of diseases are documented to participate through the renal vein in anatomy datasets?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"renal vein\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list the names of diseases that participate with the anatomy entity marked by the identifier \"UBERON:0001827\"?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{identifier: \"UBERON:0001827\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What diseases have a connection with the lumbar vertebra according to their anatomical participation?", "output": "MATCH (d:Disease)-[:PARTICIPATES_GpCC]->(:Anatomy{name: \"lumbar vertebra\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes connected to the disease whose identifier is \"DOID:1793\".", "output": "MATCH (:Disease{identifier: \"DOID:1793\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the names of genes that have a connection to the disease with the identifier DOID:8778.", "output": "MATCH (:Disease{identifier: \"DOID:8778\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the genes connected to the disease with the identifier DOID:2377, and what are their names?", "output": "MATCH (:Disease{identifier: \"DOID:2377\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes that have associations with the disease atopic dermatitis.", "output": "MATCH (:Disease{name: \"atopic dermatitis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the genes associated with the disease primary biliary cirrhosis?", "output": "MATCH (:Disease{name: \"primary biliary cirrhosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of genes connected to the disease having the identifier DOID:4606.", "output": "MATCH (:Disease{identifier: \"DOID:4606\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are associated with the disease known as multiple sclerosis?", "output": "MATCH (:Disease{name: \"multiple sclerosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names can be found that are related to the disease with the identifier \"DOID:12236\"?", "output": "MATCH (:Disease{identifier: \"DOID:12236\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are associated with the disease with the identifier DOID:10763.", "output": "MATCH (:Disease{identifier: \"DOID:10763\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes associated with the disease called \"nicotine dependence\"?", "output": "MATCH (:Disease{name: \"nicotine dependence\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are associated with the disease known as primary biliary cirrhosis?", "output": "MATCH (:Disease{name: \"primary biliary cirrhosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the names of genes that are related to the disease with the identifier code \"DOID:11612\".", "output": "MATCH (:Disease{identifier: \"DOID:11612\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes that are associated with the disease multiple sclerosis?", "output": "MATCH (:Disease{name: \"multiple sclerosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are related to the disease represented by the identifier DOID:4606?", "output": "MATCH (:Disease{identifier: \"DOID:4606\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the associated gene names for the disease known as primary biliary cirrhosis?", "output": "MATCH (:Disease{name: \"primary biliary cirrhosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the genetic associations for the disease \"multiple sclerosis\" in terms of gene names?", "output": "MATCH (:Disease{name: \"multiple sclerosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes associated with the disease called age-related macular degeneration?", "output": "MATCH (:Disease{name: \"age related macular degeneration\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of genes associated with the disease \"pancreatic cancer\"?", "output": "MATCH (:Disease{name: \"pancreatic cancer\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene names are returned by querying genes that associate with the disease polycystic ovary syndrome?", "output": "MATCH (:Disease{name: \"polycystic ovary syndrome\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene names are related to the disease known as multiple sclerosis?", "output": "MATCH (:Disease{name: \"multiple sclerosis\"})-[:ASSOCIATES_DaG]->(g:Gene) RETURN g.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that have associations with the gene \"IL7\".", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"IL7\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that have an association with the ACTL9 gene.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"ACTL9\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases connected to the \"EGF\" gene through an association.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"EGF\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the gene named \"KCNA3\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"KCNA3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that are connected to the IL2RA gene through an association.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"IL2RA\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the list of disease names that relate to the gene with the name \"RNASE3\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"RNASE3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the names of diseases that have associations with genes on chromosome 17.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names are connected to the gene CD79A through an association?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"CD79A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the gene named \"SOCS1\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"SOCS1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the gene named FXYD3?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"FXYD3\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the disease names that have a relationship with genes on chromosome 17?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"17\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the diseases that have associations with genes found on the fifth chromosome.", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are related to the gene with the name \"MAPK1\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"MAPK1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of diseases that are associated with the gene named \"IL17A\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"IL17A\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names are returned when associated with the gene IGFBP1?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"IGFBP1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which disease names are linked to the gene called \"CYP24A1\" via an association relationship?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"CYP24A1\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the names of diseases connected to genes residing on the fifth chromosome?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What disease names are linked to genes specifically found on chromosome 5?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{chromosome: \"5\"}) RETURN d.name"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the names of the diseases that are associated with the gene named \"CDC6\"?", "output": "MATCH (d:Disease)-[:ASSOCIATES_DaG]->(:Gene{name: \"CDC6\"}) RETURN d.name"}]