[{"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all molecular functions that are linked to pharmacologic classes through up to three relationships?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:PharmacologicClass) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are pharmacologic classes and compounds related within up to three steps?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and display any relationships between nodes labeled as BiologicalProcess and Disease, with a path length ranging from one to three?", "output": "MATCH (n:BiologicalProcess)-[*1..3]-(m:Disease) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are molecular function nodes related to anatomy nodes if they are within three relationship hops?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Anatomy) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are anatomical entities directly or indirectly connected to genes within a three-step distance?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:Gene) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the molecular functions that are connected to genes within up to three hops in the network?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Gene) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all pairs of anatomy and symptom nodes linked through one to three relationships?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:Symptom) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pharmacologic classes are connected within one to three steps to various symptoms, and which symptoms are these?", "output": "MATCH (n:PharmacologicClass)-[*1..3]-(m:Symptom) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve all gene and side effect pairs that are connected by a path of one to three relationships?", "output": "MATCH (n:Gene)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which Anatomy nodes are associated with any BiologicalProcess nodes within a path length of one to three steps?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find anatomy-related nodes and their associated side effect nodes that are within three hops?", "output": "MATCH (n:Anatomy)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are related to side effects through any relationship path that spans one to three hops?", "output": "MATCH (n:Pathway)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find all the connections, spanning one to three links, between nodes labeled as BiologicalProcess and those labeled as Compound?", "output": "MATCH (n:BiologicalProcess)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do diseases in the database relate to side effects through connections of one, two, or three hops?", "output": "MATCH (n:Disease)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have a connection to any cellular component within one to three intermediary steps?", "output": "MATCH (n:Gene)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which Molecular Functions are associated with any Pathway within one to three relationship steps?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:Pathway) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify the relationships between symptoms and biological processes within a maximum of three steps?", "output": "MATCH (n:Symptom)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and list all gene nodes that are linked by one to three steps to any biological process nodes?", "output": "MATCH (n:Gene)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify diseases and their associated compounds within a maximum of three connections between them?", "output": "MATCH (n:Disease)-[*1..3]-(m:Compound) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are genes and symptoms related within a path consisting of one to three relational steps?", "output": "MATCH (n:Gene)-[*1..3]-(m:Symptom) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find cellular components that are related to compounds through one to three intermediary relationships?", "output": "MATCH (n:Compound)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components are connected to side effects through up to three hops?", "output": "MATCH (n:CellularComponent)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How do molecular functions relate to biological processes through a series of up to three intermediaries?", "output": "MATCH (n:MolecularFunction)-[*1..3]-(m:BiologicalProcess) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What biological processes are connected to cellular components through one to three degrees of separation in the database?", "output": "MATCH (n:BiologicalProcess)-[*1..3]-(m:CellularComponent) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are compounds related to side effects within three relationship hops in the graph?", "output": "MATCH (n:Compound)-[*1..3]-(m:SideEffect) RETURN n, m"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you retrieve the entire paths linking pathways to pharmacologic classes where the classes' source is \"PID via Pathway Commons\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.source = \"PID via Pathway Commons\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths connecting pathway nodes to anatomy nodes where the anatomy's origin is noted as WikiPathways?", "output": "MATCH path = (n:Pathway)-[*]-(m:Anatomy) WHERE m.source = \"WikiPathways\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are linked in any way to the gene named \"Thrombin signalling through proteinase activated receptors (PARs)\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:Gene) WHERE m.name = \"Thrombin signalling through proteinase activated receptors (PARs)\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve all the paths that involve gene nodes and lead to the disease matching the URL \"http://identifiers.org/ncbigene/64324\"?", "output": "MATCH path = (n:Gene)-[*]-(m:Disease) WHERE m.url = \"http://identifiers.org/ncbigene/64324\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths connecting molecular functions to genes that have the specific URL \"http://purl.obolibrary.org/obo/GO_0005219\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Gene) WHERE m.url = \"http://purl.obolibrary.org/obo/GO_0005219\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths connecting any molecular function nodes to the compound specifically known as \"L-proline transmembrane transporter activity\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Compound) WHERE m.name = \"L-proline transmembrane transporter activity\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths connecting any gene to the specific disease with the URL \"http://identifiers.org/ncbigene/401612\"?", "output": "MATCH path = (n:Gene)-[*]-(m:Disease) WHERE m.url = \"http://identifiers.org/ncbigene/401612\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the path between any molecular function and the disease that has \"malate dehydrogenase (decarboxylating) (NAD+) activity\" as its name?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Disease) WHERE m.name = \"malate dehydrogenase (decarboxylating) (NAD+) activity\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all the pathways linked to pharmacologic classes, particularly where the license of the pharmacologic class is \"CC BY 4.0\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are connected to the gene with identifier \"PC7_6058,\" and what are the paths between them?", "output": "MATCH path = (n:Pathway)-[*]-(m:Gene) WHERE m.identifier = \"PC7_6058\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the paths that link biological processes to the disease named \"interleukin-18 production\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:Disease) WHERE m.name = \"interleukin-18 production\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all the paths between nodes labeled as MolecularFunction and CellularComponent where the CellularComponent's source is identified as \"Gene Ontology\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:CellularComponent) WHERE m.source = \"Gene Ontology\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are associated through various relationships to the pharmacologic class with the name \"E2F mediated regulation of DNA replication\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.name = \"E2F mediated regulation of DNA replication\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all paths connecting any biological process to any cellular component that originates from the Gene Ontology source?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:CellularComponent) WHERE m.source = \"Gene Ontology\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths connecting genes and cellular components that involve a cellular component with the description \"BRCA2 and CDKN1A interacting protein\"?", "output": "MATCH path = (n:Gene)-[*]-(m:CellularComponent) WHERE m.description = \"BRCA2 and CDKN1A interacting protein\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the full paths linking 'Pathway' nodes to the 'PharmacologicClass' identified by \"PC7_3992\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.identifier = \"PC7_3992\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve and display the complete paths connecting any pathway to biological processes that are sourced from \"Reactome via Pathway Commons\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:BiologicalProcess) WHERE m.source = \"Reactome via Pathway Commons\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths that connect pharmacologic classes to genes with a class type designated as \"Mechanism of Action\"?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Gene) WHERE m.class_type = \"Mechanism of Action\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the pathways connected to the disease known as 'APOBEC3G mediated resistance to HIV-1 infection'?", "output": "MATCH path = (n:Pathway)-[*]-(m:Disease) WHERE m.name = \"APOBEC3G mediated resistance to HIV-1 infection\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How are any molecular functions related to the symptom known as \"N-acetyllactosaminide beta-1,6-N-acetylglucosaminyltransferase activity\" by any type of path within the dataset?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Symptom) WHERE m.name = \"N-acetyllactosaminide beta-1,6-N-acetylglucosaminyltransferase activity\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths can be identified between pharmacologic classes and cellular components that have the specific URL \"http://purl.bioontology.org/ontology/NDFRT/N0000187058\"?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:CellularComponent) WHERE m.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000187058\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve the connections between any gene and the biological process labeled as \"kidney associated antigen 1\"?", "output": "MATCH path = (n:Gene)-[*]-(m:BiologicalProcess) WHERE m.description = \"kidney associated antigen 1\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which entire paths exist that link any pharmacologic class to the compound labeled with the identifier N0000175547?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Compound) WHERE m.identifier = \"N0000175547\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the various paths connecting symptoms to the disease known as \"Hypertriglyceridemic Waist\" in the database?", "output": "MATCH path = (n:Symptom)-[*]-(m:Disease) WHERE m.name = \"Hypertriglyceridemic Waist\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all the paths between nodes labeled as Pathway and nodes labeled as BiologicalProcess, where the biological process nodes have a \"CC BY 4.0\" license?", "output": "MATCH path = (n:Pathway)-[*]-(m:BiologicalProcess) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths exist between anatomy entities and the disease designated by the URL \"http://purl.obolibrary.org/obo/UBERON_0001456\"?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Disease) WHERE m.url = \"http://purl.obolibrary.org/obo/UBERON_0001456\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all possible paths between molecular functions and the symptom associated with the URL \"http://purl.obolibrary.org/obo/GO_0008459\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Symptom) WHERE m.url = \"http://purl.obolibrary.org/obo/GO_0008459\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all relationships and paths between nodes of PharmacologicClass and Gene, specifically where the gene has a license type \"CC BY 4.0\"?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Gene) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find paths linking any biological process with cellular components that have the license type \"CC BY 4.0\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:CellularComponent) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Are there any paths linking any MolecularFunction to the PharmacologicClass called \"calmodulin-dependent cyclic-nucleotide phosphodiesterase activity,\" and if so, what do they look like?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:PharmacologicClass) WHERE m.name = \"calmodulin-dependent cyclic-nucleotide phosphodiesterase activity\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist that connect molecular functions to the specific compound \"phosphotransferase activity, carboxyl group as acceptor\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Compound) WHERE m.name = \"phosphotransferase activity, carboxyl group as acceptor\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible connection paths between biological processes and the disease called \"regulation of synaptic transmission, dopaminergic\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:Disease) WHERE m.name = \"regulation of synaptic transmission, dopaminergic\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths that connect any gene to any compound with a license of CC0 1.0?", "output": "MATCH path = (n:Gene)-[*]-(m:Compound) WHERE m.license = \"CC0 1.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you extract all the paths that exist between any molecular function and anatomy nodes wherein the anatomy's license is \"CC BY 4.0\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Anatomy) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths connecting compounds to cellular components that have a \"CC BY-NC 4.0\" license?", "output": "MATCH path = (n:Compound)-[*]-(m:CellularComponent) WHERE m.license = \"CC BY-NC 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide all the possible routes linking pathways to diseases when those diseases are obtained from Reactome via Pathway Commons?", "output": "MATCH path = (n:Pathway)-[*]-(m:Disease) WHERE m.source = \"Reactome via Pathway Commons\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all pathways that have any kind of relationship with the pharmacologic class whose identifier is \"PC7_12187\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.identifier = \"PC7_12187\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all paths between nodes labeled as \"MolecularFunction\" and \"CellularComponent,\" where the cellular component has the name \"adenylylsulfate kinase activity\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:CellularComponent) WHERE m.name = \"adenylylsulfate kinase activity\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the connection path between any pharmacologic class and the symptom with the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000175764\"?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Symptom) WHERE m.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000175764\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths connecting any anatomy nodes to the cellular component with the specific URL http://purl.obolibrary.org/obo/UBERON_0001814?", "output": "MATCH path = (n:Anatomy)-[*]-(m:CellularComponent) WHERE m.url = \"http://purl.obolibrary.org/obo/UBERON_0001814\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What interconnected paths exist between pathways and pharmacologic classes when the pharmacologic class is sourced from Reactome through Pathway Commons?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.source = \"Reactome via Pathway Commons\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the relationship pathways between any anatomy and the specific symptom represented by the URL \"http://purl.obolibrary.org/obo/UBERON_0000042\"?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Symptom) WHERE m.url = \"http://purl.obolibrary.org/obo/UBERON_0000042\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths connect anatomical nodes to the disease with mesh ID \"D012160\", traversing any number of relationships?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Disease) WHERE m.mesh_id = \"D012160\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all potential paths that link any anatomy node directly or indirectly to the specific symptom having the identifier \"UBERON:0001619\".", "output": "MATCH path = (n:Anatomy)-[*]-(m:Symptom) WHERE m.identifier = \"UBERON:0001619\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths exist between any pathway and cellular component that involve the \"Drug Induction of Bile Acid Pathway\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:CellularComponent) WHERE m.name = \"Drug Induction of Bile Acid Pathway\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths between any biological processes and the compound named \"regulation of skeletal muscle satellite cell proliferation\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:Compound) WHERE m.name = \"regulation of skeletal muscle satellite cell proliferation\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are related through any connection to the anatomical entity called \"regulation of FZD by ubiquitination\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:Anatomy) WHERE m.name = \"regulation of FZD by ubiquitination\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist that connect pharmacologic classes to genes when these genes are specifically categorized by their mechanism of action?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Gene) WHERE m.class_type = \"Mechanism of Action\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all pathways that link nodes of type PharmacologicClass to the particular CellularComponent node with the URL \"http://purl.bioontology.org/ontology/NDFRT/N0000175086\"?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:CellularComponent) WHERE m.url = \"http://purl.bioontology.org/ontology/NDFRT/N0000175086\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the paths connecting compounds to cellular components where the cellular component's URL is \"http://www.drugbank.ca/drugs/DB01361\"?", "output": "MATCH path = (n:Compound)-[*]-(m:CellularComponent) WHERE m.url = \"http://www.drugbank.ca/drugs/DB01361\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible relationships between any pathways and the gene with the name \"ALK2 signaling events\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:Gene) WHERE m.name = \"ALK2 signaling events\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I retrieve paths between nodes labeled as 'MolecularFunction' and 'BiologicalProcess' where the 'BiologicalProcess' nodes originate from the 'Gene Ontology' source?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:BiologicalProcess) WHERE m.source = \"Gene Ontology\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths that exist between molecular functions and anatomical entities which are specifically derived from the \"Gene Ontology\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Anatomy) WHERE m.source = \"Gene Ontology\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve all paths that connect any pathway nodes to pharmacologic class nodes linked by the URL \"http://www.wikipathways.org/instance/WP1528_r78581\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:PharmacologicClass) WHERE m.url = \"http://www.wikipathways.org/instance/WP1528_r78581\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you map out the paths that connect a BiologicalProcess node to the SideEffect node specified by URL \"http://purl.obolibrary.org/obo/GO_2000255\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:SideEffect) WHERE m.url = \"http://purl.obolibrary.org/obo/GO_2000255\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find connections between any gene and a biological process that has a CC0 1.0 license?", "output": "MATCH path = (n:Gene)-[*]-(m:BiologicalProcess) WHERE m.license = \"CC0 1.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which paths link symptoms and diseases, with the constraint that the disease must have a \"CC0 1.0\" license?", "output": "MATCH path = (n:Symptom)-[*]-(m:Disease) WHERE m.license = \"CC0 1.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you identify all the routes that link anatomy entities to pharmacologic classes sourced from the Uberon dataset?", "output": "MATCH path = (n:Anatomy)-[*]-(m:PharmacologicClass) WHERE m.source = \"Uberon\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find all the relationships and paths that lead from any \"MolecularFunction\" node to a \"Symptom\" node if that symptom\u2019s license is \"CC BY 4.0\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Symptom) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the complete path from any gene to the biological process with the URL \"http://identifiers.org/ncbigene/23568\"?", "output": "MATCH path = (n:Gene)-[*]-(m:BiologicalProcess) WHERE m.url = \"http://identifiers.org/ncbigene/23568\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the complete path between any biological process and the compound with the URL \"http://purl.obolibrary.org/obo/GO_0097421\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:Compound) WHERE m.url = \"http://purl.obolibrary.org/obo/GO_0097421\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all paths linking pharmacologic classes to compounds with a \"CC BY 4.0\" license?", "output": "MATCH path = (n:PharmacologicClass)-[*]-(m:Compound) WHERE m.license = \"CC BY 4.0\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the paths connecting biological processes to diseases that include a disease named \"immune effector process\"?", "output": "MATCH path = (n:BiologicalProcess)-[*]-(m:Disease) WHERE m.name = \"immune effector process\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths connecting genes to compounds where the compound's source is specified as \"Entrez Gene\"?", "output": "MATCH path = (n:Gene)-[*]-(m:Compound) WHERE m.source = \"Entrez Gene\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you identify the paths that link any anatomical structure with the symptom whose name is \"thyroid gland\"?", "output": "MATCH path = (n:Anatomy)-[*]-(m:Symptom) WHERE m.name = \"thyroid gland\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What paths exist between genes and any cellular components where the cellular component is named \"TSSK2\"?", "output": "MATCH path = (n:Gene)-[*]-(m:CellularComponent) WHERE m.name = \"TSSK2\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all the paths between nodes labeled as symptoms and the biological process node that has the URL \"http://identifiers.org/mesh/D018886\"?", "output": "MATCH path = (n:Symptom)-[*]-(m:BiologicalProcess) WHERE m.url = \"http://identifiers.org/mesh/D018886\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths that connect nodes labeled as 'MolecularFunction' to the 'BiologicalProcess' node with the identifier \"GO:0010521\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:BiologicalProcess) WHERE m.identifier = \"GO:0010521\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the possible paths between any molecular function and the compound with the identifier \"GO:0047006\"?", "output": "MATCH path = (n:MolecularFunction)-[*]-(m:Compound) WHERE m.identifier = \"GO:0047006\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are all the pathways that are connected to the cellular component with the identifier \"PC7_7357\" in any way?", "output": "MATCH path = (n:Pathway)-[*]-(m:CellularComponent) WHERE m.identifier = \"PC7_7357\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can one find all relationships and paths from compounds to the specified side effect with the URL \"http://www.drugbank.ca/drugs/DB02187\"?", "output": "MATCH path = (n:Compound)-[*]-(m:SideEffect) WHERE m.url = \"http://www.drugbank.ca/drugs/DB02187\" RETURN path"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the various pathways connected to the symptom node with the identifier \"PC7_3060\"?", "output": "MATCH path = (n:Pathway)-[*]-(m:Symptom) WHERE m.identifier = \"PC7_3060\" RETURN path"}]