[{"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions describe activities related to acting on carbon-nitrogen bonds in cyclic amides, excluding peptides, within their names?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"activity, acting on carbon-nitrogen (but not peptide) bonds, in cyclic amides\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways have a name that contains the text \"PAK dependent Axon repulsion\"?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"PAK dependent Axon repulsion\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all biological processes with a name that contains the substring \"of acute inflammatory response to non-antigenic stimulus\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"of acute inflammatory response to non-antigenic stimulus\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathways can be found whose names include the phrase \"results in viral DNA circles\"?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"results in viral DNA circles\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathways include \"of Sister Chromatid Cohesion\" in their names?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"of Sister Chromatid Cohesion\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions are associated with a name containing \"serine/threonine kinase inhibitor activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"serine/threonine kinase inhibitor activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all molecular functions with the name containing the text \"4-alpha-N-acetylglucosaminyltransferase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"4-alpha-N-acetylglucosaminyltransferase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all BiologicalProcess nodes where the name includes \"to inosine editing.\"", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"to inosine editing\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Are there any pathways with the name containing \"Strand Synthesis\"?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"Strand Synthesis\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions have names that feature 'dismutase copper chaperone activity'?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"dismutase copper chaperone activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathways related to \"C (ascorbate) metabolism\" can be found in the database?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"C (ascorbate) metabolism\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have names that contain the words \"segmental glomerulosclerosis\"?", "output": "MATCH (n:Disease) WHERE n.name CONTAINS \"segmental glomerulosclerosis\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways are identified by having \"transporters\" in their names?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"transporters\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I identify symptoms whose names include the word \"Syndrome\"?", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Syndrome\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find molecular functions with \"3'-splice site binding\" in their names?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"3'-splice site binding\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components have a name that includes the phrase \"phosphate diphosphokinase complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"phosphate diphosphokinase complex\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes have a description that includes the term \"LOC286063\" in their details?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"LOC286063\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How many biological processes have names containing \"of binding of sperm to zona pellucida\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"of binding of sperm to zona pellucida\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the genes whose descriptions feature the word \"anhydrase\".", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"anhydrase\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms are labeled with names that contain \"Thrombotic Thrombocytopenic\"?", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Thrombotic Thrombocytopenic\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find all genes with descriptions that reference \"ribosomal protein\"?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"ribosomal protein\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways contain the words \"phosphorylation cascade\" within their name in the database?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"phosphorylation cascade\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the genes described with \"acid phosphatase type 2 domain\" in their description?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"acid phosphatase type 2 domain\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all the pathways whose names mention \"signaling pathway\".", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"signaling pathway\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components have names that include the phrase \"polymerase transcription factor SL1 complex\"?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"polymerase transcription factor SL1 complex\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve the biological processes whose names mention \"cell maturation.\"", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"cell maturation\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the disease entities with names that mention \"caries\"?", "output": "MATCH (n:Disease) WHERE n.name CONTAINS \"caries\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "List the symptoms whose names mention \"Nausea and Vomiting.\"", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Nausea and Vomiting\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions contain \"hydratase activity\" in their name?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"hydratase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all symptoms where their names include \"Hemorrhage\"?", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Hemorrhage\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function entities include \"nucleobase transmembrane transporter activity\" in their name?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"nucleobase transmembrane transporter activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular functions have names that include the phrase \"ester transmembrane transporter activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"ester transmembrane transporter activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What biological processes related to cardiac muscle tissue development are present in the database?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"cardiac muscle tissue development\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways have names that feature the term \"cell surface interactions\"?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"cell surface interactions\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which genes are associated with a description that includes \"(Asp-Glu-Ala-Asp)\"?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"(Asp-Glu-Ala-Asp)\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What genes have descriptions that include \"LOC102724427\" within their information?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"LOC102724427\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all genes whose description mentions \"domain containing\".", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"domain containing\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What symptoms in the database have names that include the term \"Palsy\"?", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Palsy\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What pathways that include \"forward signaling\" in their names can be found in the database?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"forward signaling\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find cellular components with \"complex\" in their name.", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"complex\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What cellular components have names that include the term \"dense granule membrane\"?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"dense granule membrane\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the cellular components that include \"myosin complex\" in their name?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"myosin complex\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve genes that have \"biogenesis factor\" in their description field?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"biogenesis factor\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular function entries contain \"component C3b binding\" within their names?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"component C3b binding\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all cellular component nodes that include \"ubiquitin ligase complex\" somewhere in their name.", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"ubiquitin ligase complex\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which diseases have \"disorder\" in their names according to the database records?", "output": "MATCH (n:Disease) WHERE n.name CONTAINS \"disorder\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I list biological processes with names that mention \"arginylation\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"arginylation\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find all anatomy-related entries where the name contains the term \"joint\"?", "output": "MATCH (n:Anatomy) WHERE n.name CONTAINS \"joint\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which symptoms listed in the system have names that encompass the term \"Obesity\"?", "output": "MATCH (n:Symptom) WHERE n.name CONTAINS \"Obesity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find biological processes whose names contain the phrase \"of MAPKK activity\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"of MAPKK activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which biological processes have names that include the phrase \"extension involved in axis elongation\"?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"extension involved in axis elongation\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which pathways contain the specific name segment \"Alpha Pathway,\" and what are the properties of such pathways?", "output": "MATCH (n:Pathway) WHERE n.name CONTAINS \"Alpha Pathway\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes labeled as \"MolecularFunction\" contain \"light chain kinase activity\" in their name?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"light chain kinase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which components are identified as part of the mitochondrial outer membrane in their names?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"component of mitochondrial outer membrane\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which nodes labeled as CellularComponent contain \"vesicle membrane\" in their name?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"vesicle membrane\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all biological process nodes where the term \"to oxygen radical\" appears in their name.", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"to oxygen radical\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find anatomy entities where their name features the word \"tissue\"?", "output": "MATCH (n:Anatomy) WHERE n.name CONTAINS \"tissue\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all cellular components with names that feature \"filament\".", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"filament\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all nodes with the label \"SideEffect\" that have names containing \"texture abnormal.\"", "output": "MATCH (n:SideEffect) WHERE n.name CONTAINS \"texture abnormal\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find Gene nodes with descriptions that mention \"rich 14\"?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"rich 14\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we identify diseases from the database that have names containing \"cancer\"?", "output": "MATCH (n:Disease) WHERE n.name CONTAINS \"cancer\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which CellularComponent entities have a name that contains the words \"locus body\"?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"locus body\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which elements in the CellularComponent category have \"cytoplasm\" as a part of their name?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"cytoplasm\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the biological processes that have \"lobe development\" in their name?", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"lobe development\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all molecular functions that have the term \"region DNA binding\" within their name attribute.", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"region DNA binding\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions have names that mention \"inhibitor activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"inhibitor activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you list all the anatomical entities whose names include the term \"gland\"?", "output": "MATCH (n:Anatomy) WHERE n.name CONTAINS \"gland\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which molecular functions have names that include the term \"reductase activity\"?", "output": "MATCH (n:MolecularFunction) WHERE n.name CONTAINS \"reductase activity\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all cellular components whose names feature the term \"spine membrane\".", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"spine membrane\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which gene entries have descriptions containing the word \"and\"?", "output": "MATCH (n:Gene) WHERE n.description CONTAINS \"and\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all side effect entries where the name includes \"joint syndrome.\"", "output": "MATCH (n:SideEffect) WHERE n.name CONTAINS \"joint syndrome\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the 'BiologicalProcess' entities that have \"catabolic process\" mentioned within their names.", "output": "MATCH (n:BiologicalProcess) WHERE n.name CONTAINS \"catabolic process\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the CellularComponent nodes with a name containing \"surface furrow\"?", "output": "MATCH (n:CellularComponent) WHERE n.name CONTAINS \"surface furrow\" RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the pathway labeled \"Na+-dependent glucose transporters\"?", "output": "MATCH (n:Pathway { name: \"Na+-dependent glucose transporters\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find and return all pathways with the \"CC BY 4.0\" license attribute.", "output": "MATCH (n:Pathway { license: \"CC BY 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is available for the pathway called \"Hypoxia-mediated EMT and Stemness\"?", "output": "MATCH (n:Pathway { name: \"Hypoxia-mediated EMT and Stemness\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the details of the pathway with the name \"Signaling by FGFR in disease\"?", "output": "MATCH (n:Pathway { name: \"Signaling by FGFR in disease\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all pathway nodes where the source is specified as WikiPathways.", "output": "MATCH (n:Pathway { source: \"WikiPathways\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the details of the molecular function that has the name \"polyprenyltransferase activity\"?", "output": "MATCH (n:MolecularFunction { name: \"polyprenyltransferase activity\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the molecular function named \"peptide-methionine (R)-S-oxide reductase activity\"?", "output": "MATCH (n:MolecularFunction { name: \"peptide-methionine (R)-S-oxide reductase activity\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would I query to find information about pharmacologic classes with the specified license of \"CC BY 4.0\"?", "output": "MATCH (n:PharmacologicClass { license: \"CC BY 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What are the details of the compound whose InChI is \"InChI=1S/C21H20Cl2O3/c1-21(2)17(12-18(22)23)19(21)20(24)25-13-14-7-6-10-16(11-14)26-15-8-4-3-5-9-15/h3-12,17,19H,13H2,1-2H3\"?", "output": "MATCH (n:Compound { inchi: \"InChI=1S/C21H20Cl2O3/c1-21(2)17(12-18(22)23)19(21)20(24)25-13-14-7-6-10-16(11-14)26-15-8-4-3-5-9-15/h3-12,17,19H,13H2,1-2H3\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the Pathway that has the identifier \"PC7_3326\"?", "output": "MATCH (n:Pathway { identifier: \"PC7_3326\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What specific gene with the given description \"glutamic pyruvate transaminase (alanine aminotransferase) 2\" does this query aim to find?", "output": "MATCH (n:Gene { description: \"glutamic pyruvate transaminase (alanine aminotransferase) 2\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify the gene node associated with the description \"neurotrophic tyrosine kinase, receptor, type 3.\"", "output": "MATCH (n:Gene { description: \"neurotrophic tyrosine kinase, receptor, type 3\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you locate the BiologicalProcess entity that has the name \"bacterial-type flagellum-dependent cell motility\"?", "output": "MATCH (n:BiologicalProcess { name: \"bacterial-type flagellum-dependent cell motility\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information exists for the pathway labeled with the identifier \"PC7_6877\"?", "output": "MATCH (n:Pathway { identifier: \"PC7_6877\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the Symptom node that has the URL property set to \"http://identifiers.org/mesh/D065635\"?", "output": "MATCH (n:Symptom { url: \"http://identifiers.org/mesh/D065635\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find and return the pathway node with the name \"ATF4 activates genes\"?", "output": "MATCH (n:Pathway { name: \"ATF4 activates genes\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find all compounds with the licensing terms \"CC BY-NC 4.0\" in the dataset.", "output": "MATCH (n:Compound { license: \"CC BY-NC 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the information associated with the gene labeled as a \"ring finger protein 41, E3 ubiquitin protein ligase\"?", "output": "MATCH (n:Gene { description: \"ring finger protein 41, E3 ubiquitin protein ligase\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find all the data entries for biological processes that are licensed as \"CC BY 4.0\"?", "output": "MATCH (n:BiologicalProcess { license: \"CC BY 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is associated with the Pathway named \"Signaling by Activin\"?", "output": "MATCH (n:Pathway { name: \"Signaling by Activin\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Identify all cellular components where the license is specified as \"CC BY 4.0\".", "output": "MATCH (n:CellularComponent { license: \"CC BY 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Which properties are associated with the disease that has the identifier \"DOID:14268\" in our database?", "output": "MATCH (n:Disease { identifier: \"DOID:14268\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the details of the Gene node that has the specific URL \"http://identifiers.org/ncbigene/388951\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/388951\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What gene entries have the property indicating a CC0 1.0 license?", "output": "MATCH (n:Gene { license: \"CC0 1.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you find and return the gene node that matches the URL \"http://identifiers.org/ncbigene/5634\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/5634\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How would you find the 'Symptom' node identified by the URL \"http://identifiers.org/mesh/D007040\"?", "output": "MATCH (n:Symptom { url: \"http://identifiers.org/mesh/D007040\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What molecular function corresponds to the name \"interleukin-27 receptor binding\" in the dataset?", "output": "MATCH (n:MolecularFunction { name: \"interleukin-27 receptor binding\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is returned for the Pathway node labeled with the identifier \"PC7_7767\"?", "output": "MATCH (n:Pathway { identifier: \"PC7_7767\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we find the 'SideEffect' node that corresponds to the URL \"http://identifiers.org/umls/C1859270\"?", "output": "MATCH (n:SideEffect { url: \"http://identifiers.org/umls/C1859270\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all Pathway entities that are sourced from \"Reactome via Pathway Commons.\"", "output": "MATCH (n:Pathway { source: \"Reactome via Pathway Commons\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Retrieve all side effect entries that have a license of \"CC BY-NC-SA 4.0\".", "output": "MATCH (n:SideEffect { license: \"CC BY-NC-SA 4.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What is the specific Pathway node with the identifier \"PC7_1543\" in the database?", "output": "MATCH (n:Pathway { identifier: \"PC7_1543\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Find the molecular function entity that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_0016151\".", "output": "MATCH (n:MolecularFunction { url: \"http://purl.obolibrary.org/obo/GO_0016151\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Could you provide the Pathway entity labeled with the identifier \"PC7_3060\"?", "output": "MATCH (n:Pathway { identifier: \"PC7_3060\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "What information is retrieved about the gene with the URL \"http://identifiers.org/ncbigene/152518\"?", "output": "MATCH (n:Gene { url: \"http://identifiers.org/ncbigene/152518\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can we retrieve all pharmacologic class information sourced specifically from the FDA via DrugCentral?", "output": "MATCH (n:PharmacologicClass { source: \"FDA via DrugCentral\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the node with the name \"transcription factor activity, RNA polymerase II basal transcription factor binding\" classified under MolecularFunction?", "output": "MATCH (n:MolecularFunction { name: \"transcription factor activity, RNA polymerase II basal transcription factor binding\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can one find the MolecularFunction entity that has \"GO:0005501\" as its identifier?", "output": "MATCH (n:MolecularFunction { identifier: \"GO:0005501\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find \"Anatomy\" entities where the license is set to \"CC BY 3.0\"?", "output": "MATCH (n:Anatomy { license: \"CC BY 3.0\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you show me how to return the anatomy information for the \"sacro-iliac joint\"?", "output": "MATCH (n:Anatomy { name: \"sacro-iliac joint\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "How can I find the specific 'CellularComponent' node associated with the URL \"http://purl.obolibrary.org/obo/GO_0045281\"?", "output": "MATCH (n:CellularComponent { url: \"http://purl.obolibrary.org/obo/GO_0045281\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you find the cellular component that corresponds to the URL \"http://purl.obolibrary.org/obo/GO_0032593\"?", "output": "MATCH (n:CellularComponent { url: \"http://purl.obolibrary.org/obo/GO_0032593\" }) RETURN n"}, {"instruction": "Convert the following natural language into Cypher query.", "input": "Can you retrieve the biological process that corresponds to the specific URL \"http://purl.obolibrary.org/obo/GO_0048387\"?", "output": "MATCH (n:BiologicalProcess { url: \"http://purl.obolibrary.org/obo/GO_0048387\" }) RETURN n"}]